{"title":"Democracy Now - 05 jan 2011","uid":6084112,"size":456393046,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:0106a44fca3b17c529b415db0fc4140e0fab173c&amp;dn=Democracy+Now+-+05+jan+2011&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":null,"files":1,"time":1294245206,"description":"An alternative daily newschannel. One hour with news as you do not see it elsewhere.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n\nHeadlines for Jan 05, 2011\n\n- Republicans Set to Take Control of House\n- Slain Pakistani Governor Salman Taseer Buried\n- WikiLeaks: Israeli Blockade Meant to Keep Gaza on &quot;Brink of Collapse&quot;\n- DNA Evidence Frees Texas Prisoner After 30 Years\n- Healthcare Trade Association CEOs Pull in Millions\n- Texas Moves Toward Accepting Nuclear Waste\n- Navy Captain Relieved From Duty Over Explicit Videos\n- Ex-U.S. Official Accuses Haiti Contractor of Shortchanging Him\n- Floods Threaten Australia's Great Barrier Reef\n- Netanyahu Calls For U.S. To Release Israeli Spy Jonathan Pollard\n- ChÃƒÂ¡vez Suggests Oliver Stone, Sean Penn or Noam Chomsky Be Named Ambassador\n- Son of Deposed Shah Commits Suicide\n- Judy Bonds, 58, Anti-Mountaintop Coal Remove Campaigner, Dies\n\n\nSpecial reports\n\n- Return of the 'Death Panel' Myth &quot;A Travesty,&quot; Says Dr. Atul Gawande\n\nAs Republicans take control of the House today, GOP leaders say they will immediately try to repeal President Obama's signature healthcare law. Even before the repeal vote takes place, Republicans can lay claim to a key victory in the healthcare battle. This week the Obama administration said it would reverse a regulation that would have covered end-of-life planning for Medicare beneficiaries during their annual check-ups after Republicans revived the spectre of so-called 'death panels.' We spend the hour with one of the most influential health policy writers in the country: renowned surgeon and author, Dr. Atul Gawande.\n\n\n- Dr. Atul Gawande: Solitary Confinement is Torture\n\nThe physical and psychological effects experienced by people held for extended periods in solitary confinement is a topic Dr. Atul Gawande has written extensively about. Yesterday, four prisoners in the supermax Ohio State Penitentiary launched a hunger strike to protest being held for more than 17 years years of solitary confinement. The alleged WikiLeaks whistleblower, U.S. Army Private Bradley Manning, has also been held in solitary confinement for much of the past seven months. &quot;People experience solitary confinement as even more damaging than physical torture,&quot; says Dr. Gwande.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n","torrent":{"xt":"urn:btih:0106a44fca3b17c529b415db0fc4140e0fab173c","amp;dn":"Democracy+Now+-+05+jan+2011","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0106a44fca3b17c529b415db0fc4140e0fab173c","infoHashBuffer":{"type":"Buffer","data":[1,6,164,79,202,59,23,197,41,180,21,219,15,196,20,14,15,171,23,60]},"announce":[],"urlList":[]}}