{"title":"3 Great British Crime Movies ( -Lem)","uid":4789777,"size":2205177227,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:01c47871bba902ae605af23da968a361becc5411&amp;dn=3+Great+British+Crime+Movies+%28+-Lem%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"lemerise","files":-1,"time":1237672324,"description":"-Layer Cake (2004)\n\nA successful cocaine dealer, who has earned a respected place \namong England's Mafia elite, plans an early retirement from \nthe business. However, big boss Jimmy Price hands down a tough \nassignment: find Charlotte Ryder, the missing rich princess \ndaughter of Jimmy's old pal Edward, \na powerful construction business player and gossip papers \nsocialite. Complicating matters are two million pounds' worth \nof Grade A ecstasy, a brutal neo-Nazi sect and a whole series \nof double crossings. The title &quot;LAYER CAKE&quot; refers to the layer\ns or levels anyone in business goes through in rising to the \ntop. What is revealed is a modern underworld where the rules \nhave changed. There are no 'codes', or 'families' and respect \nlasts as long as a line. Not knowing who he can trust, he has \nto use all his 'savvy', 'telling' and skills which make him \none of the best, to escape his own. The ultimate last job, a \nlove interest called Tammy, and an international drug ring \nthreaten to draw him back into the 'cake mix'. But, time is \nrunning out and the penalty will endure a lifetime..\n\n\n-Lock, Stock, and Two Smoking Barrels (1998)\n\nEddy has been known as a cardsharp since he was young. So he \nand his three friends Soap, Tom and Bacon all decide to chip \nin Ã‚Â£25,000 each to allow him to play in an illegal high-roller\ngame run by one of the local villains, Hatchet Harry. However,\nEddy didn't realize the game was crooked and he ends up owing \nHarry Ã‚Â£500,000 with dire threats about losing his fingers one \nat a time if he doesn't pay within a week! Eddy and his friends\ndiscuss various completely illegal schemes to obtain the money\nand eventually decide to rip-off the gang of thieves next door\nwho themselves are planning to raid a clandestine drug growing\noperation which keeps all of its money in shoe boxes where the\ny grow the cannabis plants. The scheme is simple enough but the\nbest laid plans of mice and men always seems to go awry as \ndoes this one. As extreme chaos breaks loose the violence and \nassociated body count spiral out of control, Eddy and his \nfriends realize that they are out of their depth and \ndesperately try to find a way out before they too find \nthemselves among the casualties!\n\n\n\n-The Business (2005)\n\nSet in the Thatcher era with the cool sounds of the 80's, \nTHE BUSINESS is an action packed gangster flick set in Spain's \nsun drenched Costa Del crime. Frankie (Danny Dyer), is on the \nrun from the high-rise's of South London to a new life in \nMalaga with nothing but a tin stuffed full of cash. Having no \nidea that this delivery of cash to super-suave playboy and \nex-con, Charlie (Tamer Hassan), will change his life forever, \nhe soon becomes one of the gang, and finds himself drawn into \na flamboyant and violent world of organized crime. \n\n\n-Enjoy!!\n\n-Lem","torrent":{"xt":"urn:btih:01c47871bba902ae605af23da968a361becc5411","amp;dn":"3+Great+British+Crime+Movies+%28+-Lem%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"01c47871bba902ae605af23da968a361becc5411","infoHashBuffer":{"type":"Buffer","data":[1,196,120,113,187,169,2,174,96,90,242,61,169,104,163,97,190,204,84,17]},"announce":[],"urlList":[]}}