{"title":"Isreal - Palestine - Anarchists Against the Wall with Uri Gordon","uid":5274386,"size":741056204,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:01f666cca197d426c1408c27111e1454ddff9467&amp;dn=Isreal+-+Palestine+-+Anarchists+Against+the+Wall+with+Uri+Gordon&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Openvid","files":1,"time":1263327375,"description":"Anarchists Against the Wall is an Israeli action group supporting the\nPalestinian struggle in the West Bank. Join Uri Gordon for a presentation on\nthe achievements and limitations of this joint effort, and for anarchist\nperspectives on Palestinian national liberation. Gordon is the author of\nÃƒÂ¢Anarchy Alive! Anti-authoritarian Politics from Practice to Theory.ÃƒÂ¢\n\nUri Gordon (born August 30, 1976) is an Israeli anarchist theorist and activist.[1] He is a lecturer at the Arava Institute for Environmental Studies in Ketura, Israel.[2] One of several anarchist theorists to come of age during the anti-globalization movement at the turn of the twenty-first century,[3] he has worked with anarchist and radical movements including Indymedia, Peoples' Global Action, and Anarchists Against the Wall. Active primarily in Britain and his native Israel, Gordon has participated in protests at international summits across Europe.[4]\nGordon's book Anarchy Alive!, based on his PhD research at Oxford University, was well-received by reviewers.[5] He wrote a guest editorial following the Second Lebanon War in Anarchist Studies volume 14, issue 2, and contributed an article on anarchism in Israel to the subsequent issue.[6][7] He has written reviews for The New Formulation,[8] and Perspectives on Anarchist Theory.[9]\nGordon's work has also appeared in mainstream Israeli newspapers. He has written articles for the English language edition of Haaretz addressing the 2007ÃƒÂ¢2008 world food price crisis,[2] carbon emission trading,[10] and the 2008 civil unrest in Greece.[11] The Jerusalem Post featured Gordon's &quot;Right of Reply: Anarchy in the Holy Land!&quot; as an op-ed in its June 12, 2007 edition.[12]\n\nThis presentation was filmed live at Bluestockings Books in New York City on Tuesday September 22, 2009 by David Buccola\n\n\nThis movie is part of the collection: Open Source Movies\n\nProducer: David Buccola AKA Buddhagem\nAudio/Visual: sound\nKeywords: anarchism; Anarchists; Anarchy; Anarchists Against the Wall; AAtW; Uri Gordon; Palestine; Israel; Conflict; Resolution","torrent":{"xt":"urn:btih:01f666cca197d426c1408c27111e1454ddff9467","amp;dn":"Isreal+-+Palestine+-+Anarchists+Against+the+Wall+with+Uri+Gordon","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"01f666cca197d426c1408c27111e1454ddff9467","infoHashBuffer":{"type":"Buffer","data":[1,246,102,204,161,151,212,38,193,64,140,39,17,30,20,84,221,255,148,103]},"announce":[],"urlList":[]}}