{"title":"Psalm.13.2005.DVDRip.Xvid-reyn.avi","uid":4421391,"size":702075386,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:0309c42009fb92b6d17112bc9e40cf02f45be029&amp;dn=Psalm.13.2005.DVDRip.Xvid-reyn.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"pigmeat","files":-1,"time":1222801607,"description":"Psalm 13 (Rob Camies, NL 2005)\nPLEASE LEAVE A REVIEW!!!\n\n\n(The ultimate in campy surreallisme:This actionmovie gives true hommage to 70's B-movies and german dubbed film nostalgia. \n\nTwo brothers, Marcus and Lucas meet up after not having seen each other in 7 years. They plan a robbery, wich goes totally wrong. In the events that follow everyone wants the money, and they start of killing each other and everyone around them. Meanwhile there are plenty of intermezzo's to leave the story for a short moment and rethink what just happened...)\n\ned2k://|file|Psalm.13.2005.DVDRip.Xvid-reyn.avi|702075386|0BE3DEDC1F83C92138C4A8AC9CE49D72|/\n\nVier mensen plegen een overval die volledig uit de hand loopt als er doden bij vallen. De overvallers beginnen elkaar onderling ook naar het leven te staan en worden tot overmaat van ramp ook nog eens achtervolgd door een zwaar bewapende politiemacht.\n\nRegie: Rob Camies, met oa Bert Visscher\n\nCultfilm uit 2005, veelal opgenomen in stad en provincie Groningen. Voornamelijk onbekende acteurs. Quentin Tarantino meets Monthy Python en dan in een lowbudget productie. In ieder geval met heel, heel veel liefde gemaakt.\nCamies maakte met deze fim een ode aan zijn jeugd. Een tijd waarin je 5 tv-zenders had. De beste films waren op de Duitse tv en je wist niet beter of Bud Spencer en James Bond waren Duitsers.\nDe film is dan ook vanuit oorspronkelijk Nederlands nagesynchroniseerd en vervolgens weer ondertiteld in het Nederlands. Je moet er maar opkomen.\n\nEr zijn nogal wat harde scenes, rare scenes en vreemde muziek. Je kunt hem gerust verschrikkelijk goed noemen, maar ook heel slecht. In ieder geval een film die je niet zult vergeten, en dat is sowieso bijzonder in deze tijd van peperdure nietszeggende standaardproducties.\n\nKijkadvies: laat en onder invloed\n","torrent":{"xt":"urn:btih:0309c42009fb92b6d17112bc9e40cf02f45be029","amp;dn":"Psalm.13.2005.DVDRip.Xvid-reyn.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0309c42009fb92b6d17112bc9e40cf02f45be029","infoHashBuffer":{"type":"Buffer","data":[3,9,196,32,9,251,146,182,209,113,18,188,158,64,207,2,244,91,224,41]},"announce":[],"urlList":[]}}