{"title":"Keith Ward: Misusing Darwin","uid":4744467,"size":139232010,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:0533a3c69a9dc72b11fbab49075e1715d53fe360&amp;dn=Keith+Ward%3A+Misusing+Darwin&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"the_Phyrexian","files":-1,"time":1235757296,"description":"Scientists sometimes complain about the introduction of religious ideas into science. But many scientists, especially evolutionary biologists, blatantly introduce materialism into science.\n\nIn fact neither theism nor materialism are entailed by science. They are philosophical views, and materialism is a highly disputed and problematic philosophical theory, not supported by any major classical philosopher.\n\nMany eminent scientists confuse science and philosophy, commit themselves to materialism without seriously considering its problems, and make ill-considered remarks about religion, largely based on the anti-scientific beliefs of a minority of extremist Christians.\n\nCreationism should not be taught as science; but neither should materialism. It is time for some scientists to see that their allegedly purely scientific views are often founded on blind prejudice and culpable misunderstanding - Gresham College \n\n\nKeith Ward - Professor Keith Ward has a BA from the University of Wales, an MA from the University of Cambridge, an MA and B Litt from the University of Oxford, a DD from Cambridge and a DD from Oxford. He has held Lecturer posts in Logic at the University of Glasgow, Philosophy at St Andrew's, Philosophy of Religion at King's College London. He was Fellow, Dean and Director of Studies in Philosophy and in Theology at Trinity Hall Cambridge, where he was also Lecturer in Divinity. He was the F D Maurice Professor of Moral and Social Theology at the University of London, where he was also Professor and Head of Department of History and Philosophy of Religion. Professor Ward is an ordained priest in the Church of England and was until 2003 Canon of Christ Church, Oxford. He is a Fellow of the British Academy, holds an Honorary Doctorate from the Free University of Amsterdam, is an Honorary Fellow of Trinity Hall, Cambridge and of the University of Wales. He is a member of the Governing Council of the Royal Institute of Philosophy, and a member of the editorial boards of Religions Studies, Journal of Contemporary Religion, Studies in Inter-Religious Dialogue, and World Faiths Encounter. He has been a Visiting Professor at Drake University, Iowa, at Claremont Graduate School, California and at the University of Tulsa, Oklahoma. He also holds the Regius Professorship of Divinity at the University of Oxford for over a decade. Professor Ward has delivered numerous prestigious public lectures and is the author of many books.\n\n\n___________________________________________________________________________________\nplease leave a comment if you want, this is just to show what is out there...\nAnd before you go and spam, dl it watch it and make up your own mind...\ncheers the_phyrexian\n\nAre you a British citizen? Click here! (Petition to stop Sharia Law)\n &lt;a href=&quot; http://petitions.number10.gov.uk/shariastop&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://petitions.number10.gov.uk/shariastop&lt;/a&gt;\t\n\nthere is a reseed section, read it / use it...\n &lt;a href=&quot; http://suprbay.org/forumdisplay.php?f=35&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://suprbay.org/forumdisplay.php?f=35&lt;/a&gt;\n\nor visit my blog...\n &lt;a href=&quot; http://thephyrexian.tk&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://thephyrexian.tk&lt;/a&gt;","torrent":{"xt":"urn:btih:0533a3c69a9dc72b11fbab49075e1715d53fe360","amp;dn":"Keith+Ward%3A+Misusing+Darwin","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0533a3c69a9dc72b11fbab49075e1715d53fe360","infoHashBuffer":{"type":"Buffer","data":[5,51,163,198,154,157,199,43,17,251,171,73,7,94,23,21,213,63,227,96]},"announce":[],"urlList":[]}}