{"title":"GOM Media Player 2.1.17.4710","uid":4839698,"size":4652728,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:054ff561a4a07d67dfe6e811130ba6c74d591e54&amp;dn=GOM+Media+Player+2.1.17.4710&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"olofolleola4","files":-1,"time":1239455346,"description":"Copied from GOM Media Player Homepage:\n\n\nGOM Media Player Features \n\nCodec Finder\n\nGOM Player includes many codecs (XviD, DivX, FLV1, AC3, OGG, MP4, H263 and more) so you won't need to install separate codecs for most videos. For those videos that require a separate codec, GOM Player will find one and direct you to a place where you can download an open source version of the codec. That way, you won't get stuck with unnecessary codecs on your system.\n\nPlay Broken AVI Files (Patented)\n\nAVI files can't be played if the index is broken, or if the file isn't completely downloaded. This is because the index is located at the end of the file. GOM Player's patented technology enables users to view files with broken indexes or that are still being downloaded.\n\nPowerful Subtitle Support\n\nGOM Player supports SMI, SRT, RT, SUB(with IDX) files for subtitle. You can specify margin, location, size, resolution, font and others. You can also enable shadow, view ASF files with subtitle, karaoke subtitle mode. You can even synchronize subtitle and video if there's any mismatch.\n\nConvenient Playlist\n\nIf you run a video file and there is already a file with a similar name in the directory, it will be automatically added to your playlist. GOM Player has a similar playlist format as M3U, PLS, ASX and you can also include and edit different media formats on that playlist as well. It's easy to create and edit your own multimedia playlist with GOM Player.\n\nSupport Different Media Types\n\nAlong with different media format such as AVI, MPG, MPEG and DAT, GOM Player also supports streaming Windows media format (WMV, ASF, ASX). You can also watch DVD-quality videos with 5.1 channel audio output.\n\nScreen Capture\n\nScreen capture allows you to take a screenshot of your video directly from GOM Player. Using the Burst Capture feature, you can take continuous screenshots up to 999 shots.\n\nAdvanced Features\n\nThere are an endless number of advanced features. Customize brightness, contrast and saturation. Sharpen and add noise to your video. Try the audio equalizer. Repeat a section of your video with our A-B Repeat feature. Fast forward/rewind a few seconds using left/right keys. And much more for you to discover!\n\n\nSystem Requirements\n\n\nMicrosoft Windows 98SE, Me, 2000, XP, 2003 or Vista\n\nIntel-compatible CPU P3 or greater Minimum amount of RAM recommended by the operating system in use 20MB Hard Drive Space.\n\nSome videos may require the newest version of DirectX or Windows Media Player.\n\nRecommended settings may change according to different types of video files.\n\n\n\n\nChangelog:\n\n\nSecurity patch: .srt subtitle\n\nImprove HD decoding performance\n\nBug fix: Subtitle seeking problem\n\nBug fix: VC-1(WVC1) video codec problem with certain MPEG media files\n\nBug fix: EVR rendering problem\n\nModifying GOM Player process priority level\n\nModifying Gretech FLV source filter\n\nModifying configuration wizard\n\nAdd disabled filter list","torrent":{"xt":"urn:btih:054ff561a4a07d67dfe6e811130ba6c74d591e54","amp;dn":"GOM+Media+Player+2.1.17.4710","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"054ff561a4a07d67dfe6e811130ba6c74d591e54","infoHashBuffer":{"type":"Buffer","data":[5,79,245,97,164,160,125,103,223,230,232,17,19,11,166,199,77,89,30,84]},"announce":[],"urlList":[]}}