{"title":"The XP Files: Windows Hidden Tools for Secure Sharing, Communica","uid":4886547,"size":4178875,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:06feb2b7be5f6114be93afda2ba6b3f28963582e&amp;dn=The+XP+Files%3A+Windows+Hidden+Tools+for+Secure+Sharing%2C+Communica&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"VasiaZozulia","files":-1,"time":1241741328,"description":"Microsoft hopes to entice buyers with a number of new features planned for Windows XP. An image clipboard, for instance, lets XP users collect photos or video on a sidebar to make it easier to clip and edit them. CD burning will be much easier. Notebooks equipped with 802.11b wireless connections will be allowed to roam. The OS also functions much more efficiently than Windows 2000...Boot-up time is three to four times faster...In tests, Microsoft has found that 80 percent of notebooks can run through the shutdown/resume cycle in five seconds, while 70 percent recover in three seconds. The new Messenger tool (not yet available as a separate download) lards serious conferencing tools on top of the regular, typed chat windows. Messenger adds two-way audio and video, application sharing (in which your chat buddy views and controls programs on your PC), and whiteboarding (the ability to share freehand drawings and other graphics). Messenger even integrates with Remote Assistance, a feature that lets you yield control of your system to a friend (with enough password protection and time limitations to allay any fear of hacking). Windows Messenger shares contact lists and a back-end network with MSN Messenger, but it doesn't work with Microsoft's existing conferencing software, NetMeeting. --CNET\n\nFrom the Back Cover\nXP's Best-Kept Secrets Revealed!\n\nDuring the past decade, Microsoft has created the some of the best Internet communication programs in the world and has installed them on every Windows computer free, but mostly hidden. Until now, only a few knowledgeable computer users knew how to exploit the potential of these programs and understood the threats posed by the programs that Microsoft encouraged people to use. Now you're about to become one of the power users who knows how to harness the power of Microsoft's powerful Internet tools: NetMeeting, Windows Messenger, Outlook Express with Hotmail, HyperTerminal, and Phone Dialer. By reading this book, you'll learn to:\n\n-Chat with dozens of people at a time securely without any possibility of eavesdroppers\n-Share any photo, document, or program with friends or family anywhere\n-Save hundreds of dollars a month on phone bills! Talk with voice and video to as many as 6 people at once anywhere in the world\n-Send live video feeds from your computer to your friends and family\n-Exchange MP3 files, or any file, with any other Internet user securely\n-Protect your computer and Internet connection from human predators, viruses, and worms\n-Set up and manage as many personal e-mail accounts as you need and protect each against spam and undesirable e-mailers\n-Create whiteboard drawings that scores of other users can see, change, and comment on simultaneously\n-Choose the best Internet connection for your needs, and share it with your household\n-Understand the threat that Microsoft's .NET Passport and associated technologies pose to your privacy and security and defeat it","torrent":{"xt":"urn:btih:06feb2b7be5f6114be93afda2ba6b3f28963582e","amp;dn":"The+XP+Files%3A+Windows+Hidden+Tools+for+Secure+Sharing%2C+Communica","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"06feb2b7be5f6114be93afda2ba6b3f28963582e","infoHashBuffer":{"type":"Buffer","data":[6,254,178,183,190,95,97,20,190,147,175,218,43,166,179,242,137,99,88,46]},"announce":[],"urlList":[]}}