{"title":"Legend of The Seeker S2E01 (ENG)(NL SUBS) 2Lions-Team","uid":5168398,"size":1132951028,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:0712b9af42512c18d0e602b4979d4c757a95ee46&amp;dn=Legend+of+The+Seeker+S2E01+%28ENG%29%28NL+SUBS%29+2Lions-Team&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Pioen","files":-1,"time":1258505391,"description":"Legend of The Seeker S2E01 \n\n\nHet verhaal\n\nDe wereld waarin Legend of the Seeker zich afspeelt, is geheel fictief. Alles oogt er zoals de Middeleeuwen, wat de associatie met Lord of the Rings oproept. Mensen met zwaarden, paarden, Engelse accenten en indrukwekkende gewaden en o ja, tovenaars en magie. De serie is gebaseerd op de fantasyboeken van Terry Goodkind, genaamd The Sword of Truth. Nu hebben de meeste fantasyverhalen wel bepaalde overeenkomsten, dus denk niet dat je te maken hebt met een simpele kloon.\n\nIn deze wereld leven twee verschillende volkeren van elkaar gescheiden door een grens van energie, decennia geleden opgeworpen. Niemand kan die grens passeren, zo lijkt het, waardoor de vredelievende mensen aan de ene kant in alle rust kunnen leven. Op een dag komt er een jonge vrouw echter toch door de grens heen hun gebied binnen, met grote gevolgen. De vrouw blijkt op zoek naar de redding van haar volk en die moet uit onverwachte hoek komen.\n\nLegend of the SeekerEen goed fantasyverhaal kan niet zonder buitengewone personages waar je enorm mee meeleeft. De karakters in Legend of the Seeker zijn bijzonder, met klassieke trekjes. Kahlan is een jonge vrouw die als de serie begint, zich makkelijk in de problemen lijkt te werken, maar schijn bedriegt. Ze staat haar mannetje en heeft verborgen gaven.\n\nDe jonge Richard Cypher ziet in de eerste aflevering zijn leven volledig instorten en komt voor de uitdaging een volledig nieuw leven op te bouwen. Daarbij ontdekt hij een groot geheim over zichzelf dat hij zijn hele leven met zich blijkt mee te dragen. De tovenaar Zed staat deze twee bij met zijn wijsheid en magie.\n\nBovenal is Legend of the Seeker een avontuurlijke serie met zoektochten, epische gevechten en achtervolgingen door grote wouden. Waar series die zich in de tegenwoordige tijd afspelen nogal eens grijpen naar snelle auto?s, veel kogels en grote explosies, bedient deze serie zich van spannende zwaardgevechten, mysterieuze tovenarij en ouderwets heldendom.\n\nVoor spanning, spektakel en sprookjesachtige verhalen zit je helemaal goed bij Legend of the Seeker. Er wordt bovendien goed gebruik gemaakt van special effects: mooi en functioneel, zonder overdreven aanwezig te zijn. Al in de eerste aflevering komen de personages tot leven voor de kijker, waardoor je graag wilt weten hoe het ze verder zal vergaan.\n\n      \nEnglish\n\n  \n \n  Millions of readers the world over have been held spellbound by this valiant tale vividly told. Now, enter Terry Goodkind''s world, the world of The Sword of Truth. In the aftermath of the brutal murder of his father, a mysterious woman, Kahlan Amnell, appears in Richard Cypher''s forest sanctuary seeking help...and more. His world, his very beliefs, are shattered when ancient debts come due with thundering violence. In their darkest hour, hunted relentlessly, tormented by treachery and loss, Kahlan calls upon Richard to reach beyond his sword-to invoke within himself something more noble. Neither knows that the rules of battle have just changed...or that their time has run out. This is the beginning. One story. One Rule. Witness the birth of a legend.\n\n1. Marked\nRichard inadvertently opens an entry to the underworld, unleashing a terrible evil.\n\n\n\n\n\n\n\nBron: 720p HDTV\nAudio: Engels 5.1DD\nSubs: Nederlands door pinkGaai\nSpotinformatie \nCategorie : Beeld \nFormaat : DVD5 \nBron : TV\n \nOndertitels : Nederlands (instelbaar)\n \nGenre : Actie\nAvontuur\nFantasiefilm\nTV Shows/Series\n \nWeblink : http://dadt.com/lots\nWeblink : http://www.tvrage.com/shows/id-19609 \n\n\n***************************************** \n\nBrought to you by \n \n2Lions Team \n\nmeer zien?? \nKom dan eens kijken op ons forum \n &lt;a href=&quot;\nhttp://www.2lions.ons-forum.nl&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.2lions.ons-forum.nl&lt;/a&gt; \n\n2Lions-Team for all your Dutch MOVIES and more \n\n***************************************** \n\nDON T HIT AND RUN Niet gelijk afhaken als de film binnen is blijf seeden. \n\nDon`t quit after you finished the download, but keep seeding","torrent":{"xt":"urn:btih:0712b9af42512c18d0e602b4979d4c757a95ee46","amp;dn":"Legend+of+The+Seeker+S2E01+%28ENG%29%28NL+SUBS%29+2Lions-Team","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0712b9af42512c18d0e602b4979d4c757a95ee46","infoHashBuffer":{"type":"Buffer","data":[7,18,185,175,66,81,44,24,208,230,2,180,151,157,76,117,122,149,238,70]},"announce":[],"urlList":[]}}