{"title":"Eestimaa laul 88 (Estonian Song 1988)","uid":4694543,"size":731439104,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:07ccfe8eb99a195d0a9f738e2a00245b3d75832c&amp;dn=Eestimaa+laul+88+%28Estonian+Song+1988%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"hobuseunenagu","files":1,"time":1233511455,"description":"Video size: 416x304\nAudio: 48000hz, 16bps, 1ch\nLength: 2:54:54\nBitrate: 557kbps\n\nAs Communist Party control began to unravel when Gorbachev loosened the reins, Estonians tested their strength, timidly at first, and then with growing courage. It was a s though the jailor left the door open, but prisoners were unsure of their next move. Should they take a step out and see what happens, then another? Then run, run, run.\n\nThe Estonian people turned to song to begin testing their new limits. In September 1988, not a festival year and a year before the Berlin Wall came down, some 300,000 people, a quarter of the adult population, gathered at the song festival grounds to sing Estonian national songs, show the formerly forbidden Estonian flag and listen, for the first time, for calls for independence.\n\nJust two years later, in 1990, and still part of the USSR, up to 500,000 Estonians, one-third of the nation's population, came to the first non-Communist Party controlled Estonian Song Festival. The choir from the Russian Language School came dressed in the colors of the Estonian flag. And the performance by the Soviet Choir, from the Friendship Society, met with deafening silence.\n\nGustav Ernesaks (1908-1994) an aged revered conductor who had performed during the Estonian Republics inter-World War years came by horse and carriage. As a youthful twenty-nine years of age he first rose to the conductors platform in 1938 and led the chorus in singing his composition, &quot;Let's Get Going Men.&quot;\n\nBTW, The Estonian Literature Museum contains more that 1,300,000 pages of folk songs. It is said that only Ireland has more folk music than Estonia. In July, 2004 the festival had 21,325 singers, 796 choruses, and 51 orchestras. How inspiring to hear 19,000 choristers, the largest in the world, singing in unison, with precision and clarity, and leading the proudly standing 100,000 plus attendees, in singing Lydia Koidula's, My Fatherland, You Are My Love.\n\n\nLong Live Free Estonia.","torrent":{"xt":"urn:btih:07ccfe8eb99a195d0a9f738e2a00245b3d75832c","amp;dn":"Eestimaa+laul+88+%28Estonian+Song+1988%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"07ccfe8eb99a195d0a9f738e2a00245b3d75832c","infoHashBuffer":{"type":"Buffer","data":[7,204,254,142,185,154,25,93,10,159,115,142,42,0,36,91,61,117,131,44]},"announce":[],"urlList":[]}}