{"title":"Until The Light Takes Us - 2009 DVD, CABLE-RIP Norwegian Black M","uid":5485583,"size":4232171520,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:0aee6817768e598b10f6202344e66079ac8b3b32&amp;dn=Until+The+Light+Takes+Us+-+2009+DVD%2C+CABLE-RIP+Norwegian+Black+M&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":null,"files":-1,"time":1270690310,"description":"V:9\nA:9\n\nUntil the Light Takes Us is a feature length documentary chronicling the history, ideology and aesthetic of Norwegian black metal - a musical subculture infamous as much for a series of murders and church arsons as it is for its unique musical and visual aesthetics. This is the first (and only) film to truly shed light on a movement that has heretofore been shrouded in darkness and rumor and obscured by inaccurate and shallow depictions. Featuring exclusive interviews and veritÃƒÂ© with the musicians, a wealth of rare, seldom seen footage from the &quot;Inner Circle&quot;s earliest days, Until the Light Takes Us explores every aspect of the controversial movement that has captured the attention of the world. This is the movie that gets inside the minds and hearts of black metal's musicians. The filmmakers moved to Norway, living and filming there for two years. The movie is not about them though - it's about the extraordinary people and events that make black metal unique, unforgettable, and inevitable. This is black metal as seen through the eyes of those who created it, of those who live it, of those who are at the center of the story of black metal. Featuring: Gylve &quot;Fenriz&quot; Nagell, Varg Vikernes, Jan Axel &quot;Hellhammer&quot; Blomberg, Kjetil &quot;Frost&quot; Haraldstad, Ivar Bjornson, Abbath and Demonaz Doom Occulta, Kris &quot;Garm&quot; Rygg, Bjarne Melgaard, Harmony Korine, and more. The film, shot on 35 mm and dv, is directed and produced by Audrey Ewell and Aaron Aites. It is currently being edited in New York.  Written by Audrey Ewell\n\nMusic in order of appearance:\n\nMum - Ballad of the Broken Birdie Records\nDarkthrone - Kaatharian Life Code\nUlver - Not Saved\nBurzum - Ea, Lord of the Depths\nMayhem - Chainsaw *beep*\nBurzum - War\nGorgoroth - Destroyer Or About How to Philosophize With the Hammer\nMayhem - The Freezing Moon\nBurzum - Rundgang um die Transzendentale Saule der Singularitet\nUlver - Eittlane\nMayhem - Pure *beep* Armageddon\nDarkthrone - Quintessence\nDarkthrone - In the Shadow of the Horns\nUlver - Farger\nThorns - Home\nBoards of Canada - Gyroscope\nBurzum - Han Som Resite\nBoards of Canada - You Could Feel the Sky\nUlver - Shadows of the Sun\nBlack Dice - Motorcycle\nBurzum - Dunkelheit\nBurzum - Die Liebe Nerpus'\nThorns - Stellar Master Elite\nSun O))) - Sin Nanna\nBurzum - Gebrechlichkeit II\nCredits:\nMum - Ballad of the Broken Birdie Records \nEnslaved - Entrance-Escape\n\n-What Fenriz plays on vinyl at his place is Mayhem - Chainsaw Gutsfuck.\n-What is playing in the background while Fenriz talks about recording riffs and the cassette player is King Crimson - Epitaph then on later scenes, the song Moonchild.\n-While Korine dances (what a useless fucking faggot), Bethlehem - Die Anarchische Befreiung Der Augenzeugenreligion plays in the background.","torrent":{"xt":"urn:btih:0aee6817768e598b10f6202344e66079ac8b3b32","amp;dn":"Until+The+Light+Takes+Us+-+2009+DVD%2C+CABLE-RIP+Norwegian+Black+M","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0aee6817768e598b10f6202344e66079ac8b3b32","infoHashBuffer":{"type":"Buffer","data":[10,238,104,23,118,142,89,139,16,246,32,35,68,230,96,121,172,139,59,50]},"announce":[],"urlList":[]}}