{"title":"Alone In The Dark 4 - The New Nightmare - Portable.EXE","uid":11597839,"size":1446928384,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:0b6ececd86799d05c5bef86a3801e12d2bf7825a&amp;dn=Alone+In+The+Dark+4+-+The+New+Nightmare+-+Portable.EXE&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"globeplus","files":-1,"time":1417306345,"description":"Hello to all nice PC games fans ...\n\nAlone In The Dark 4 - The New Nightmare was the first Alone In The Dark game for the PC and was maded in 2001 ,the fans of this games series are expecting now the new Illumination game from the series and i got the opportunity to make a complete portable version of this first PC game of the series ...\n\nJUST DOUBLE CLICK ON THE DOWNLOADED EXECUTABLE ... THATÂ´S IT ...\n\nHAPPY GAME ...\n\n\nPlot\n\nSet on October 31, 2001. Edward Carnby's best friend and partner, Charles Fiske, has been found dead off the coast of Shadow Island, a mysterious island near the coast of Massachusetts. Carnby's investigation quickly leads him to Frederick Johnson, who informs him of Fiske's search for three ancient tablets with the ability to unlock an incredible and dangerous power. Johnson pleads with Carnby to take the place of Fiske and reopen the investigation in order to recover the tablets. Carnby accepts and makes it his mission to find Fiske's killer. Johnson introduces Edward to Aline Cedrac, an intelligent, young university professor. She joins Edward to recover the missing tablets and assist Professor Obed Morton, who she believes to be her father. While flying over the coast of Shadow Island, Edward and Aline's plane comes under attack by an unknown creature. Edward and Aline both jump out of the plane and parachute to the ground, but are separated immediately. Edward lands in the dense forest just outside a manor, while Aline lands on the roof of said manor.\n\nGameplay\n\nThe player is given the option of choosing which of the two protagonists they play as. Carnby's side of the plot is based mainly on fighting the monsters by physical means, particularly with his trusty double barreled revolver; while Aline's is more centered on puzzles. The two occasionally meet up, and the main areas of plot intersect.\n\nThe player soon comes under attack from Creatures of Darkness that appear out of nowhere and seem to be living shadows. These Creatures of Darkness are eventually revealed to be reptilian, silicon-based life forms from the center of the Earth, an enormous world of dark caverns known as the World of Darkness. Shadow Island apparently contains one of the many portals to this underground world. True to their name, the game's enemies are averse to light (which apparently turns them into ash), and this figures heavily in gameplay. Players can use their flashlight to repel certain creatures, and killing them is accomplished with such light-producing ammunition as &quot;magnesium bullets&quot; and &quot;phosphorus shells.&quot;\n\nLight plays a significant role in this game. One of the game's main features is the flashlight that can be used to light up the game's darkened scenes, revealing hidden details and uncovering items. To this end, the developers crafted an unusual graphics engine which allowed the 3D player character's flashlight to properly illuminate and cast shadows on the 2D, pre-rendered backdrops. This was accomplished by rendering the backdrops at various levels of illumination and including information on the distribution of objects in the scene. The graphics engine could then properly use brighter versions of the backdrop where the flashlight was expected to be casting light, and leave shadowed areas dark.\n\n\n\n\n\n\nenjoy","torrent":{"xt":"urn:btih:0b6ececd86799d05c5bef86a3801e12d2bf7825a","amp;dn":"Alone+In+The+Dark+4+-+The+New+Nightmare+-+Portable.EXE","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0b6ececd86799d05c5bef86a3801e12d2bf7825a","infoHashBuffer":{"type":"Buffer","data":[11,110,206,205,134,121,157,5,197,190,248,106,56,1,225,45,43,247,130,90]},"announce":[],"urlList":[]}}