{"title":"CORAL REEF -Adventure(WTC-SWE)","uid":4444432,"size":1016636342,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:0cd0415e7ef7a1c59d0624b6ed5383fc1405eb78&amp;dn=CORAL+REEF+-Adventure%28WTC-SWE%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"WTC-SWE","files":-1,"time":1223972894,"description":"IMAX:\n-----                     \n                             CORAL REEF ADVENTURE\n                            ----------------------\n\n\n\n\n\nLike any IMAX movie, Coral Reef Adventure is so vivid, vast, and colorful that you can't help but be astonished by its visual splendor. But this undersea exploration has a deeper, more serious agenda as well, warning its viewers that the natural magnificence of the world's most impressive coral reefs is, in most cases, a mere 30 years away from extinction due to the devastating effects of global (and oceanic) warming. \n\nWhether or not that timeframe is accurate (and there's not enough solid science presented here to prove it either way), it's tragically obvious that we are in the process of losing entire ecosystems that cannot be replaced, and when you witness these awesome coral reefs in their still-thriving vitality, you experience a sense of urgent responsibility toward our stewardship of planet Earth. \n\nBy showing us the commitment and potentially life-threatening work of reef explorers and world-class undersea cinematographers Howard and Michele Hall, the film provides an all-access pass to some of the most exotic, playful, and dangerous creatures in the ocean, presented with the kind of intense, almost three-dimensional clarity that can only be achieved in the IMAX format.\n\n And while the giant-screen awesomeness of IMAX is lost in translation to DVD, Coral Reef Adventure offers the best-to-date use of High Definition DVD-ROM formatting. For PC users equipped with Windows XP and Windows Media Player 9 series (or later) software, the amazing images in Coral Reef Adventure achieve an almost life-like resolution. The ultimate conclusion remains: If we don't do something to protect these delicate, endangered wonders of nature, we will lose a part of ourselves. --Jeff Shannon \n\n\n\n\n\n\nHRHDTV.\n\nFile Size: 969 MB \nFormat:AVI\nVideo Length: 00:46:17\nVideo Codec:DivX6\nVIdeo Bitrate: 2851 kbit/s\nAudio Bitrate: 163kbit/s\nAudio Codec: MPEG Layer -3(AC3)\nSubtitles: (N/A) \n\n\n\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0270291/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0270291/&lt;/a&gt;\n\n\n\n\n\nENJOY:\n\n\n\n\nYOUR CHOICE\n\nWTC-SWE\n\n\n\n(Please seed so others can enjoy)\n\t\t\n\n","torrent":{"xt":"urn:btih:0cd0415e7ef7a1c59d0624b6ed5383fc1405eb78","amp;dn":"CORAL+REEF+-Adventure%28WTC-SWE%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0cd0415e7ef7a1c59d0624b6ed5383fc1405eb78","infoHashBuffer":{"type":"Buffer","data":[12,208,65,94,126,247,161,197,157,6,36,182,237,83,131,252,20,5,235,120]},"announce":[],"urlList":[]}}