{"title":"Robin Hood - De musical 2001","uid":6255121,"size":571662810,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:10680f61f58976b71efc36dd7afd5021a1800f11&amp;dn=Robin+Hood+-+De+musical+2001&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Hades1379","files":19,"time":1300544677,"description":"Studio 100 Publishing\t\nPremiÃƒÂ¨re: 30 maart 2001\nLaatste voorstelling: 3 mei 2001\nAantal voorstellingen: 48\nAantal bezoekers: 70.000\n\n\nHet verhaal\nEngeland. Het jaar 1105. Koning Richard Leeuwenhart is vertrokken op een kruistocht. Zijn broer Koning Jan terroriseert de arme Angelsaksische boeren en eist onmenselijk hoge, belastingen. Robin Hood, die Richard Leeuwenhart trouw blijft is in opstand gekomen tegen het harde beleid van Koning Jan. Hij leeft samen met zijn bende teruggetrokken in de bossen van Sherwood bij Nottingham. Wanneer Robin Hood op een dag de kleine Robin ontmoet wiens ouders werden gevangengenomen door de Sheriff, is voor hem de maat vol. Hij besluit samen met zijn mannen het kasteel van Koning Jan te plunderen om hem een lesje te leren en de buit te verdelen onder de armen. In het kasteel ontmoet hij Marianne, de dochter van Koning Richard. Robin Hood voelt zich meteen tot haar aangetrokken, en wordt hierdoor de grootste rivaal van de Sheriff. Romantiek, spanning en humor zijn de ingrediÃƒÂ«nten van deze sprankelende musical Robin Hood.\n\nHet concept\nReeds in 1932 verscheen er een romantische mantel- en degenfilm met Errol Flyn in de rol van Robin Hood. Recenter herinneren we ons de schitterende Disney-versie (1974), de historisch vrij correcte Robin Hood, Price of Thieves (1991) en de hilarische Men in Tights (1993) . Als basis gebruikten de scenarioschrijvers de vele legenden over Robin Hood die al sinds de 14de eeuw in omloop zijn. In onze versie benadrukken we vooral het musical-comedy element en uiteraard de romantiek. Onze scenarioschrijvers hebben bewust de originele karakters behouden. Zo is er de wat onhandige, maar detrouwe Kleine Jan en de gezellige, rondborstige Broeder Tuck. De slechteriken van dienst zijn een excentrieke Koning Jan en zijn handlanger, de door en door slechte Sheriff van Nottingham.\nRobin hood\n\n-----\nDeze torrent is de CD met alle liedjes die gezongen werden in de musical\n\nde liedjes:\n\n01.Ouverture\n02.Sheriff van Nottingham\n03.Giet de wijn uit het vat\n04.Koning Jan let maar op\n05.Ping pingeling\n06.Koning Richard mijn vader\n07.Stelen &amp; verdelen\n08.Houd de dief\n09.Blauwe ogen\n10.De buit is binnen\n11.Morgen\n12.Schiettoernooi in Nottingham\n13.Kleine Robin\n14.Ik ben Robin Hood\n15.Oog in oog\n16.Voor altijd\n\nDe songteksten zitten erbij\n\n-----\n\nde liedjes zijn gekopieerd van de cd met de oorspronkelijke kwaliteit, beter zal je niet vinden.\n\n-----\n\neen bedankje of een commentaar is altijd leuk!\n\n-----\n\nAls je deze torrent download seed dan a.u.b enkele dagen of weken, ik kan niet eeuwig blijven seeden ","torrent":{"xt":"urn:btih:10680f61f58976b71efc36dd7afd5021a1800f11","amp;dn":"Robin+Hood+-+De+musical+2001","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"10680f61f58976b71efc36dd7afd5021a1800f11","infoHashBuffer":{"type":"Buffer","data":[16,104,15,97,245,137,118,183,30,252,54,221,122,253,80,33,161,128,15,17]},"announce":[],"urlList":[]}}