{"title":"The Penguins of Madagascar - The Big S.T.A.N.K. Season 2 Episode","uid":6850576,"size":60139381,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:121cc8d84ee3132556197e5f868d4c77f4110014&amp;dn=The+Penguins+of+Madagascar+-+The+Big+S.T.A.N.K.+Season+2+Episode&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"ryxxjaemz","files":1,"time":1322506721,"description":"While counting salt and pepper grains, Rico sneezes and accidentally re-activates 'S.T.A.N.K.', a pre-Private experiment to create the ultimate stink-based weapon- in the form of a toilet- to attack Doctor Blowhole, only for the project to be abandoned when Skipper noted that dolphins don't use toilets. With S.T.A.N.K. now ticking down towards detonation, the penguins attempt to dispose of it in the New Jersey dump, but Julian attempts to take S.T.A.N.K. as his new throne before he learns about its true purpose, subsequently becoming trapped on the toilet when the locking mechanism activates when he sits on it. While Maurice and Kowalski try to determine how to deactivate the locks back at the lair, Skipper, Rico and Mort take Julian and S.T.A.N.K. to the dump, although Rico and Mort are left behind when they accidentally get trapped in the subway and Rico has to provide a rocket to take Julian and Skipper the rest of the way. Realising that S.T.A.N.K.'s locks can be deactivated by salt, Skipper cries a single tear to deactivate the locks in time for Private- running aerial recon- to take Julian and Skipper out of harm's way. ","torrent":{"xt":"urn:btih:121cc8d84ee3132556197e5f868d4c77f4110014","amp;dn":"The+Penguins+of+Madagascar+-+The+Big+S.T.A.N.K.+Season+2+Episode","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"121cc8d84ee3132556197e5f868d4c77f4110014","infoHashBuffer":{"type":"Buffer","data":[18,28,200,216,78,227,19,37,86,25,126,95,134,141,76,119,244,17,0,20]},"announce":[],"urlList":[]}}