{"title":"NCAA.Basketball.1080i.One.Shining.Moment.2008.bballjohn32","uid":4936723,"size":423632896,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:12669af968a1b706c8786e699628e5675c729397&amp;dn=NCAA.Basketball.1080i.One.Shining.Moment.2008.bballjohn32&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"bballjohn32","files":-1,"time":1244283066,"description":"2008 NCAA Mens Basketball One Shining Moment - Kansas National Champions\n\n&quot;One Shining Moment&quot; is an inspirational song written by David Barrett about the Men's College Basketball Championship (at the end of the NCAA Division I Men's Basketball Tournament). &quot;One Shining Moment&quot; is traditionally played at the end of CBS Sports' coverage of the championship game of the tournament. The song is played as the winning team's players cut down the nets, to a montage of highlights from the tournament.\n\nBarrett, a singer/songwriter from Michigan, wrote the song after seeing Larry Bird star for Indiana State in the 1979 NCAA tournament. In 1986, he passed the song along to high school friend Armen Keteyian, an investigative journalist for CBS Sports and also at the time Sports Illustrated, who in turn passed it to CBS Sports Creative Director Doug Towey. However, Towey originally planned to debut the song not after a basketball game, but after a football game, Super Bowl XXI. It was to have been the postgame montage from that contest, but CBS ran past the expected airtime and had a primetime show to debut in the next time slot, so the montage was canceled. CBS then asked Barrett for use of the song after the 1987 NCAA championship game, in which Indiana beat Syracuse. Barrett was asked to change the opening lyrics, &quot;The ball is kicked,&quot; to &quot;The ball is tipped.&quot; He agreed to the change, and Towey decided to use &quot;One Shining Moment&quot; to close CBS' coverage of the Tournament. The positive public response led to it becoming an annual feature. It has been used to end CBS' coverage ever since.\n\nResolution: 1080i","torrent":{"xt":"urn:btih:12669af968a1b706c8786e699628e5675c729397","amp;dn":"NCAA.Basketball.1080i.One.Shining.Moment.2008.bballjohn32","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"12669af968a1b706c8786e699628e5675c729397","infoHashBuffer":{"type":"Buffer","data":[18,102,154,249,104,161,183,6,200,120,110,105,150,40,229,103,92,114,147,151]},"announce":[],"urlList":[]}}