{"title":"hitlers.death.the.final.report Multisub","uid":4602896,"size":946925309,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:166588b38acf916c8ddd294e308418ea4e760b99&amp;dn=hitlers.death.the.final.report+Multisub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Daniel_Miccan","files":5,"time":1230320511,"description":"I den hÃƒÂ¤r avslÃƒÂ¶jande dokumentÃƒÂ¤rfilmen om Hitlers sista timmar i livet, gjord som en samproduktion mellan Discovery Channel, RTL, brittiska BBC\noch Timewatch, kommer nya fakta upp till ytan. Fakta som bygger pÃƒÂ¥ avslÃƒÂ¶janden gjorda efter Berlinmurens fall. Filmen kastar ljus ÃƒÂ¶ver mÃƒÂ¥nga av de frÃƒÂ¥gor som legat i skugga sedan krigsslutet 1945..\n\nVad hÃƒÂ¤nde egentligen i Hitlers bunker dÃƒÂ¥ ryssarna marscherade in i Berlin? Hur kom det sig att de allierade inte berÃƒÂ¤ttade sanningen om vad de funnit i bunkern? VarfÃƒÂ¶r har, tills nu, alla fakta om Adolf Hitlers sista dygn i livet hemlighÃƒÂ¥llits? Den hÃƒÂ¤r skakande dokumentÃƒÂ¤ren har mÃƒÂ¥nga av svaren. Intervjuer med folk som fanns i Hitlers nÃƒÂ¤rhet under hans sista dagar i livet, fynd som gjordes i samband med krigsslutet, men som hemlighÃƒÂ¥llits under ett halvt sekel, tecknar en klar bild av de skakande timmarna fÃƒÂ¶r det tredje rikets ledare, nu decimerad till en besegrad och psykiskt instabil mÃƒÂ¤nniska i livets slutskede.\n\nEXTRAMATERIAL: DokumentÃƒÂ¤rfilmen &quot;Fascismens mÃƒÂ¶rka\nÃƒÂ¥rhundrade&quot; om hela 1900-talets grymma krigshistoria. \n\n\n\n\n\nIn this revealing documentary film about Hitler's last hours of life, made as a co-production between Discovery Channel, RTL, British BBC\nand Time Watch, new facts to the surface. Facts based on revelations made after the fall of the Berlin Wall. The film throws light on many of the issues that have been in the shadows since the war ended in 1945 ..\n\nWhat really happened in Hitler's bunker when the Russians marched into Berlin? How came it that the allies are not told the truth about what they found in the bunker? Why has, until now, all the facts about Adolf Hitler's last days in life kept secret? This shocking documentary, many of the answers. Interviews with people who were in Hitler's proximity during his last days of life, findings that were made in connection with the end of the war, but kept secret for half a century, paints a clear picture of the shocking hours for the third kingdom leaders, now decimated to a defeat and mentally unstable man in life.\n\nExtras: Documentary film &quot;Fascismens dark\ncentury &quot;for the entire 1900-century cruel war history.","torrent":{"xt":"urn:btih:166588b38acf916c8ddd294e308418ea4e760b99","amp;dn":"hitlers.death.the.final.report+Multisub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"166588b38acf916c8ddd294e308418ea4e760b99","infoHashBuffer":{"type":"Buffer","data":[22,101,136,179,138,207,145,108,141,221,41,78,48,132,24,234,78,118,11,153]},"announce":[],"urlList":[]}}