{"title":"ROLE-MODELS.DVDrip[vice]","uid":5154320,"size":684958713,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:1a08ee2e3b0f5ce249e25eef516d7d99a121bd43&amp;dn=ROLE-MODELS.DVDrip%5Bvice%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"vicerock","files":-1,"time":1257759828,"description":"COMEDY\nROLE MODELS DVDrip\n\nVIDEO CODEC Xvid\nformat Avi\nsize/res 480x234[wide screen]\nrun-time 01:41:09\nvideo bitrate 768\nvideo framerate 25\nXvid profile asp5\n\nAUDIO CODEC mp3\naudio bitrate 128\nsample rate 44100\na/v sync basic\nCast\n\n* Paul Rudd as Danny Donhaue\n* Seann William Scott as Anson Wheeler\n* Elizabeth Banks as Beth Jones\n* Christopher Mintz-Plasse as Augie Farks\n* Bobb'e J. Thompson as Ronnie Shields\n* Jane Lynch as Gayle Sweeney\n* Ken Jeong as King Argotron\n* Ken Marino as Jim Stansel (Augie's Mother's Boyfriend)\n* Kerri Kenney-Silver as Lynette Farks (Augie's Mother)\n* A.D. Miles as Martin Gary\n* Joe Lo Truglio as Michael Kuzzik\n* Vincent Martella as Martonius Kuzzik\n* Matt Walsh as Davith of Glencracken\n* Nicole Randall Johnson as Karen Shields (Ronnie's Mother)\n* Alexandra Stamler as Queen Esplen (Sarah)\n* Jessica Morris as Linda the Teacher\n* Carly Craig as Connie\n* Keegan-Michael Key as Duane\n* Amanda Righetti as Isabel\n* Jorma Taccone as Mitch\n* Elijah Polanco as Ronny's Friend\n* Nate Hartley as Rule master\nPlot\n\nDanny and Wheeler are two Los Angeles salesmen for an energy drink, Minotaur. Wheeler loves the job but Danny, on the other hand, hates the job and possesses a constant negative attitude toward life, which results in the collapse of his relationship with his girlfriend, attorney Beth. One day after making a sales presentation at a high school, the duo find that their company truck is being towed. They protest by trying to drive it away from the tow truck, but end up crashing it into a school statue.\n\nDanny and Wheeler are arrested and the judge sentences the two to a 30-day jail sentence. Beth, however, manages to strike a deal with the judge in which they have to log 150 hours of community service over the next fifty days. The judge selects for their community service a big-brother style program called Sturdy Wings, led by Gayle Sweeny. Gayle, who takes an instant dislike to Danny and Wheeler, is aware that their presence at Sturdy Wings is court-ordered and warns them that if they fail to carry out their tasks to her satisfaction, she will have them sent to prison. Wheeler is paired up with Ronnie Shields, a foul-mouthed, streetwise miscreant obsessed with breasts who has driven away all the other &quot;Bigs&quot; he has been paired with, while Danny is paired up with Augie Farks, a nerdy teenager obsessed with live action role-playing games.\n\nInitially, the pair find their task extremely difficult, with Danny unable to find any common ground with Augie and his narrow interests, and Ronnie taking virtually no interest in Wheeler. After a few days they gradually bond with their respective partners; Ronnie takes an interest in Wheeler's favorite band KISS and discovers that Wheeler shares his obsession with breasts, whilst Danny joins Augie's medieval live action role playing game, &quot;LAIRE&quot;. At the same time, Danny tries to make up with Beth for his mistakes, but to no avail.\n\nUnfortunately, their success is cut short after Danny gets himself and Augie permanently banned from LAIRE after causing a fight with the &quot;King&quot; and then earns the animosity of Augie's parents after criticizing their negative attitude towards his interests. Wheeler, meanwhile, takes Ronnie to a party and leaves him unsupervised while he has sex with another guest, resulting in Ronnie walking home by himself. Ronnie's and Augie's parents consequently ask Sturdy Wings to assign them new mentors. As such, the pair are given a court appointment where they will likely be sentenced to jail. In the elevator, Danny berates Wheeler for leaving Ronnie behind while Wheeler scolds him about his whining. The two have a falling out and go their separate ways.\n\nDanny looks through his closet and finds the battle attire Augie had given him. He convinces the LAIRE king to allow Augie to fight in that afternoon's Battle Royale, the final battle of the year. Meanwhile, Wheeler goes to Ronnie's house and gets permission from Ronnie's mother to hang out with Ronnie after he gets out of jail. While Danny is visiting, Augie learns that he has been expelled by his LAIRE team. Danny offers to form a new team with him, but a team must have at least four members. &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0430922/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0430922/&lt;/a&gt;\n\nPLEASE SEED AND ENJOY THANKS","torrent":{"xt":"urn:btih:1a08ee2e3b0f5ce249e25eef516d7d99a121bd43","amp;dn":"ROLE-MODELS.DVDrip%5Bvice%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1a08ee2e3b0f5ce249e25eef516d7d99a121bd43","infoHashBuffer":{"type":"Buffer","data":[26,8,238,46,59,15,92,226,73,226,94,239,81,109,125,153,161,33,189,67]},"announce":[],"urlList":[]}}