{"title":"Lee Ann Womack - Finding My Way Back Home","uid":4949007,"size":133046276,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:1c939ca9ca583e147af1765ef18f8851404b8873&amp;dn=Lee+Ann+Womack+-+Finding+My+Way+Back+Home&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":-1,"time":1244801530,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 256 kbps\n\n\nLee Ann Womack (born August 19, 1966, in Jacksonville, Texas, United States) is an American country music singer and songwriter, who is best-known for her old fashioned-styled country music songs that often discuss subjects such as cheating and lost love. Her 2000 single, &quot;I Hope You Dance&quot; was a major crossover music hit, reaching #1 on the BIllboard Country Chart and the Top 15 of the Billboard Hot 100, becoming her signature song.\n\nAlthough Lee Ann Womack emerged as a contemporary country artist in 1997 with the release of her first album, her material closely resembled that of Dolly Parton and Tammy Wynette, mixing Womack's music with an old fashioned style, as well as contemporary elements, making her different from her counterparts. However her 2000 release, I Hope You Dance was an entirely different sound, using Pop music elements instead of traditional country, helping to establish Womack as a Pop crossover artist. It wasn't until the release of There's More Where That Came From in 2005 that Womack returned to recording traditional country music again.\n\nPresently, Womack has released a total of six studio albums and two compilations. Four of her studio albums have received a Gold certification or higher by the RIAA, and she has sold over five million albums in the United States. Additionally, she has received five Academy of Country Music Awards, five Country Music Association Awards, and one Grammy Award.\n\nIn 2006, Womack announced plans of a sixth studio album off of Mercury Nashville Records. The lead single, &quot;Finding My Way Back Home&quot; was released in the late summer of that year and debuted at #46 on the Billboard Country Chart. The single later peaked at #37 and was re-scheduled into 2007, because Womack found more songs that she wanted to record, however it was never released and Womack left Mercury.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:1c939ca9ca583e147af1765ef18f8851404b8873","amp;dn":"Lee+Ann+Womack+-+Finding+My+Way+Back+Home","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1c939ca9ca583e147af1765ef18f8851404b8873","infoHashBuffer":{"type":"Buffer","data":[28,147,156,169,202,88,62,20,122,241,118,94,241,143,136,81,64,75,136,115]},"announce":[],"urlList":[]}}