{"title":"Straight.To.The.Anal.XXX.DVDRip.XviD-PLEASURE","uid":4773902,"size":1466708344,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:1d9d4254548f514a18e5ff648fc9a07760cc172e&amp;dn=Straight.To.The.Anal.XXX.DVDRip.XviD-PLEASURE&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"sylop","files":103,"time":1237142208,"description":"TITLE...........: Straight.To.The.Anal.XXX.DVDRip.XviD-PLEASURE\n\nRELEASE.DATE....: 03/15/09                                                            \nSTREET.DATE.....: 11/18/08\nSOURCE..........: DVD\nRESOLUTION......: 512x384\nRUNTIME.........: 135 min\nAUDIO...........: 128kbps vbr mp3\nVIDEO...........: 1348 Kbps\nLANGUAGE........: English\nSIZE.CD1........: 49X15Mb\nSIZE.CD2........: 49X15Mb\nCATEGORY........: Anal\n\nIn this modern classic from multiple AVN Award Winner VINCE VOUYER, beautiful women cut right to the chase, skipping the obligatory vaginal sex that slows down so many anal movies! A hit since the day it originally hit the streets, VOUYER MEDIA has given STRAIGHT TO THE ANAL a digital age makeover that includes never-before scene footage, updated packaging, and a crystal clear, all-new transfer!The sex is rich and varied, with FLICK SHAGWELL kicking things off in a heated romp with Mark Davis that features plenty of ATM action and ends with an exceedingly vivid facial. FUJIKO takes on Brandon Iron and Mark Wood next, blowing them both before getting buttfucked in a variety of increasingly creative positions!The three-way action continues in the follow-up, with CHERIE catching a facial from Mark Ashley before a second stud injects her with a molten cream pie. Ashley and Iron return to get blown by VENUS, who works both their cocks orally before taking them up the ass and catching a double facial at scene's end. Fans of one-on-one hammering will love the next sequence, as multiple AVN award winning beauty JENNA HAZE takes centerstage in a scorching backdoor screw with Mark Wood ends with her receiving a load to the kisser. The intense action comes to a frenzied conclusion in the final scene, as iconic adult superstar BELLADONNA gets spectacularly DP'ed before receiving a massive double facial.The extras are just as exciting, especially an all-new bonus scene featuring rising Canadian sex star ZEINA HEART. The critics at ADULT DVD TALK gave STRAIGHT TO THE ANAL a full 5 star rating upon its original release, raving, &quot;there are countless anal themed movies available, but having strictly anal sex is unique and something that I would like to see more directors do!&quot;AVN was just as enthusiastc, observing, &quot;Ihe scenes are all consistently hot, with the female performers showing a true enthusiasm for ass-fucking. Well lit and framed, this is a great effort from Vince Vouyer!&quot;\n\nCast: Belladonna, Brandon Iron, Cherie, Flick Shagwell, Fujiko Kane, Jenna Haze, Mark Ashley, Mark Davis, Mark Wood, Venus, Zeina Heart\n\n &lt;a href=&quot;\nhttp://www.jam-bits.com/torrent/Anal/3359/Straight.To.The.Anal.XXX.DVDRip.XviD-PLEASURE.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.jam-bits.com/torrent/Anal/3359/Straight.To.The.Anal.XXX.DVDRip.XviD-PLEASURE.html&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:1d9d4254548f514a18e5ff648fc9a07760cc172e","amp;dn":"Straight.To.The.Anal.XXX.DVDRip.XviD-PLEASURE","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1d9d4254548f514a18e5ff648fc9a07760cc172e","infoHashBuffer":{"type":"Buffer","data":[29,157,66,84,84,143,81,74,24,229,255,100,143,201,160,119,96,204,23,46]},"announce":[],"urlList":[]}}