{"title":"Best Picture - 1928 - Wings","uid":6709007,"size":1466947630,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:20610bfe7b59173b5646eee122299788242dd476&amp;dn=Best+Picture+-+1928+-+Wings&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"rambam1776","files":-1,"time":1317286591,"description":"Best Picture 1928 - Wings\n\nVideo Codec..........: XviD 1.0.3 \nVideo Bitrate........: 1384kbps \nDuration.............: 1:01:41\nResolution...........: 512*384 \nFramerate............: 23.976 \nAudio Codec..........: 0x2000 (Dolby AC3) AC3 \nAudio Bitrate........: 192 kbps CBR \nAudio Channels.......: 2 \nFilename.............: Wings 1927 Part One.avi \nFilesize.............: 732,964,864 \nSubtitles............: It's a silent movie, stupid.\n\n\nNOTE - A quality DVD print of this film has never been released, and this rip (swiped from Demonoid) is clearly a copy of one of the inferior foreign market POS prints out and about. Hopefully, a decent version of this will someday become available, but this is the best you can do for now. On the other hand, its a cheesy silent movie from 1928. Does it really matter? Just watch it and add it to your &quot;I have seen all the Best Picture Winners!&quot; list.\n\n &lt;a href=&quot;\nhttp://bayimg.com/BAkpiaAdD&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://bayimg.com/BAkpiaAdD&lt;/a&gt;\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0018578/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0018578/&lt;/a&gt;\n &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/Wings_(film)&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/Wings_(film)&lt;/a&gt;\n\n\nWings (1927) is a silent film about World War I fighter pilots, produced by Lucien Hubbard, directed by William A. Wellman and released by Paramount Pictures. Wings was the first film, and the only silent film, to win the Academy Award for Best Picture. Wings stars Clara Bow, Charles &quot;Buddy&quot; Rogers, and Richard Arlen. Gary Cooper appears in a scene which helped launch his career in Hollywood and also marked the beginning of his affair with Clara Bow.\n\nPlot\n\nJack Powell (Rogers) and David Armstrong (Arlen) are rivals in the same small American town, both vying for the attentions of pretty Sylvia Lewis (Ralston). Jack fails to realize that &quot;the girl next door&quot;, Mary Preston (Bow), is desperately in love with him. The two young men both enlist to become combat pilots in the Air Service. When they leave for training camp, Jack mistakenly believes Sylvia prefers him. She actually prefers David and lets him know about her feelings, but is too kindhearted to turn down Jack's affection.\n\nJack and David are billeted together. Their tent mate is Cadet White (Gary Cooper), but their acquaintance is all too brief; White is killed in an air crash the same day. Undaunted, the two men endure a rigorous training period, where they go from being enemies to best friends. Upon graduating, they are shipped off to France to fight the Germans.\n\nMary joins the war effort by becoming an ambulance driver. She later learns of Jack's reputation as an ace and encounters him while on leave in Paris. She finds him, but he is too drunk to recognize her. She puts him to bed, but when two Military Police barge in while she is innocently changing from a borrowed dress back into her uniform in the same room, she is forced to resign and return to America.\n\nThe climax of the story comes with the epic Battle of Saint-Mihiel. David is shot down and presumed dead. However, he survives the crash landing, steals a German biplane, and heads for the Allied lines. By a tragic stroke of bad luck, he is spotted and shot down by Jack, who is bent on avenging his friend. When Jack lands to pick up a souvenir, he becomes distraught when he learns what he has done, but before David dies, he forgives his comrade.\n\nWith the end of the war, Jack returns home to a hero's welcome. When he returns David's effects to his grieving parents, David's mother blames the war, not Jack, for her son's death. Then, Jack is reunited with Mary and realizes he loves her.\n\n\nCast\n\nClara Bow as Mary Preston\nCharles &quot;Buddy&quot; Rogers as Jack Powell\nRichard Arlen as David Armstrong. Arlen met co-star Ralston on the set and married her in 1927.\nJobyna Ralston as Sylvia Lewis\nEl Brendel as Herman Schwimpf, a cadet who washes out and becomes an air force mechanic\nRichard Tucker as Air commander\nGary Cooper as Cadet White\nGunboat Smith as Sergeant\nHenry B. Walthall as David's father\nRoscoe Karns as Lieutenant Cameron\nJulia Swayne Gordon as David's mother\nArlette Marchal as Celeste\nHedda Hopper as Jack's mother (uncredited)\nGeorge Irving as Jack's father (uncredited)\n\nAcademy Awards\n\nOn May 16, 1929, the first ever Academy Award ceremony was held at the Hotel Roosevelt in Hollywood to honor outstanding film achievements of 1927 and 1928. Wings was entered in a number of categories but in contrast with later awards, there was no Best Picture award. Instead, there were two separate awards for production, the Most Artistic Quality of Production, won by Sunrise: A Song of Two Humans (1927) and the Most Outstanding Production, won by Wings as well as Best Effects, Engineering Effects for Roy Pomeroy.\n\nThe following year, the Academy instituted a single award called Best Production, and decided retroactively that the award won by Wings had been the equivalent of that award, with the result that Wings is often listed as the winner of a sole Best Picture award for the first year. The title of the award was eventually changed to Best Picture for the 1931 awards.","torrent":{"xt":"urn:btih:20610bfe7b59173b5646eee122299788242dd476","amp;dn":"Best+Picture+-+1928+-+Wings","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"20610bfe7b59173b5646eee122299788242dd476","infoHashBuffer":{"type":"Buffer","data":[32,97,11,254,123,89,23,59,86,70,238,225,34,41,151,136,36,45,212,118]},"announce":[],"urlList":[]}}