{"title":"Figures Of Happiness","uid":4288787,"size":1338767742,"categoryP":"porn","categoryS":"games","magnet":"?xt=urn:btih:222a62a1394f6340ccafaa053b734bd376ffcab3&amp;dn=Figures+Of+Happiness&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Arizth","files":9,"time":1215826624,"description":"Welcome to the world of Figures of Happiness, a love story that goes beyond life and death!\n\nMinamo is a pure and romantic girl who can be quite clumsy at times, and she&amp;#039;s in love with the handsome Satoru, a boy in her class. While working at her part-time job, Minamo spies Ryo and his girlfriend Mio as they eat together, their love for each other clearly visible in their eyes. She wishes she could sit like that with Satoru, but she knows she&amp;#039;s too shy to ever come out and confess her feelings to him.\n\nSoon after, Minamo is killed in an accident. Filled with remorse at not seizing her chance for love while she was alive, she visits Ryo and asks for his help. If he&amp;#039;ll lend her his own life force, she&amp;#039;ll be able to tell her feelings to Satoru. Ryo doesn&amp;#039;t know until it&amp;#039;s too late that lending Minamo his life energy will turn him into a lifeless spirit!\n\nAnd so the wheels of fate turn, winding the destinies of everyone together: dead Minamo and her reluctant helper Ryo; the pure Mio and her carefree twin sister Mao; the competitive Kokoro, who won&amp;#039;t give up Satoru without a fight; the lonely spirit Izumi; and the perplexing Soul Collector. What twists and turns await this cast of characters before the final act is played?\n\nBecause TPB needs more hentai.","torrent":{"xt":"urn:btih:222a62a1394f6340ccafaa053b734bd376ffcab3","amp;dn":"Figures+Of+Happiness","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"222a62a1394f6340ccafaa053b734bd376ffcab3","infoHashBuffer":{"type":"Buffer","data":[34,42,98,161,57,79,99,64,204,175,170,5,59,115,75,211,118,255,202,179]},"announce":[],"urlList":[]}}