{"title":"doktorn kan komma 26-30","uid":4545040,"size":8018204672,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:227e4dada22263dcd674e4184a4dd71cdb836cee&amp;dn=doktorn+kan+komma+26-30&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"fiskkatten","files":23,"time":1228090500,"description":"26. Into the future \nThe Queen of the Outback competition is held in Windoona and Emma wins! On the way back Gibbo has to fly, even though he is on vacation because the other pilot was drunk. The engines catches fire, and he has to do an emergency landing. Everything seems to be all right, but Gibbo is seriously ill. He has to fly to Broken Hill but on the way he dies. George Baxter is elected new M.P of the district.\n\n\n\nseason 2\n\n27. Good day for it\nSam and Kate are worrying about a woman named Sal Cleary, she acts a bit odd. They check it out and it turns out her daughter Julie is pregnant. She isn&amp;#039;t married but still wants to keep the baby. The family wanted to pretend the baby was Sal&amp;#039;s, so both she and Julie has to stay out of sight until the baby is born. At the birth there are some complications but everything goes well eventually and Geoff, Kate and Sam make everybody think it was Sal&amp;#039;s child. There is a political election between George Baxter and a man named Rob Dalton. George wins.\n\n28. Horses for courses\nA man called Jim has a car-accident and goes to hospital. His wife, Carol, is acting a bit strange about it. Chris finds out she&amp;#039;s dyslectic, but she refuses to admit it. Later her son drinks some medicine, she can&amp;#039;t read the bottle and so everybody finds out over the radio she can&amp;#039;t read and write. Sam buys a horse from Carol, who is an extremely good rider, and Sam and Kate are practicing together for the big rodeo. Carol doesn&amp;#039;t want to ride in the rodeo, she feels embarresed, but she turns up anyway. There&amp;#039;s a beer-strike and Hurtle makes some own beer. But suddenly the whole town starts acting really strange. Geoff finds out Hurtle has mixed the alcohol with caffeine, which causes personality changes!\n\n29. The unluckiest boy in town \nA woman named Barbara Freeman finds out she&amp;#039;s got a braindisease. It&amp;#039;s hereditary, but her husband Robert won&amp;#039;t tell their son Michael, he doesn&amp;#039;t want him to worry. But Michael hears it anyway, and steals Baxter&amp;#039;s airplane. DJ wants to start a disco to get the youngsters calm, they have caused a lot of trouble. Jack gives him permission to build a gym. Jack&amp;#039;s boss Kevin has heard complaints about the youngsters and shows up. He decides to transfer Jack, but when he sees how Jack talked Michael down from the plane he changes his mind. Finally DJ gets his disco and celebrates with a huge party!\n\n30. It isn&amp;#039;t cricket \nA rich man called Nigel turns up in town. Due to an accident he ends up in hospital. He has got one glass eye, and a melanoma in the other one. He refuses an operation since that would make him completely blind and doesn&amp;#039;t care what the others say. Finally Kate and a blind lady convince him to have the operation. There&amp;#039;s a cricket game between the Crossing and Windoona and Nigel manages to get a top national player to play for Coopers Crossing. Sam plays for Windoona, and finally it&amp;#039;s him versus Emma - Emma wins and so does the Crossing!!\n\n","torrent":{"xt":"urn:btih:227e4dada22263dcd674e4184a4dd71cdb836cee","amp;dn":"doktorn+kan+komma+26-30","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"227e4dada22263dcd674e4184a4dd71cdb836cee","infoHashBuffer":{"type":"Buffer","data":[34,126,77,173,162,34,99,220,214,116,228,24,74,77,215,28,219,131,108,238]},"announce":[],"urlList":[]}}