{"title":"PowerArchiver 2010 v11.62+Serial [ kk ]","uid":5338642,"size":9079950,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:23edd673aa27d2a13e393f9e4e4e5f4a02ca4b7c&amp;dn=PowerArchiver+2010+v11.62%2BSerial+%5B+kk+%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"kentucky-kid","files":2,"time":1265393980,"description":"KKKK      KKKK                KKKK      KKKK  iiii            dddd\nKKKK    KKKK                  KKKK    KKKK                    dddd\nKKKK  KKKK          ****      KKKK  KKKK      iiii      dddddddddd\nKKKKKKKK        ************  KKKKKKKK        iiii    dddd    dddd\nKKKKKK              ****      KKKKKK          iiii    dddd    dddd\nKKKKKKKK          ********    KKKKKKKK        iiii    dddd    dddd\nKKKK  KKKK                    KKKK  KKKK      iiii    dddd    dddd\nKKKK    KKKK                  KKKK    KKKK    iiii    dddd    dddd\nKKKK      KKKK                KKKK      KKKK  iiii      dddddddddd\n\nxoxoxoxoxox\nx N A M E x\nxoxoxoxoxox\n\nPowerArchiver 2010 v11.62\n\nxoxoxoxoxoxoxoxoxoxoxoxox\nx D E S C R I P T I O N x\nxoxoxoxoxoxoxoxoxoxoxoxox\n\nPowerArchiver contains all the basic features you would expect from a compression program / archive utility - you can read and extract from many different formats and you can also create archives in many different formats, including 7-Zip which is one of the best compression formats currently used. What makes PowerArchiver different from many similar utilities is the wealth of advanced features it has. Simply put, PowerArchiver is one of the most innovative utilities of its kind and many features you now take for granted in a compression utility were first offered in PowerArchiver.\n\nThese include our new modern interface - licensed from Microsoft Office UI, powerful explorer shell extensions, password manager, advanced encryption support, backup features, archive converter, multiple extract tool, batch zip tool, FTP integration, powerful SFX support, ability to customize PowerArchiver look with our skinning support, as well as many other tools. PowerArchiver prides itself on its simple, smarter way of doing things throughout the whole application. Newly developed Professional versions adds even more features such as: CD/DVD/BD burning, FTP Client and many advanced backup features.\n\nFeatures:\n- Complete built-in support for 7-ZIP, ZIP, CAB, LHA (LZH), TAR, TAR.GZ, TAR.BZ2, BH, RAR, ARJ, ARC, ACE, ZOO, GZ, and BZIP2 file formats\n- Support for reading and extracting disc image formats: ISO, BIN, IMG and NRG\n- Built-in support for XXE, UUE, and yENC encoded files and full MIME (Base 64) support\n- Creating ZIP and CAB and PAE encrypted self-extracting archives using a Wizard interface\n- Support for unlimited size ZIP archives, with improved performance when working with 100,000+ files\n- Support for Deflate64, providing improved compression results (both size and speed)\n- Complete support for PKZIP 4.0 and PKZIP 4.5 disk spanning\n- Compression Profiles to store frequently used compression settings\n- Full support for ZIP AES encryption, 128-bit/192-bit/256-bit (supports: PKZip 5.1 (full), Secure Zip 8.0 and WinZip 9.0 AE-1 &amp; AE-2) and proprietary PAE format using 5 different methods: Blowfish (128-bit), DES (64-bit), Triple DES (128-bit), AES 128-bit, and AES 256-bit\n- Support for AES encrypted 7-Zip archives and multivolume 7-Zip archives\n- Uploading archives or backups directly to FTP or SFTP (SSH) sites with multiple profiles supported and timeout option\n- Password manager for saving frequently used passwords\n- Tool for creating PBS backup scripts and running automated backups\n- Internal viewer that supports TXT, RTF, GIF, PNG, BMP, ICO, TIFF, GFI, SGI, EMF, WMF, PPM, Adobe Photoshop, Autodesk, Truevision, - ZSoft Paintbrush, Kodak Photo-CD, JASC PaintShop Pro, and Dr. Halo file formats\n- Many powerful archive operations (including: renaming files in archive, spanning archives, testing archives, viewing and writing comments, installing archives, and checking archives for viruses)\n- Drag and Drop from/to Windows Explorer and the Desktop\n- Two ways of viewing archives (Classic - all files in the same listing; Explorer - browsing through an archive like folders in Windows Explorer)\n- Complete integration with Windows (extracting archives and creating archives directly from Windows Explorer using powerful &quot;Explorer Shell Extensions&quot;)\n- Ability to edit files within an archive using one single operation\n- Printing file listing to text file or HTML document\n- Tool for repairing corrupted ZIP archives\n- Converting between file formats (for example: changing a ZIP archive to CAB archive, or LHA archive to ZIP archive)\n- Extracting multiple archives at the same time\n- Batch Zip function to create multiple different archives at once\n- Favorite Folders to quickly locate archives\n- Powerful Find function for searching within an archive\n- Auto Update to automatically download and install new versions of PowerArchiver\n- Powerful help in HTML and a tutorial with pictures for beginners\n- Full skinning support via PSF files - includes interface skins, toolbar skins, icons and customizable application settings\n- Customizable toolbar that can be docked to any side of the application or float independently\n\n***************************************************************************\nxoxoxoxoxox\nx N O T E x\nxoxoxoxoxox\n\n1. ALL my uploads scanned by Kaspersky Anti-Virus                           \n   (They won't be here if they never pass)\n\n2. While using TPB, please make sure to have check that torrent throughly before executing it.\n\n3. Common type of fakes/infected torrents\n\n-&gt;  No username (Anonymous) &lt;- with NO SKULLS\n-&gt;  Only has 1 or 2 uploads\n-&gt;  Randomy generated usernames; ie 'ghjjsda', 'rqrqnds', 'rqrwsx'\n\n4. Should you find a bad torrent(fakes/infected torrent), DO NOT hesitate to report it here:\n  &lt;a href=&quot; http://forum.suprbay.org/forumdisplay.php?fid=29&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://forum.suprbay.org/forumdisplay.php?fid=29&lt;/a&gt; (Create a 'New Thread' there)\n\n-&gt;  Note: We ONLY remove the following:\n\n    * Spam (including spam comments)\n    * Trojan/malware/virus/etc.\n    * Fake\n    * NOTHING ELSE\n\nxoxoxox\nx FaQ x\nxoxoxox\n\nQ: 'I download this movie/video, but there's only picture in it, no sounds. Why??'\nA: It's because you're missing certain codecs. There's 2 option to this ; \n   \n   OPTION 1: Download &amp; install the free K-Lite Mega Codec Pack here: \n\n  &lt;a href=&quot; http://www.free-codecs.com/download/K_Lite_Mega_Codec_Pack.htm&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.free-codecs.com/download/K_Lite_Mega_Codec_Pack.htm&lt;/a&gt;\n   \n   OPTION 2: Download &amp; install VLC Media Player here: http://www.videolan.org/vlc/ ; use it to play the movie/video file which you've downloaded\n\nQ: 'I download a keygen from a user &amp; my AV flagged it as a virus!'\nA: It MIGHT be false positives flagged by your AV, OR it might really be a virus. \n\n   First, look at the uploader. Does he has a skull(pink/green) with him? If yes, most probably that keygen is NOT infected.\n   \n   However, on a safe side, what you can do is download the similar torrent from another skulled user &amp; check if your AV flagged it as infected of not. \n\n   IF NO, high chances the previous torrent perhaps IS infected.\n   IF YES, most probably it's false positive.\n\n   Well, if you're still unsure, you can just drop by to our forum &amp; report it here: \n  &lt;a href=&quot; http://forum.suprbay.org/forumdisplay.php?fid=29&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://forum.suprbay.org/forumdisplay.php?fid=29&lt;/a&gt; ; the staff will gladly double-check it.                                                                    \n\nQ: 'I can no longer log into my account on TPB. Why is this so?'\nA: Most probably you're banned. Don't worry, drop by to the forum &amp; explain it here: http://forum.suprbay.org/showthread.php?tid=3772\n\nQ: 'I registered an account on TPB, but i don't receive any of the confirmation/activation email. Why?'\nA: It might be the mail servers are down. Come to the forum, and post it here: http://forum.suprbay.org/showthread.php?tid=50701\n\nQ: 'I don't know how to mount an image file. I don't know this I don't know that. How?'\nA: Again, drop by to the forum here: http://forum.suprbay.org/index.php &amp; create a new thread under the Help Section\n   Alternatively, you can browse through the Tutorials Section first to see if anyone have already answered your question here: http://forum.suprbay.org/forumdisplay.php?fid=43\n\n* You can read up other FaQs regarding TPB here: http://forum.suprbay.org/showthread.php?tid=25383 (Credits to Adapa for this)\n                                                      \n* Check out for more of my uploads @ \n &lt;a href=&quot;\nhttp://thepiratebay.se/user/kentucky-kid/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/kentucky-kid/&lt;/a&gt;\n\n* After your download, please DON'T forget to seed so that you can help others get this torrent &amp; feel free to leave any comments.              \n\n--&gt; Should you need help in anything(NO REQUESTS), feel free to approach me on SuprBay(The Pirate Bay Forum) here: \n &lt;a href=&quot;\nhttp://forum.suprbay.org/member.php?action=profile&amp;uid=77652&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://forum.suprbay.org/member.php?action=profile&amp;uid=77652&lt;/a&gt;\n\nCheers! \n\nRegards,\nkentucky-kid :]","torrent":{"xt":"urn:btih:23edd673aa27d2a13e393f9e4e4e5f4a02ca4b7c","amp;dn":"PowerArchiver+2010+v11.62%2BSerial+%5B+kk+%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"23edd673aa27d2a13e393f9e4e4e5f4a02ca4b7c","infoHashBuffer":{"type":"Buffer","data":[35,237,214,115,170,39,210,161,62,57,63,158,78,78,95,74,2,202,75,124]},"announce":[],"urlList":[]}}