{"title":"doomsday dvd rip all menus present an functional","uid":4961039,"size":4687763991,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:257e73380a7e199bd9b134f546cdeac025a842ed&amp;dn=doomsday+dvd+rip+all+menus+present+an+functional&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"01010110","files":-1,"time":1245311634,"description":"this will play like the normal DVD this is complete menus and all.(assuming all goes well)\n\nI don't know where to assume people's knowledge is of how seeds work but if you get mad when a download is slow it's because the guy before you shut off the download when it got to 100% if you leave the torrent alone after it reaches 100% you are making the download go a little faster for everybody else. please be a nice person and help out other people who like similar films.\n\nthere are two methods of playing it(that i know of)\nburn the video_ts folder to a DVD using the Clone DVD program (a lot of effort not worth it)\nor,\nopen the video_ts folder with VLC media player. go to open disc, browse, select (whatever you named it), hit enter, press play, and it will work like a DVD in your disc drive.\n\nIf you require PAL format you will be required to use the second of the two methods to watch this dvd it is in NTSC format.\n\nif you encounter any problems i have a notepad file titled &quot;Help desk&quot; it contains an E-mail address and you may e-mail me at that address.\n\nby the way here's a download of VLC media player if you don't have it right here\n==&gt; http://files.uberdownloads.com/software/video-player/VLC.html\nplease leave comments telling me every little thing i did wrong. can't fix it if i don't know there's a problem. ;)","torrent":{"xt":"urn:btih:257e73380a7e199bd9b134f546cdeac025a842ed","amp;dn":"doomsday+dvd+rip+all+menus+present+an+functional","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"257e73380a7e199bd9b134f546cdeac025a842ed","infoHashBuffer":{"type":"Buffer","data":[37,126,115,56,10,126,25,155,217,177,52,245,70,205,234,192,37,168,66,237]},"announce":[],"urlList":[]}}