{"title":"Freeware Pack.iso","uid":3544335,"size":226689024,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:29bb5259dfaa1461ef649ab7b3d14fbf94770f4f&amp;dn=Freeware+Pack.iso&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"capthowdy98","files":1,"time":1161590114,"description":"Recently Google released a collection of free software for Windows called Google Pack. The big G made some good applications choices for the Pack and a couple of atrocious ones (RealPlayer *cough* Norton *cough*).\n\nCoincidentally, a year ago, when Lifehacker was still just a turkey in the oven, my publisher and I discussed releasing a CD of the best free software. We never got around to it, but if we did, here&amp;#039;s a list of applications I&amp;#039;d include in Lifehacker Pack.\nProductivity\n\n    * Open Office\n     \n      OpenOffice offers Word, Excel and PowerPoint equivalents that are fully compatible with the Microsoft file formats and make you wonder why you ever sweated not having M$ Office installed on your home computer.\n\n    * Google Desktop Search\n      Search your hard drive like you search the Web. Google Desktop indexes song data and email and comes with a handy Sidebar great for wide-screeners sick of all the whitespace on the right side of Lifehacker.\n\n    * Google Earth\n      Someday I want to be a licensed airplane pilot. Google Earth lets me pretend from my desk at home in between Lifehacker posts. Now available for Mac, too.\n\nCommunication\n\n    * Trillian\n      I admit Google Talk&amp;#039;s turned my head a coupla times, but Trillian still has my heart. Tabbed multi-protocol mult-name instant messaging with Wikipedia integration is simply yummy.\n\n    * Thunderbird\n      \n      I know this web-based email thing is all the rage with the kids, but T-bird lets you manage email offline, spell-check inline as-you-type, and respond personally to hundreds of repetitive messages with a couple of clicks. Take that, Gmail.\n\n    * Skype\n      It&amp;#039;s not just for talking to the computer with a headset anymore. Word on the street has it that with a Skype USB phone and some cheapy-cheap SkypeOut credits, VOIP can be yours.\n\n    * Google Talk\n\nSpyware &amp; Virus Protection\n\n    * Microsoft Anti-Spyware\n      \n    * AVG Free Anti-Virus\n      \n\nMedia\n\n    * VLC\n      Both Windows Media Player and Quicktime went &quot;Buh?&quot; when you tried to play that video file. Trust me - VLC will play it.\n\n    * iTunes\n      Some quickly-addressed yet shady privacy issues with the new release aside, iTunes still handles my 55 gigabyte music collection like a champ.\n\n    * Picasa\n      First thing I install for family members when they get their first digital camera.\n\n    * Audacity\n      \n      Wanna record a song being played on an Internet radio station? How about clip a tune down to 20 seconds to make it your cell phone&amp;#039;s ringtone? Audacity will do ya right.\n\nUtilities\n\n    * FoxIt PDF Reader\n      In the time it takes for Adobe Acrobat Reader to launch and then load up that PDF, you could download, install and open it with FoxIt with time to spare. Ditch Adobe for FoxIt&amp;#039;s leaner, meaner PDF browsing.\n\n    * 7-Zip\n      When WinZip started refusing to open certain necessary file formats, I switched to 7-Zip and never looked back. ZIP, GZIP, BZIP2, TAR, RAR, CAB, ARJ, LZH, CHM, Z, CPIO, RPM and DEB, oh my!\n    \n\nWeb\n\n    * Firefox\n      The &quot;duh&quot; choice, of course. But once you download, don&amp;#039;t forget to drive with the keyboard, set up 15 useful search shortcuts, get the Greasemonkey extension installed and running some great user scripts, and to check out the ever-growing list of our favorite extensions. Oh, and Mac users? Get yourself a Firefox build optimized for you.\n","torrent":{"xt":"urn:btih:29bb5259dfaa1461ef649ab7b3d14fbf94770f4f","amp;dn":"Freeware+Pack.iso","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"29bb5259dfaa1461ef649ab7b3d14fbf94770f4f","infoHashBuffer":{"type":"Buffer","data":[41,187,82,89,223,170,20,97,239,100,154,183,179,209,79,191,148,119,15,79]},"announce":[],"urlList":[]}}