{"title":"Casino.Royale.TC.PROPER. ~Sonic~","uid":3573776,"size":1476259924,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:2ab545b649bc371fbe996950260586290e162ac1&amp;dn=Casino.Royale.TC.PROPER.+%7ESonic%7E&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Rockhard1","files":102,"time":1165687166,"description":"www.sonictorrents.com sign up for full speed downloads\nExternal sppeds are capped\n\nCheck us out \n\nSign up bonus\n\nLatest Releases\n\nSeedboxs running.\n\n\n\nCasino Royale introduces James Bond before he holds his license to kill. But Bond is no less dangerous, and with two professional assassinations in quick succession, he is elevated to \\&amp;#039;00\\&amp;#039; status. Bond\\&amp;#039;s first 007 mission takes him to Uganda where he is to spy on a terrorist, Mollaka. Not everything goes to plan and Bond decides to investigate, independently of MI6, in order to track down the rest of the terrorist cell. Following a lead to the Bahamas, he encounters Dimitrios and his girlfriend, Solange. He learns that Dimitrios is involved with Le Chiffre, banker to the world\\&amp;#039;s terrorist organizations. Secret Service intelligence reveals that Le Chiffre is planning to raise money in a high-stakes poker game in Montenegro at Le Casino Royale. MI6 assigns 007 to play against him, knowing that if Le Chiffre loses, it will destroy his organization. \\&amp;#039;M\\&amp;#039; places Bond under the watchful eye of the beguiling Vesper Lynd. At first skeptical of what value Vesper can provide, Bond\\&amp;#039;s interest in her deepens as they brave danger together and even torture at the hands of Le Chiffre. In Montenegro, Bond allies himself with Mathis MI6\\&amp;#039;s local field agent, and Felix Leiter who is representing the interests of the CIA. The marathon game proceeds with dirty tricks and violence, raising the stakes beyond blood money and reaching a terrifying climax.\n\n","torrent":{"xt":"urn:btih:2ab545b649bc371fbe996950260586290e162ac1","amp;dn":"Casino.Royale.TC.PROPER.+%7ESonic%7E","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2ab545b649bc371fbe996950260586290e162ac1","infoHashBuffer":{"type":"Buffer","data":[42,181,69,182,73,188,55,31,190,153,105,80,38,5,134,41,14,22,42,193]},"announce":[],"urlList":[]}}