{"title":"Breakdown(1997)DVDRip.AC3(ENG)-DROCK","uid":6158099,"size":733996533,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:2e0f8d62a2cca7fb2529e8b98f81ecfd3265cc4d&amp;dn=Breakdown%281997%29DVDRip.AC3%28ENG%29-DROCK&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"drock232","files":-1,"time":1297111303,"description":"In this suspense thriller, a man discovers the unexpected danger of trusting a good Samaritan. Jeff Taylor (Kurt Russell) and his wife Amy (Kathleen Quinlan) are driving through the New Mexico desert en route to California when an incident with a lunatic driver causes their jeep to break down in the middle of nowhere. Jeff is trying to fix the vehicle when an apparently friendly truck driver, Red Barr (J.T. Walsh), stops by to offer help. Red tells the couple that there's a diner a few miles down the road where they can call for help; Jeff decides to stay with the car while Amy hops a ride with Red to see if she can find a mechanic to help them. After a long wait, Jeff is able to get the jeep running again, and he discovers that the diner is indeed a few miles down the road. But everyone there claims they've seen no sign of Amy, and Red claims to know nothing about picking her up. When Jeff attempts to file a missing person's report, he discovers mysterious disappearances are disturbingly common in this stretch of the desert; he soon realizes that someone has kidnapped his wife, but he's not sure who, or for what purpose. \n\nRipped with Handbrake.","torrent":{"xt":"urn:btih:2e0f8d62a2cca7fb2529e8b98f81ecfd3265cc4d","amp;dn":"Breakdown%281997%29DVDRip.AC3%28ENG%29-DROCK","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2e0f8d62a2cca7fb2529e8b98f81ecfd3265cc4d","infoHashBuffer":{"type":"Buffer","data":[46,15,141,98,162,204,167,251,37,41,232,185,143,129,236,253,50,101,204,77]},"announce":[],"urlList":[]}}