{"title":"Ghost Town The Movie (2007) DVDScr-XviD-MiNdSkiN","uid":4532756,"size":730507502,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:2f90643ff745c8ae0998b85b89dcc70b7073d072&amp;dn=Ghost+Town+The+Movie+%282007%29+DVDScr-XviD-MiNdSkiN&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"circlensess","files":2,"time":1227621826,"description":"Ghost Town The Movie (2007) DVDScr-XviD-MiNdSkiN\n\nGenre: Western \nYear: 2007\nCountry: USA\nLanguage: English\nRuntime: 115 min\nDirector: Jeff Kennedy, Dean West\nCast:Herbert 'Cowboy' Coward, Bill McKinney, DJ Perry, Princess Lucaj, Rance Howard, \nRenÃƒÂ©e O'Connor, Tony Becker, Stella Parton\n\nDean Teaster's GHOST TOWN &quot;The Movie&quot;, is a unique &quot;Eastern&quot; Western. It is N.C. native Dean Teaster's tribute to his father Robert Doyle Teaster and &quot;Ghost Town In The Sky&quot; theme park. The theme park was a large piece of the childhood happiness for Dean's family and many families since its opening in 1961. This story combines actual family facts of the Teaster family fictionalized into a story that encompasses the best elements of the staged gunfights performed by the Legendary &quot;Ghost Town Gunfighters&quot; throughout the years at the park. Many of the original actors have returned for roles in the film. Former &quot;Ghost Town Gunfighters&quot; Robert Bradley once known as &quot;The Apache Kid,&quot; Herbert Cowboy Coward &quot;GrandPappy,&quot; and Harry Valentine &quot;The Golden Voice of Ghost Town&quot; play pivotal roles in the film as does Alaska Presley who was one of the original park founders. Dean Teaster reprises the role of &quot;Digger&quot; made famous by his father. This movie was created to offset many of the &quot;Hillbilly&quot; stereotypes often depicted with this area. The movie paints a picture of this beautiful mountain region that was settled by the overseas Celtic people. These settlers were full of rich traditions and a true grit that allowed them to survive and thrive during the rugged 1800's period of US History often shown in western films. This movie may well be the birth of a sub genre of the western known as &quot;The Eastern.&quot; With a slight romantic edge this movie is chalked full of messages about love, hate, family, forgiveness, redemption and sacrifice. This film builds on a regional theme where conflict was often fought over family honor versus land as often depicted in westerns due to the gold rushes and land acquisitions and expansions. Being a lover of the western genre I think that we have told a story that will entertain many generations of people and with the re-opening of the &quot;Ghost Town In The Sky&quot; theme park we look forward to bright future built upon the past.\n &lt;a href=&quot;\nhttp://akas.imdb.com/title/tt0849441/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://akas.imdb.com/title/tt0849441/&lt;/a&gt;","torrent":{"xt":"urn:btih:2f90643ff745c8ae0998b85b89dcc70b7073d072","amp;dn":"Ghost+Town+The+Movie+%282007%29+DVDScr-XviD-MiNdSkiN","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2f90643ff745c8ae0998b85b89dcc70b7073d072","infoHashBuffer":{"type":"Buffer","data":[47,144,100,63,247,69,200,174,9,152,184,91,137,220,199,11,112,115,208,114]},"announce":[],"urlList":[]}}