{"title":"The Spoilers (1942)","uid":5243408,"size":841163562,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:2fb99780796c99cc7a88de6c0fa71495bf534cad&amp;dn=The+Spoilers+%281942%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"galaxyworldwide877","files":1,"time":1261880259,"description":"In Nome, Alaska, miner Roy Glennister and his partner Dextry, financed by saloon entertainer Cherry Malotte, fight to save their gold claim from crooked commissioner Alexander McNamara. \n\nStarring Randolph Scott, John Wayne and Marlene Dietrich. \n\n\nThis movie's got a good enough plot that it's been made at least 4 times. It's a good story that holds up and moves at a good pace. The cast of stars are caught at interesting times in their varying careers. \n\nDietrich is riding the Destry saloon girl role in a carbon copy of the original that belabors a huge oversized Gibson-girl wig and multiple extraordinary outfits befitting Marlene &quot;the star&quot;. She brings her distinctive charm to the role and has a tongue-in-cheek ball with the sexually loaded script, but her role has nothing extra-special or magical. \n\nJohn Wayne is full of swagger and charm and working his way up the ladder towards the title of big stud cowboy on campus. \n\nRandolph Scott is turning the corner of his career into Westerns also; abandoning those light comedy or milquestoast leading roles and showing a glimpse of the hardnose tough guy &amp; questionably moral cowboy that he came to be in later career moves. \n\nThis is the penultimate film for Richard Barthelmess and his role is a morose and bitter one that fits his personal situation of a star who had had his day in the sun and was ready to step-down. \n\nKudos, big laughs and a robust round of applause to the best delivery, lines and most entertaining scenes which are all handled by Marlene's maid - Idabelle - played beautifully and naturally by Marietta Canty. She WILL have you laughing out loud! \n\nThis film is chock full of sexual innuendo, lust-filled motivation and snide comments; all subtly and enjoyably delivered. \n\nDVD ripped to DivX Video \n\nENJOY","torrent":{"xt":"urn:btih:2fb99780796c99cc7a88de6c0fa71495bf534cad","amp;dn":"The+Spoilers+%281942%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2fb99780796c99cc7a88de6c0fa71495bf534cad","infoHashBuffer":{"type":"Buffer","data":[47,185,151,128,121,108,153,204,122,136,222,108,15,167,20,149,191,83,76,173]},"announce":[],"urlList":[]}}