{"title":"The Jim Bohannon Show 18-Oct-11 CF mp3 32K","uid":6755346,"size":28591522,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:2fd14f06322d40ce09b06feb7e6c54b36d4ce856&amp;dn=The+Jim+Bohannon+Show+18-Oct-11+CF+mp3+32K&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"iChatter","files":2,"time":1319020387,"description":"The Jim Bohannon Show 18-Oct-11 CF mp3 32K\nCommercial Free\n\nTuesday, October 18, 2011\nOn The Jim Bohannon Show...\n\nThe American public is generally passive, but anger over the country's economic and political woes has forced many to become active for the first time. The tea partiers came first; they used their anger over the debt and their belief that the Federal government was out of control to take seats in Congress and effect change from the inside. We are seeing a repeat of that anger from the various &quot;Occupy Wall Street&quot; groups, showing their displeasure with the inequity between the top one percent of income earners and everyone else. Both movements share a common theme: dissatisfaction with the 'Establishment.' Yet, there is no chance the President will be unseated from a reelection bid, and the Republican race for the Oval Office seems to be solidifying somewhat behind Mitt Romney, the more establishment candidate, as the tea party forces have been unable to unite behind a single challenger, with fewer than three months before the first caucus votes are cast. Will tonight's debate help shake out the Republican field? We'll discuss it with Michael Needham, CEO of Heritage Action for America who has just co-written an article (with Tim Chapman) on the website RealClearPolitics.com talking about the public's anger at 'The Establishment&quot; - from Big Government to Big Business to Big Labor - and the tea party's role in harnessing it.\n\n&quot;Top of the world, Ma!&quot;, &quot;You dirty rat!&quot;, &quot;You talkin' to me?&quot; All lines that have passed into American culture and all from that guilty pleasure we call the gangster movie. They're dark and violent and the bad guy almost always gets it in the end - yet we love them anyway. Is it some quirk in the American psyche, or do we just like our entertainment with an edge? We're going to celebrate the genre tonight, and start an argument or two, as we speak with George Anastasia and Glen Macnow about what is obviously their labor of love: &quot;The Ultimate Book of Gangster Movies&quot; (in softcover from Running Press). You might be able to guess which film tops their list, but you're certain to find some hidden gems you either didn't know about or have completely forgotten. (So sit quiet in front of that radio or we'll have one of the boys come for a visit and take you for a ride!)","torrent":{"xt":"urn:btih:2fd14f06322d40ce09b06feb7e6c54b36d4ce856","amp;dn":"The+Jim+Bohannon+Show+18-Oct-11+CF+mp3+32K","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2fd14f06322d40ce09b06feb7e6c54b36d4ce856","infoHashBuffer":{"type":"Buffer","data":[47,209,79,6,50,45,64,206,9,176,111,235,126,108,84,179,109,76,232,86]},"announce":[],"urlList":[]}}