{"title":"I.Segreti.Di.Angeli.E.Demoni.2005.iTALiA.STV.DVDRip.XViD-MvN[vol","uid":4917524,"size":730601472,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:328bebfd5a1d1c96b481bf33be453e9f813d47f8&amp;dn=I.Segreti.Di.Angeli.E.Demoni.2005.iTALiA.STV.DVDRip.XViD-MvN%5Bvol&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Volpebianca","files":1,"time":1243502067,"description":":::Scheda del film:::\nRegisti: Simon Cox\nCasa Distribuzione: MEDUSA VIDEO\nDurata: 90\nAnno Produzione: 2005\nGenere: Dvd Documentari\n\n\n:::Trama:::\nCon &quot;Angeli &amp; Demoni&quot; Dan Brown ha replicato il successo planetario del Codice da Vinci, iniziando milioni di lettori a un universo sconcertante, in cui scienza e religione, grandi ideali e cinici complotti, documenti astrusi e armi micidiali, compongono un mosaico esplosivo.\n\nE mentre ÃƒÂ¨ giunta a Roma accompagnata da mille polemiche la pellicola &quot;Angeli e Demoni&quot;, tratta dall'omonimo best-seller di Dan Brown, presentata l'altra sera in anteprima mondiale a Roma.  In occasione dell'uscita nelle sale italiane del film  Angeli e Demoni tratto dall'omonimo best-seller di Dan Brown, le edizioni L'EtÃƒÂ  dell'Acquario mandano in libreria il volume &quot;I segreti di Angeli &amp; Demoni&quot; di Simon Cox, una guida non autorizzata a fatti, personaggi  e misteri del thriller di Dan Brown.\n\nAttraverso vie, piazze, chiese e monumenti di Roma riaffiora un cammino occulto fatto di antichi simboli e sembra riprendere vita una leggendaria societÃƒÂ  segreta nemica della Chiesa, il cui scopo sarebbe la distruzione del Vaticano e l'annientamento della fede cattolica. Alla fine del romanzo, molti lettori si chiederanno che cosa nel racconto di Dan Brown sia veritÃƒÂ  e che cosa sia invenzione.\n\nAgilmente strutturato in voci disposte in ordine alfabetico, I segreti di Angeli &amp; Demoni ÃƒÂ¨ uno strumento prezioso per gettare luce sui tanti misteri annidati nel cuore della trama: gli Ã‚Â«IlluminatiÃ‚Â» sono esistiti davvero e, soprattutto, esistono ancora? Vi sono realmente forze oscure che orientano nell'ombra il corso della Storia?\n\nQuale rapporto intercorre fra gli Illuminati e la Massoneria? Qual ÃƒÂ¨ l'origine dei simboli che compaiono sulle banconote americane? Bernini creÃƒÂ² un Cammino di Illuminazione per i potenziali iniziati alla fratellanza clandestina? L'Ã‚Â«antimateriaÃ‚Â» racchiude il potenziale effetto devastante raccontato da Dan Brown? Esistono in Vaticano i passaggi segreti descritti nel romanzo?\n\nLasciatevi illuminare...\n\n\nQualitÃƒÂ  audio 10 video 10","torrent":{"xt":"urn:btih:328bebfd5a1d1c96b481bf33be453e9f813d47f8","amp;dn":"I.Segreti.Di.Angeli.E.Demoni.2005.iTALiA.STV.DVDRip.XViD-MvN%5Bvol","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"328bebfd5a1d1c96b481bf33be453e9f813d47f8","infoHashBuffer":{"type":"Buffer","data":[50,139,235,253,90,29,28,150,180,129,191,51,190,69,62,159,129,61,71,248]},"announce":[],"urlList":[]}}