{"title":"NecroVision PC-DVD Multi4 Es-En-Fr-It","uid":4738834,"size":5976634013,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:3403b2eaed89dfdc67838d09902f64af401d9166&amp;dn=NecroVision+PC-DVD+Multi4+Es-En-Fr-It&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Mois20","files":13,"time":1235438569,"description":"En medio de la Primera Guerra Mundial, unos experimentos llevados a cabo por los alemanes han liberado a unas terribles criaturas de la oscuridad. Pretenden dominar el mundo y nuestro deber como un soldado estadounidense es hacerles frente y acabar con esta peligrosa amenaza para el ser humano.\n\nEl protagonista se llama Simon Bukner y forma parte de la ofensiva estadounidense para acabar con el ejÃƒÂ©rcito germano. En plena batalla entre trincheras, este joven tejano se ve envuelto en una emboscada, debiendo huir de un ataque por gases realizado por el enemigo. Todo su pelotÃƒÂ³n ha muerto, pero el consigue llegar a unas instalaciones subterrÃƒÂ¡neas, introduciÃƒÂ©ndose en un territorio en el que los alemanes no pretenden evitar que se entre, sino que alguien salga de ÃƒÂ©l. Simon, en lugar de huir, pretende descubrir que se esconde allÃƒÂ­ dentro.\nLo que halla no es nada halagueÃƒÂ±o: muertos que se levantan de sus tumbas, fantasmas que lanzan rayos de fuego, trolls gigantescos armados con una maza... multitud de criaturas nacidas de algÃƒÂºn relato de miedo, pero que son absolutamente reales.\n\nEstos monstruos viven ÃƒÂºnicamente en la oscuridad, asÃƒÂ­ que quieren cubrir el cielo de polvo para poder sobrevivir al sol. Sin quererlo, Simon se ha convertido en la ÃƒÂºltima esperanza de la humanidad para luchar contra estos demonios y evitar que arrasen la vida sobre la Tierra.\n\nRequisitos mÃƒÂ­nimos\n\nSistema Operativo: Microsoft Windows XP Service Pack 2, Vista\nProcesador: Intel Pentium 4 2.4GHz o AMD Athlon 64 +2800\nMemory: 1 GB RAM (Windows XP) / 1.5 GB RAM (Windows Vista)\nTarjeta GrÃƒÂ¡fica: 256 MB Video RAM o superior que soporte DirectX9 Pixel Shader 3.0 (NVIDIA GeForce 6600 o ATI Radeon X1600 o superior)\nEspacio en el Disco: 8 GB de espacio disponible en el disco duro\n\n\nRequisitos recomendados\n\nSistema Operativo: Microsoft Windows XP Service Pack 2, Vista\nProcesador: Intel Core 2 Duo 1.80 GHz o AMD X2 5000+ o superior\nMemory: 2 GB RAM o superior\nTarjeta GrÃƒÂ¡fica: NVIDIA GeForce 8800 series o ATI Radeon HD 38xx series o superior\nEspacio en el Disco: 8.0 GB de espacio disponible en el disco duro","torrent":{"xt":"urn:btih:3403b2eaed89dfdc67838d09902f64af401d9166","amp;dn":"NecroVision+PC-DVD+Multi4+Es-En-Fr-It","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3403b2eaed89dfdc67838d09902f64af401d9166","infoHashBuffer":{"type":"Buffer","data":[52,3,178,234,237,137,223,220,103,131,141,9,144,47,100,175,64,29,145,102]},"announce":[],"urlList":[]}}