{"title":"EnigmaT Set Rips { Cuts } - May 2nd, 2013","uid":8431118,"size":1256433749,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:359b09423c88eeb7a0e7db6437eab19822a21330&amp;dn=EnigmaT+Set+Rips+%7B+Cuts+%7D+-+May+2nd%2C+2013&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"EnigmaT","files":135,"time":1367495264,"description":"10Stage - My Heart and Soul (Original Mix) (Cut From Ex-Driver Set)-enTc.mp3\nAirstorm - Glorious (Etasonic Remix) (Cut From A&amp;F Set)-enTc.mp3\nAirstorm - Glorious (Touchstone Remix) (Cut From Lazarus Set)-enTc.mp3\nAlan Morris - Hypnosis (Cut From Dan Stone Set)-enTc.mp3\nAlan Morris - Hypnosis (Uplifting Mix) (Cut From A&amp;F Set)-enTc.mp3\nAndre Visior - Speed Up (ReOrder Bigroom Mix) (Cut From ReOrder Set)-enTc.mp3\nAndy Blueman - Away From The Sun (Cymatics pres. InnerSync Remix) (Cut From Reitar Set)-enTc.mp3\nAndy Elliass vs Laucco - Flying With Angels (Sunset Remix) (Cut From Fady Set)-enTc.mp3\nAndy Tau &amp; Pulsate - Alliance (Cut From Emery Set)-enTc.mp3\nAr-2 - Blessing The Rain (Cut From Haig Set)-enTc.mp3\nAshai - The Untold Story (Original Mix) (Cut From Lugo Set)-enTc.mp3\nAshai - The Untold Story (Original Mix) (Cut From Tasev Set)-enTc.mp3\nAtlantia - Millennium (Cut From Defcon Set)-enTc.mp3\nBauer &amp; Landford - Leave Me Behind (Original Mix) (Cut From Shah Set)-enTc.mp3\nBeatsole - Good Day (Air Mix) (Cut From Abstract Set)-enTc.mp3\nBenji - Following Me (Cut From W&amp;W Set)-enTc.mp3\nBlister 13.0 - Lunes (Konektiv Remix) (Cut From Solarstone Set)-enTc.mp3\nBobina - Basque The Dog (Solis &amp; Sean Truby Remix) (Cut From Bobina Set)-enTc.mp3\nChris Hampshire - Ninety Four (Ex-Driver Remix) (Cut From Abstract Set)-enTc.mp3\nChris Hampshire - Ninety Four (Ex-Driver Remix) (Cut From Ex-Driver Set)-enTc.mp3\nChris Hampshire - Ninety Four (Peter Hulsmans Good Year Mix) (Cut From Stoneface Set)-enTc.mp3\nCraig Connelly &amp; Christina Novelli - Black Hole (-LivE- SHORT- Cut From Emery Set)-enTc.mp3\nDamian Wasse &amp; Rick Ferrero - In Search of Love (Cut From Defcon Set)-enTc.mp3\nDamian Wasse &amp; Rick Ferrero - In Search Of Love (Original Mix) (Cut From Ex-Driver Set)-enTc.mp3\nDaniel Vitellaro - Bringing New Life (Darren Porter Remix) (Cut From Saux Set)-enTc.mp3\nDaniel Vitellaro - Bringing New Life (Jjoo Remix) (Cut From Shiver Set)-enTc.mp3\nDart Rayne &amp; Yura Moonlight - Vision (Cut From Durrand Set)-enTc.mp3\nDave Horne - Strayer (Cut From Bobina Set)-enTc.mp3\nDezza - Grado (Zack Roth Remix) (ABGT 025 Rip)-enTc.mp3\nDido - End Of Night (Cedric Gervais Remix) (Cut From Emery Set)-enTc.mp3\nDreamy - Aiman (Original Mix) (Cut From Suzy Set)-enTc.mp3\nEcueD &amp; Roald Velden - Moments (Cut From Ronde Set)-enTc.mp3\neleven.five - Turion (Cut From Ronde Set)-enTc.mp3\nErol Montez &amp; Ryan Sauvage - Oink (Cut From Ferry Set)-enTc.mp3\nEssonita &amp; K.I.R.A. - Lost My Heart to You (Denis Sender Remix) (Cut From Defcon Set)-enTc.mp3\nEssonita &amp; K.I.R.A. - Lost my Heart to You (Tim Besamusca Remix) (Cut From Haig Set)-enTc.mp3\nFaruk Sabanci feat. Cami - Awaken (Matt Bukovski Remix) (Cut From Moor Set)-enTc.mp3\nFictivision vs. C-Quence - Symbols (Abstract Vision &amp; Elite Electronic 2013 Rework) (Cut From Abstract Set)-enTc.mp3\nFierra - From Ashes (Original Mix) (Cut From MORPH Set)-enTc.mp3\nFierra - From Ashes (Original Mix) (Cut From Uplift Set)-enTc.mp3\nFilterheadz - Slam It (Cut From W&amp;W Set)-enTc.mp3\nFirebeatz &amp; Bobby Burns - Ding Dong (Original Mix) (Cut From R3Hab Set)-enTc.mp3\nFon.Leman - Lynx Eye (ABGT 025 Rip)-enTc.mp3\nG-Tek - Dirac Sea (Matt Fax pres. Soundraw Remix) (ABGT 025 Rip)-enTc.mp3\nGiuseppe Ottaviani &amp; Eric Lumiere - Love Will Bring It All Around (On Air Mix) (Cut From GO Set)-enTc.mp3\nGiuseppe Ottaviani &amp; Eric Lumiere - Love Will Bring It All Around (Rank 1 Remix) (Cut From Ferry Set)-enTc.mp3\nGuy Alexander - Ascent (Original Mix) (Cut From Saux Set)-enTc.mp3\nHardwell - Apollo (Special Jochen Miller Bootleg) (Cut From Miller Set)-enTc.mp3\nHarry Square - Blackjack (Original Mix) (Cut From Feel Set)-enTc.mp3\nHarry Square - Royal Flush (Original Mix) (Cut From Feel Set)-enTc.mp3\nHazem Beltagui - Lunar Beam (Cut From Solarstone Set)-enTc.mp3\nHenrix &amp; Jakob Lido Feat. Zashanell - Close Your Eyes (Cut From Audrey G Set)-enTc.mp3\nHiroki Nagamine - Circle (Overseas Remix) (Cut From Above Clouds Set)-enTc.mp3\nHolbrook &amp; SkyKeeper - Circle Of Spotless Light (Club Mix) (Cut From Feel Set)-enTc.mp3\nIdo B &amp; Zooki - The Bazzterd (Cut From Bluestone Set)-enTc.mp3\nJ-Soul feat. Leusin - The World Before My Eyes (Moonbeam Dub Mix) (Cut From Ronde Set)-enTc.mp3\nJ-Soul feat. Leusin - The World Before My Eyes (Moonbeam Remix) (Cut From Moore Set)-enTc.mp3\nJace Williams &amp; Matt Dominguez - Heatwave (Cut From Jules Set)-enTc.mp3\nJames Woods - Bliss (Cut From Ronde Set)-enTc.mp3","torrent":{"xt":"urn:btih:359b09423c88eeb7a0e7db6437eab19822a21330","amp;dn":"EnigmaT+Set+Rips+%7B+Cuts+%7D+-+May+2nd%2C+2013","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"359b09423c88eeb7a0e7db6437eab19822a21330","infoHashBuffer":{"type":"Buffer","data":[53,155,9,66,60,136,238,183,160,231,219,100,55,234,177,152,34,162,19,48]},"announce":[],"urlList":[]}}