{"title":"Demon Hunter - Undying","uid":4940819,"size":152506372,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:35e3c3e447d180be5b1acaf18b1bec9822ca0182&amp;dn=Demon+Hunter+-+Undying&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":-1,"time":1244449219,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 256 kbps\n\n\nThe Triptych is the third full-length album by Demon Hunter which was released October 25, 2005. Produced by Aaron Sprinkle (Emery, Fair) and mixed by Machine (Lamb of God), The Triptych boasts three different album covers--inspired by the album's title (see triptych)--by renowned painter Dan Seagrave (Morbid Angel, Suffocation).\n\nThe album hit the #1 position on the Billboard's Heatseekers chart during its first week of release in stores and was re-released on October 31, 2006.\n\nVocalist Ryan Clark described in an interview that, while the previous two albums had him record vocals with a standing, screened microphone, for The Triptych, he used a basic handheld mic. This allowed him to move around freely and hold longer notes; however, it also allowed Clark to naturally cup the mic which consequently muffled or distanced his vocals.\n\nIn 2005, Demon Hunter went to The Compound in Seattle, Washington to record their third album, entitled The Triptych. The word &quot;triptych&quot; centers around the concept of three, as it was the band's third album. Included on the album is a cover of Prong's song &quot;Snap Your Fingers, Snap Your Neck&quot;. This album debuted Watts as Sprinkle's permanent replacement on drums (Jesse having joined Dead Poetic) as well as the addition of Ethan Luck (The O.C. Supertones (Guitar), The Dingees (Drums)) as lead guitarist, replacing Kris McCaddon. The Triptych was even bigger than Summer of Darkness, selling more than twice as many records on its first week of release than Summer of Darkness had. &quot;Undying&quot; was the band's first single from this album, and was also made into a music video directed by Chris Sims (As I Lay Dying, Lamb of God, Zao).\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:35e3c3e447d180be5b1acaf18b1bec9822ca0182","amp;dn":"Demon+Hunter+-+Undying","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"35e3c3e447d180be5b1acaf18b1bec9822ca0182","infoHashBuffer":{"type":"Buffer","data":[53,227,195,228,71,209,128,190,91,26,202,241,139,27,236,152,34,202,1,130]},"announce":[],"urlList":[]}}