{"title":"Peter Wolf - Come As You Are","uid":4876561,"size":117833732,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:397637aea210d99ed1247a25335154e19965a33f&amp;dn=Peter+Wolf+-+Come+As+You+Are&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"2nafish","files":-1,"time":1241161436,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 256 kbps\n\n\nCome As You Are is the second album by Peter Wolf, released in 1987. &quot;Come as You Are&quot; was a major hit for Wolf, peaking at #15 on the Billboard Hot 100 and #1 on the Mainstream Rock Tracks chart for one week.\n\nPeter Wolf (born Peter W. Blankfield, March 7, 1946, Bronx, New York) is an American rock and roll musician, best known as the lead vocalist for the J. Geils Band from 1967 to 1983.\n\nHe planned a career as an artist, but got a job in the late 1960s as a disc jockey on then-cutting edge Boston FM radio station WBCN and began exploring his interest in blues and rhythm and blues music, giving himself the nickname &quot;the Wolfa Goofa&quot;, sometimes expanded to &quot;the Wolfa Goofa with the Green Teeth&quot;(as mentioned in the intro to &quot;Musta Got Lost&quot; on the Blow Your Face Out album. Later as solo artist he called himself Woofa Goofa Mama Toofa). He formed a group called the Hallucinations who performed with The Velvet Underground, Howlin' Wolf, Muddy Waters, Pete's good friend Van Morrison, John Lee Hooker, and Sun Ra. He then saw the then J. Geils Blues Band in concert and quickly joined. He was the vocalist and frontman, and often acted as a sort of manager. He was known for his charismatic stage antics of fast-talking quips and &quot;pole-vaulting&quot; with the mic stand. He and keyboard player Seth Justman were responsible for most of the song writing. Creative differences followed their Freeze-Frame album, causing the J. Geils Band and Peter Wolf to part ways in 1983.\n\nWolf became a solo artist for the next 15 years, but in 1999 the J. Geils Band reunited for several appearances, with Wolf resuming his duties as lead vocalist. They have since separated again, with little hopes of reunion. Wolf then began touring once more, as a solo act.\n\nThe J. Geils Band has re-united for a few shows in 2009, with Peter Wolf once again taking over as lead vocalist. They opened the House of Blues in Boston in February, 2009. The show sold out in record time, and they have since added a second performance April 28, 2009. They are also scheduled to perform two shows at the Filmore, Detroit also in April, 2009.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:397637aea210d99ed1247a25335154e19965a33f","amp;dn":"Peter+Wolf+-+Come+As+You+Are","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"397637aea210d99ed1247a25335154e19965a33f","infoHashBuffer":{"type":"Buffer","data":[57,118,55,174,162,16,217,158,209,36,122,37,51,81,84,225,153,101,163,63]},"announce":[],"urlList":[]}}