{"title":"La Duda DVD-Screener Spanish","uid":4689683,"size":1211498657,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:39a789279dcdcab796c0fadd51e104d507c0adc3&amp;dn=La+Duda+DVD-Screener+Spanish&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Mois20","files":4,"time":1233348693,"description":"Es 1964, parroquia de San NicolÃƒÂ¡s en el Bronx. Un vibrante y carismÃƒÂ¡tico sacerdote, el padre Flynn (Philip Seymour Hoffman) estÃƒÂ¡ tratando de cambiar las estrictas normas del colegio, que durante aÃƒÂ±os han sido fieramente salvaguardadas por la hermana Aloysius Beauvier (Meryl Streep), una directora con mano de hierro que cree firmemente en el poder de la disciplina. Vientos de cambio polÃƒÂ­tico estÃƒÂ¡n barriendo la comunidad, y de hecho el colegio ha aceptado a su primer alumno negro, Donal Millar. Pero cuando la hermana James (Amy Adams), una pobre inocente, le comenta a la hermana Aloysius sus sospechas de que el padre Flynn presta &quot;demasiada atenciÃƒÂ³n&quot; a Donald, la superiora comienza una cruzada personal para sacar a la luz la verdad y expulsar a Flynn del colegio por abusar del alumno. Sin una sola prueba aparte de su convicciÃƒÂ³n moral, la hermana Aloysius comienza una batalla con el padre Flynn, que amenaza con desgarrar la comunidad con consecuencias irrevocables. Basada en una obra ganadora del Premio Pulitzter y de un Premio Toni en su adaptaciÃƒÂ³n teatral.","torrent":{"xt":"urn:btih:39a789279dcdcab796c0fadd51e104d507c0adc3","amp;dn":"La+Duda+DVD-Screener+Spanish","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"39a789279dcdcab796c0fadd51e104d507c0adc3","infoHashBuffer":{"type":"Buffer","data":[57,167,137,39,157,205,202,183,150,192,250,221,81,225,4,213,7,192,173,195]},"announce":[],"urlList":[]}}