{"title":"Cassandra Nix - All about Cassandra's ass.avi","uid":9142546,"size":116713068,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:3c317f5e02c3f237dcbcec4e5a312c1d35688efd&amp;dn=Cassandra+Nix+-+All+about+Cassandra%27s+ass.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":null,"files":1,"time":1383534144,"description":"Cassandra Nix has a nice ass and she wants to show it off for you. Are you ready to worship her ass? Get out your dick and let's begin. She turns around and presents her round butt to you and you are immediately impressed with its shape. You see a bit of her pussy lips peeking out of her panties as she is bent over. Cassandra thrusts slowly against a pillow because she knows you love a good pillow hump. Her ass looks so very smooth that you almost cannot even breathe. She says nothing as she thrusts and gyrates before you. Such a perfect ass is something to behold and you wish you could touch it, smell it...For now, though, you are going to have to image her scent. Is she musky? Sweet? Your dick pulsates as you consider this. In the meantime, she has removed her panties and she now orders you to put your nose against her asshole. Stick out that tongue of yours and taste it. Yes, that's right. Now don't forget to squeeze her ass as you orally service it. Her tight hole resists your tongues slightly, but you know exactly how much pressure it would take to penetrate her. Your hand has not once left your dick as you have played with Cassandra's ass. She spreads some oil onto her ample cheeks and they glow. Your dick would slide supremely well between her fat cheeks. Now she stands at the side of the bed as she flexes and wiggles her butt at you. She commands you to get your face into her ass and you do just that. Her scent is intoxicating and you would be happy never to breathe the air again if she would sit on your face for eternity. &lt;a href=&quot;\nhttp://www.hostpornpics.net/pornmg/share.php?id=FB21_5276FFA0&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.hostpornpics.net/pornmg/share.php?id=FB21_5276FFA0&lt;/a&gt;","torrent":{"xt":"urn:btih:3c317f5e02c3f237dcbcec4e5a312c1d35688efd","amp;dn":"Cassandra+Nix+-+All+about+Cassandra%27s+ass.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3c317f5e02c3f237dcbcec4e5a312c1d35688efd","infoHashBuffer":{"type":"Buffer","data":[60,49,127,94,2,195,242,55,220,188,236,78,90,49,44,29,53,104,142,253]},"announce":[],"urlList":[]}}