{"title":"[EPZ]Stories of Nylons 4.german.XXX.DVDRip.x264.mp4","uid":8857872,"size":913772319,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:3ca8bdb9131dc77f4e757eb03b44b61202d16ff6&amp;dn=%5BEPZ%5DStories+of+Nylons+4.german.XXX.DVDRip.x264.mp4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":3,"uploader":"Cpetersem","files":-1,"time":1377704330,"description":"Title: Stories of Nylons 4\nYear: 2013\nCodec: h264 \nResolution: 528x384\nAudio language: german\ncover/sreenshot: http://bayimg.com/japgAaAEc\nsite: http://www.pornshop.de/erotic-planet/2013/august-2013/2632/stories-of-nylons-4\nPlot: Ebony zerreisst krachend ihre Nylons und wichst sich schamlos das Mutterkorn. Bambola reitet mit bestrapstem Knackarsch Nachbar Rudi den Saft aus den Eiern. Asia Kim wird in nem billigen Hotelzimmer von ihrem Lover um den Verstand gevoegelt. Logan bekommt, in geile Fantasiestruempfe verpackt, die Rosette ausgeputzt. Alisha reisst sich ne Feinstrumpfhose von den prallen Backen, dass einem das Wasser im Mund zusammenlaeuft.\nJenny und Sasha werden in High-Heels und Dessous von nem Scheissebohrer gnadenlos ueber den Haufen gefickt. Maja maltraetiert sich die Spalte mit nem Plastikpimmel und gibt Laufmaschen eine ganz neue Bedeutung. Erotik-Superstar Black Angelica kriegt von nem Hengstschwaenzigen das Spundloch poliert. Jasmine, zierliche Strapsmaus, melkt per Mundfotze nem Unbekannten das Fett ab.\nLindsay entledigt sich ihrer geilen Beinkleider und bietet ne heisse Show unter der Dusche. Ashley wird von nem echten Zuchtbullen beglueckt und kann vor lauter Begeisterungssaft kaum noch aus den Augen gucken. Kate ist Fusswichs-Expertin und Darmakrobatin in einer Person. Tekohas, mit gigantischen Milchbotten und tiefbraunen Tellerminen, laesst sich saemtliche verfuegbaren Loecher stopfen. Mandy, ne Ruesselputzerin mit zwei waffenscheinpflichtigen Argumenten in der Bluse, bringt in ihren Halterlosen jeden Sack zum Ueberkochen.\nZu guter Letzt elektrisiert Euch noch Antinia mit ner Perlon-Show, die jedem Strumpf-Freier die Schweissperlen auf die Stirn treiben duerfte.\nViel Spass!","torrent":{"xt":"urn:btih:3ca8bdb9131dc77f4e757eb03b44b61202d16ff6","amp;dn":"%5BEPZ%5DStories+of+Nylons+4.german.XXX.DVDRip.x264.mp4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3ca8bdb9131dc77f4e757eb03b44b61202d16ff6","infoHashBuffer":{"type":"Buffer","data":[60,168,189,185,19,29,199,127,78,117,126,176,59,68,182,18,2,209,111,246]},"announce":[],"urlList":[]}}