{"title":"Movie Label 2011 6.2.1.1303 [Portable] ","uid":6197266,"size":82017850,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:3caf44c3e4a19bc775800eb3f0997ddb5c2a562c&amp;dn=Movie+Label+2011+6.2.1.1303+%5BPortable%5D+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"chusca","files":8,"time":1298483944,"description":"Lo tiene todo, excepto el idioma, su ÃƒÂºnico pecado ya que todo lo demÃƒÂ¡s, lo hace con talento y eficacia. Si has estado acumulando videos en mÃƒÂºltiples formatos de video y tienes un buen montÃƒÂ³n de DVD, necesitaras un buen gestor para tu colecciÃƒÂ³n, con el que localizaras al instante una pelÃƒÂ­cula. Movie Label proporciona una interfaz pulida y bien estructurada, con diferentes areas de informaciÃƒÂ³n organizadas de forma intuitiva. En el centro estÃƒÂ¡ el principal area de visualizaciÃƒÂ³n de la colecciÃƒÂ³n de video, bien como listado o galeria de miniaturas, con todo el material grÃƒÂ¡fico de las pelÃƒÂ­culas. Por cierto, para poner una pelÃƒÂ­cula, basta con introducir su nombre y de forma automatica, Movie Label descargara desde Internet todos los datos de reparto al completo, director y producciÃƒÂ³n, asi como una descripciÃƒÂ³n corta y las caratulas del DVD. Si prestas o tomas prestado un video, puedes introducir el nombre de la persona en su gestor de contacto y, si ya ha pasado demasiado tiempo y todavia no te ha devuelto el video, \nsiempre podrÃƒÂ¡s enviarle un aviso o recordatorio por e-mail usando la interfaz de Movie Label. AdemÃƒÂ¡s, brinda estadisticas completas y grÃƒÂ¡ficas de tu colecciÃƒÂ³n de video, asi como la posibilidad de hacer copias de seguridad de la base de datos \ny exportarla a XML, HTML, Excel o fichero de texto.\n-Idioma: InglÃƒÂ©s.\n\n","torrent":{"xt":"urn:btih:3caf44c3e4a19bc775800eb3f0997ddb5c2a562c","amp;dn":"Movie+Label+2011+6.2.1.1303+%5BPortable%5D+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3caf44c3e4a19bc775800eb3f0997ddb5c2a562c","infoHashBuffer":{"type":"Buffer","data":[60,175,68,195,228,161,155,199,117,128,14,179,240,153,125,219,92,42,86,44]},"announce":[],"urlList":[]}}