{"title":"Butthole.Barrio.Bitches.2.XXX.DVDRip","uid":8861201,"size":1586478662,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:3ec688e59731cb637e4d75e8827a7ac8b4b73520&amp;dn=Butthole.Barrio.Bitches.2.XXX.DVDRip&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":4,"uploader":"xxxlavalxxx","files":-1,"time":1377735988,"description":"Category Anal, Latin\n\n Director Mark Wood, Francesca Le\n Starring Aleksa Nicole, Nicole Ferrera, Mark Wood, Francesca Le, Angel Del Rey, Nina Lopez\n\n 100% Latina! Real Anal Latin Sluts! Caliente!\n\n Mark Wood, the male half of LeWood Productions (along with his wife, feisty American Latina MILF Francesca Le), gets as much as his thick cock can handle in 'Butthole Barrio Bitches #2.' Its nasty anal vignettes star gorgeous, passionate Latinas all eager to perform the raw, filthy acts the notorious LeWood team inspires. Slobbery face fucks, ass-to-mouth cocksucking, ass rimming and lewd anal gapes spice up this fiery collection. Francesca films the dirty deeds and joins the debauchery when she can't resist. Stunning teenager Nicole Ferrera intends to give Mark a lesson in salsa dancing, but before long she's worshiping his meaty member with her wide, full lips... and getting her elastic asshole plowed until it's gaping widely. After ramming her sweet behind, he fills Nicole's mouth with gooey crema!\n\n Skinny, young beauty Angel Del Rey asks Francesca for some sex advice, opening herself up to a bisexual seduction by the older woman. Angel and Francesca service Mark's throbbing verga in a raunchy threesome of ass pounding and sphincter licking. Cuban cutie Nina Lopez applies for work as Mark's photo assistant, but instead this all-natural darling ends up modeling his big boner in her ass. Lastly, busty Aleksa Nicole receives a private Spanish tutorial that stretches her soft culo and splatters her tongue with hot semen. If you love watching tawdry, tempting senoritas prove their insatiable hunger for Gringo sausage, let the sultry, anally hungry chicas of 'Butthole Barrio Bitches #2' escort you across their southern border!\n\n\n &lt;a href=&quot;\nhttp://bayimg.com/AAPDgAAEd&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://bayimg.com/AAPDgAAEd&lt;/a&gt;","torrent":{"xt":"urn:btih:3ec688e59731cb637e4d75e8827a7ac8b4b73520","amp;dn":"Butthole.Barrio.Bitches.2.XXX.DVDRip","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3ec688e59731cb637e4d75e8827a7ac8b4b73520","infoHashBuffer":{"type":"Buffer","data":[62,198,136,229,151,49,203,99,126,77,117,232,130,122,122,200,180,183,53,32]},"announce":[],"urlList":[]}}