{"title":"Relentless [azoozz]","uid":5348881,"size":264399783,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:3f8b9ec4c93b3b736ac0fa550696b9fad6dc6a50&amp;dn=Relentless+%5Bazoozz%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"azoozz","files":-1,"time":1265728350,"description":"Best-selling novelist Cullen &quot;Cubby&quot; Greenwich is a lucky man and he knows it. He makes a handsome living doing what he enjoys. His wife, Penny, a children's book author and illustrator, is the love of his life. Together they have a brilliant six-year-old, Milo, affectionately dubbed &quot;Spooky&quot;, nd a non-collie named Lassie, who's all but part of the family.\n\nSo Cubby knows he shouldn't let one bad review of his otherwise triumphant new book get to him - even if it does appear in the nation's premier newspaper and is penned by the much-feared, seldom-seen critic Shearman Waxx. Cubby knows that the best thing to do is ignore the gratuitously vicious, insulting, and inaccurate comments. Penny knows it; even little Milo knows it. If Lassie could talk, she'd tell Cubby to ignore them, too.\nIgnore Shearman Waxx and his poison pen is just what Cubby intends to do. Until he happens to learn where the great man is taking his lunch. Cubby just wants to get a look at the mysterious recluse whose mere opinion can make or break a career - or a life.\n\nBut Shearman Waxx isn't what Cubby expects, and neither is the escalating terror that follows what seemsto be an innocent encounter. For Waxx gives criticism; he doesn't take it. He has ways of dealing with those who cross him that Cubby is only beginning to fathom. Soon Cubby finds himself in a desperate struggle with a relentless sociopath, facing an inexorable assault on far more than his life.\n\nFearless, funny, utterly compelling, Relentless is Dean Koontz at his riveting best, an unforgettable tale of the fragile bonds that hold together all that we most cherish - and of those who would tear those bonds asunder.\n\n\nunabridged 9hrs +\n\nazoozz","torrent":{"xt":"urn:btih:3f8b9ec4c93b3b736ac0fa550696b9fad6dc6a50","amp;dn":"Relentless+%5Bazoozz%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3f8b9ec4c93b3b736ac0fa550696b9fad6dc6a50","infoHashBuffer":{"type":"Buffer","data":[63,139,158,196,201,59,59,115,106,192,250,85,6,150,185,250,214,220,106,80]},"announce":[],"urlList":[]}}