{"title":"Tom Clancys Endwar-VITALITY","uid":5352718,"size":38848498,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:3f9b0c70cb98a471fb7744a9d5f85474e8195b4b&amp;dn=Tom+Clancys+Endwar-VITALITY&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"brillmann","files":1,"time":1265834123,"description":"                                 Tom Clancy's End War  c  UBI SOFT\n                                                    Protection ..:\n                    Date ........: February 2762   Number of Discs .........: 1\n\nThe unthinkable happens in 2016. A nuclear exchange in the Middle East kills  20  million  people  and  cripples  the world's oil supply. Crude  oil  prices  #    spike  at  $800  a barrel. One year later, the threat of world-wide  nuclear  war  is eliminated when the United  States  and  Europe  deploy  a omprehensive space-based anti-ballistic  missile  shield.Russia soon  follows  with  an  advanced  missile  defense \nsystem of its own. Intercontinental ballistic missiles are rendered obsolete .Russia becomes the world's primary supplier of energy  and experiences a massive economic  boom.  With  its  newfound riches, Russia quickly re-establishes itself  as  a  major      superpower and restores her military might. Western Europe  #  , with the notable exception of the  UK  and Ireland, unifies to create the European  Federation.  This\nnew nation is destined to  be  a  formidable  21st-century Superpower.\nIn 2020, the United States is on the  verge  of  finishing construction on the Freedom Star, a controversial  orbital  military platform  #   that will upset  the  balance  of  world power. The European  Federation  withdraws  from  NATO  in protest. Tensions  between  the  European  Federation,  the  United States, and Russia are building and will  soon  reach  the breaking point. The EndWar is about to begin.  \n\n ÃƒÂ¯Ã‚Â¾Ã‚Â° ÃƒÂ¯Ã‚Â¾Ã‚Â°ÃƒÂ¯Ã‚Â¾Ã‚Â° INSTALL NOTES ÃƒÂ¯Ã‚Â¾Ã‚Â°ÃƒÂ¯Ã‚Â¾Ã‚Â°\n~ Unpack \n~ Burn or mount\n~ Continue to decompose","torrent":{"xt":"urn:btih:3f9b0c70cb98a471fb7744a9d5f85474e8195b4b","amp;dn":"Tom+Clancys+Endwar-VITALITY","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3f9b0c70cb98a471fb7744a9d5f85474e8195b4b","infoHashBuffer":{"type":"Buffer","data":[63,155,12,112,203,152,164,113,251,119,68,169,213,248,84,116,232,25,91,75]},"announce":[],"urlList":[]}}