{"title":"GaydarApp - Cracked For iPhone","uid":4854036,"size":436172,"categoryP":"applications","categoryS":"handheld","magnet":"?xt=urn:btih:4065a32426f6213f64ee5d93a06a6154dd4b9519&amp;dn=GaydarApp+-+Cracked+For+iPhone&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"jimdugan09","files":-1,"time":1239988397,"description":"GaydarApp is an interactive social networking community for iPhone complete with proximity search especially created with gay and lesbian people in mind. With this app you won't have to hone your Gaydar skills, you can just log on and see who you'd like to meet in your area and how far away they are.\n\nGet the scoop on potential friends with our detailed profiles complete with photos, stats, comments, interests and blogs. If you see someone who catches your eye, keep them in mind by saving them as one of your 'Favorites', or instantly send them a message or wink.\n\nInvite someone to meet for a drink down the street or leave comments on the profiles of people you'd like to get to know better. We even have a chat room available for all members so you can meet more people in groups. No matter what city you live in or travel to, Gaydar is a great tool for easily and quickly meeting new friends without the guesswork.\n\nFeatures:\n\n.Chatroom - A fully functional public chat room where you can join group conversations in real time! If you like what you see, press the name of the person and go directly to their profile.\n\n.Comments - We have added a comments section to every profile. If you have friends on Gaydar they can leave you comments for everyone to see.\n\n.Blogs - Every Gaydar user has a Blog section where they can write about anything that interests them. We have also created a Global Blog section so that anyone can see who has just written a blog and go to their profile to read it.\n\n.Winks - Have you found someone you are interested in with our unique search feature but are too shy to write a detailed message? No problem, just send them a wink and get them to notice you.\n\n.Messages - Send messages to your potential mate, they will instantly receive them and sent messages are saved automatically.","torrent":{"xt":"urn:btih:4065a32426f6213f64ee5d93a06a6154dd4b9519","amp;dn":"GaydarApp+-+Cracked+For+iPhone","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4065a32426f6213f64ee5d93a06a6154dd4b9519","infoHashBuffer":{"type":"Buffer","data":[64,101,163,36,38,246,33,63,100,238,93,147,160,106,97,84,221,75,149,25]},"announce":[],"urlList":[]}}