{"title":"CON-AIR.DVDrip[vice]","uid":5239311,"size":559375254,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:428ee88b22b7148f530461f6687736e3a3477cd4&amp;dn=CON-AIR.DVDrip%5Bvice%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"vicerock","files":-1,"time":1261680130,"description":"CON AIR DVDrip\n\nVIDEO CODEC Xvid\nformat Avi\nsize/res 480x320[wide screen]\nrun-time 01:55:24\nvideo bitrate 512\nvideo framerate 25\nXvid profile asp5\n\nAUDIO CODEC mp3\naudio bitrate 128\nsample rate 44100\na/v sync basic\n\nCAST\n\nNicolas Cage\nJohn Cusack\nJohn Malkovich\nVing Rhames\nMykelti Williamson\nNick Chinlund\nSteve Buscemi\n\nPlot\n\nCameron Poe (Cage), an honorably discharged United States Army Ranger is paroled after serving eight years for killing a drunken man in a bar brawl while defending his wife Tricia (Potter) and unborn daughter Casey (Allbright). While still under the penal system until release in Alabama, Poe is to be flown back on the &quot;Jailbird&quot;, a C-123 airplane, along with several other prisoners that are being transferred to a new Supermax prison. Drug Enforcement Administration agent Duncan Malloy (Meaney) approaches U.S. Marshal in charge of the transfer, Vince Larkin (Cusack), and requests he slip undercover agent Willie Sims on board to coax information out of drug lord Fransico Cindino (Borrego) during the flight before his incarceration. Larkin reluctantly agrees on the condition Sims doesn't carry a weapon, but Malloy manages to slip a gun to Sims before boarding.\n\nShortly after the flight, the prisoners launch a choreographed effort led by Cyrus &quot;The Virus&quot; Grissom (Malkovich) and overcome guards, taking control of the plane; when Sims tries to take control of the situation, he is quickly killed. Poe opts to keep his identity quiet and cooperates with Grissom, who promises all prisoners that they will also be flown to a non-extradition country thanks to Cindino if they help out. The plane lands in Carson City as scheduled to make prisoner transfers; Grissom and his crew pose as the guards and take advantage of a dust storm to make sure the transfer appears to go smoothly, while Joe &quot;Pinball&quot; Parker (Chappelle) sneaks the Jailbird's transponder onto a private tour plane. Although Poe secretly manages to get word out on the hijacking, it is too late to stop plane from taking off.\n\nMalloy orders attack helicopters to follow the transponder, unaware it is no longer on the plane. Poe discovers Parker did not make it back to the plane on time, his body still stuck in the landing wheel wells, and writes a message to Larkin to inform him the plane is headed for Lerner Airfield, an abandoned US Air Force base, then dumps the body overboard onto a populated city. Larkin learns of the message, and recognizes Poe is his ally on the plane, and calls in the National Guard while he travels alone to Lerner Airfield.\n\nThe plane lands but overshoots the runway, running aground. When neither Grissom nor Cindino can find the promised plane waiting for them, Grissom orders the prisoners to start digging the &quot;Jailbird&quot; free. Poe and Larkin happen upon each other, and quickly apprise each other of the situation, though Poe remains untrusting of Larkin's abilities. Larkin, sneaking about the airfield, discovers Cindino has snuck off to meet with his men at a small private jet. As the plane is taxing towards the runway at high speed, Larkin hops into a nearby crane and lowers it in front of the moving jet, ripping the entire tail section off in process. Grissom comes quickly to the wreckage and discovers Cindino's treachery. Using a lit cigarette to ignite fuel leaking from the plane, he kills him and destroys the remainders of the plane. &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0118880/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0118880/&lt;/a&gt;\n\nPLEASE SEED AND ENJOY THANKS\n\nSCREEN SHOTS &lt;a href=&quot;\nhttp://img709.imageshack.us/img709/5458/conairdvdripvicexvidavi.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img709.imageshack.us/img709/5458/conairdvdripvicexvidavi.jpg&lt;/a&gt;","torrent":{"xt":"urn:btih:428ee88b22b7148f530461f6687736e3a3477cd4","amp;dn":"CON-AIR.DVDrip%5Bvice%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"428ee88b22b7148f530461f6687736e3a3477cd4","infoHashBuffer":{"type":"Buffer","data":[66,142,232,139,34,183,20,143,83,4,97,246,104,119,54,227,163,71,124,212]},"announce":[],"urlList":[]}}