{"title":"Sexually Broken--Hot MILF with amazing ass Syren De Mer","uid":9366803,"size":993504469,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:49cae3c6c4e2f769023469a4ac397aefd2777de7&amp;dn=Sexually+Broken--Hot+MILF+with+amazing+ass+Syren+De+Mer&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"merzedes","files":-1,"time":1387440775,"description":"Hot MILF, with amazing ass, suffer rough pounding sex and deep throating. Made to cum over and over! | Syren De Mer | Matt Williams\n\nDecember 18, 2013\n\n\nMP4 only.\n\n\nSyren De Mer is, and we mean this in the best of all possible ways, a sex addicted, cock loving slut. She got into porn so that she could get more of what makes her so happy. Lots and lots of dick. Some of the models just want the paycheck, or the attention, but not Syren. She wants the cock. You can see her eyes light up as she gets her fix. Today she is going to get all the cock she can handle. And then some.\n\nLashed down to the legendary Sexually Broken fuck bed, in a face down ass up doggy style position with a rope belt around her waist for easy griping, Syren is about to have the ride of her life. Her flawless ass is perfectly exposed and a tempting target. Never one to pass up such a target, we warm her up with some flogging and a vibrator. She cums almost instantly, she is so excited and eager. This is one easy slut. All you have to do is look at her and orgasms fall out of her pussy. Enough warm up. Time for some real action.\n\nIn a relentless, well coordinated tag team of cock, we unleash the hounds. It is just a dizzy blur of sucking and fucking and Chinese finger trapping as both ends of our MILF are used without mercy. Some models resist subspace and fight it off, afraid to go that far. Not Syren. You can see her eyeing the distance to the cliff and pushing herself off as quickly as possible. With a wide sex crazed grin dancing across her face, our cum slut is in heaven. The teeth rattling bone jarring pounding she is getting is exactly why she showed up today.\n\nEven as Syren shifts and becomes undone, even as she melts into a puddle of well fucked flesh, hair a mess and makeup melted off, that cat that ate the canary grin never leaves her face. Her glow is enough to light up the room. That is how you know you have done it right. When we are all done with her we leave her to drift off into a sexual stupor. You are very welcome Syren, we aim to please.   \n\nScreens &lt;a href=&quot;\nhttp://sexuallybroken.com/sexual/bondage/2013/12_18sdemer2/SexuallyBroken-Syren-De-Mer-Matt-Williams-Hot-MILF-with-amazing-ass-suffer-rough-pounding-sex-and-deep-throating-Made-to-cum-over-and-over.php&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://sexuallybroken.com/sexual/bondage/2013/12_18sdemer2/SexuallyBroken-Syren-De-Mer-Matt-Williams-Hot-MILF-with-amazing-ass-suffer-rough-pounding-sex-and-deep-throating-Made-to-cum-over-and-over.php&lt;/a&gt;\n\n12 000 uploads and counting, 13k here we come :) And as usual, if you still like what Shallow2 and I upload, how about leaving us a nice comment below ? :)  \n  \nCheers  :-)  \n\n","torrent":{"xt":"urn:btih:49cae3c6c4e2f769023469a4ac397aefd2777de7","amp;dn":"Sexually+Broken--Hot+MILF+with+amazing+ass+Syren+De+Mer","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"49cae3c6c4e2f769023469a4ac397aefd2777de7","infoHashBuffer":{"type":"Buffer","data":[73,202,227,198,196,226,247,105,2,52,105,164,172,57,122,239,210,119,125,231]},"announce":[],"urlList":[]}}