{"title":"Aimee Mann Discography","uid":3653646,"size":663441343,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:4c00d8138cdb7fd495be50f7658b272867451467&amp;dn=Aimee+Mann+Discography&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"paranapiacaba","files":116,"time":1175575119,"description":"In 1993 Mann released Whatever, her first solo album. Promotion suffered due to the collapse of her label, Imago. While only a small hit, the album was critically praised, and paved the way for her next release, 1995&amp;#039;s I&amp;#039;m with Stupid, through Geffen Records. Again, reviews were positive, but sales were weak.\n\nMann met fellow singer-songwriter Michael Penn in the late 1980s and with comparable songwriting styles and record-industry woes to share, they struck up a friendship during the recording of Stupid (to which Penn contributed vocals), which blossomed into romance and their 1997 marriage. Penn and Mann live in the Los Feliz neighborhood of Los Angeles. They have no children, but Penn has a son from a previous marriage.\n\nMann recorded Bachelor No. 2, but Geffen saw no hit singles in the material and ordered her back to the studio. The album languished while Mann and the label fought.\n\nMeanwhile, film director Paul Thomas Anderson, for whom Penn and Brion had composed a soundtrack, became a close friend. Mann gained greater public recognition in 1999 ? indeed, more than anything else since &quot;Voices Carry&quot; ? when she contributed eight songs to the soundtrack of Anderson&amp;#039;s Magnolia, including the Academy Award-nominated song, &quot;Save Me.&quot; Anderson deliberately worked from Mann&amp;#039;s lyrics to create the film&amp;#039;s characters and situations. Mann soon became sought after as a soundtrack contributor.\n\nDisillusioned with both the ineffectual promotion and artistic meddling by her record label, an experience documented in her song &quot;Calling It Quits&quot;, she struck out on her own and founded SuperEgo Records in 1999. Mann self-released Bachelor No. 2 in 2000, having negotiated a contract release from Geffen, and though initially only sold at concerts and via her website, the album became successful, allowing her to secure retail distribution through SuperEgo. The album, which included some songs from Magnolia and new material, was widely admired and Mann\\&amp;#039;s &quot;more indie than indie&quot; success was carefully noted by other musicians.\n\nMann, Penn, Brion, Fiona Apple, and other musicians had by this time developed a subculture around the Largo nightclub in L.A. Penn and Mann formed a concept called Acoustic Vaudeville to recreate it on tour in California and eventually on an irregular, ongoing national tour. The Acoustic Vaudeville shows intermix music and stand-up comedy; among the comedians joining them for individual shows were Janeane Garofalo, Patton Oswalt, and David Cross.\n\nMann continued her solo career with Lost in Space (2002), a somewhat more sombre album in the same vein as Bachelor No. 2. In 2003 her website released the Lost in Space Special Edition, which featured a second disc containing six live recordings, as well two B-sides and two previously unreleased songs. In November 2004, Live at St. Ann&amp;#039;s Warehouse, a live album and DVD recorded at a series of June 2004 shows in Brooklyn, came out; the two discs were sold packaged together in either a CD jewel case or a DVD case.\n\nMann described her next album, The Forgotten Arm (2005), as a concept album set in the 1970s about two lovers who meet at the Virginia state fair and go on the run. The Joe Henry-produced album, which was recorded mostly live with few overdubs, was released May 3, 2005. The album&amp;#039;s illustrations and title reflect Mann&amp;#039;s interest in boxing. The album title derives from a boxing move in which one arm is used to hit the opponent, causing him to &quot;forget&quot; about the other arm, which is then used to deliver a harsher blow. The album received weaker reviews overall, with critics impressed at the totality but unimpressed with any individual songs.\n\nMann also released an EP for Christmas in 2005 as a cover single of &quot;Have Yourself a Merry Little Christmas&quot; for sale through her website and iTunes. It also included &quot;Christmastime&quot;, the 1996 duet she recorded with Penn for the Hard Eight soundtrack, and a cover of &quot;The Christmas Song&quot;. The iTunes version replaced &quot;Christmastime&quot; with a cover of Joni Mitchell&amp;#039;s &quot;River&quot; and &quot;I Was Thinking I Could Clean Up for Christmas&quot; from The Forgotten Arm.\n\nMann&amp;#039;s independence from the industry led to more overt political stances. She joined Artists Against Piracy, a group formed to act against the illegal downloading and file sharing of copyrighted music from the Internet. Mann, Penn and Hausman took their experience with SuperEgo to found the independent music collective United Musicians, which is based on the principle that every artist should be able to retain copyright ownership of the work he or she has created, in contrast to normal music industry contracts.\n\nIn July 2006, Mann announced that she would be releasing One More Drifter in the Snow, a full-length Christmas album. The album featured primarily covers of Christmas standards, as well as &quot;Christmastime&quot; and an original song, called &quot;Calling On Mary&quot;, written by Mann and bassist Paul Bryan, who produced the record. It was released on October 31 in the US, and late November 2006 in the UK.","torrent":{"xt":"urn:btih:4c00d8138cdb7fd495be50f7658b272867451467","amp;dn":"Aimee+Mann+Discography","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4c00d8138cdb7fd495be50f7658b272867451467","infoHashBuffer":{"type":"Buffer","data":[76,0,216,19,140,219,127,212,149,190,80,247,101,139,39,40,103,69,20,103]},"announce":[],"urlList":[]}}