{"title":"To verdener aka Worlds apart 2008(NLsubs)(rocco) 2Lions-Team","uid":5650706,"size":3348793789,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:4eba2956ce9f32530cee0baf5af38cbbab6feda8&amp;dn=To+verdener+aka+Worlds+apart+2008%28NLsubs%29%28rocco%29+2Lions-Team&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"rocco64","files":-1,"time":1277638408,"description":"Denemarken 2008\n\n108 min.\ninternat.titel: Worlds Apart\n\nRegie: Niels Arden Oplev (DrÃƒÂ¸men) \n\nMet: Rosalinde Mynster , Johan Philip AsbÃƒÂ¦k , Jens JÃƒÂ¸rn Spottag , Sarah Boberg , Anders W. Berthelsen , Sarah Juel Werner , Jacob Ottensten , Thomas Knuth-Winterfeldt e.a \n\nDutch:\n\nTo Verdener ( twee werelden ) is niet meer of minder dan een klein Deens meesterwerkje. Een verhaal over het maken van soms loodzware keuzes in het leven. In een perfect tempo gemaakt en zÃƒÂ³ goed verteld, zÃƒÂ³ objectief belicht en met een dialoog tussen de hoofdpersoon en haar vader aan het einde van de film welke zÃƒÂ³ cruciaal en to the point is dat deze in de analen van de filmgeschiedenis met hoofdletters bijgeschreven mag worden. Rosalinde Mynster weet deze film over een geloofs- en gewetensconflict ook nog eens dermate geloofwaardig te registreren dat, er gezien de interactie in de film, op de set welhaast emmerladingen chemie over de hoofden van de hoofrolspelers moet zijn uitgegoten.\n\nEen jonge vrouw, een meisje eigenlijk nog, Sara, opgevoed als Jehova's getuige, wordt gedwongen tot een enorm dilemma wanneer ze valt voor een charmante oudere jongen. In dit geval de &quot; niet getuige &quot; Teis. Sara's vader, gescheiden van zijn vrouw wegens zijn overspel en de Jehova geloofsgemeente zijn tegen deze relatie en zo ontstaan er voor Sara serieuze problemen omtrent het kiezen tussen familie en geloof enerzijds of voor de veronderstelde liefde van haar leven anderzijds. Dit thema, op zich welliswaar niet bijster origineel maar toch zo herkenbaar, heeft, hoe men er ook tegen aan kijkt, wel een behoorlijke mate van actualiteit t.a.v. onze tijd van leven. Het hier en nu waarin zo veel mensen ÃƒÂ³f afzien van hun religieuze wortels, al dan niet verleid door geld, winkelen, seks, individualiteit etc. ÃƒÂ³f, aan de andere kant, juist tot het absurd ziekelijke en het extreme worden aangetrokken door wat zij zien als &quot; de enige ware &quot; religie en hierbij de geloofs -en levenswaarden van anderen goed of kwaadschiks tot in het bizarre willen onderwerpen.\n\nEen van de mooie dingen van deze film is juist dat er niet geoordeeld en veroordeeld wordt. Er is geen goed of slecht als het gaat om religie. De levenswijze van de Jehova's wordt onbevooroordeeld weergegeven, niet sympathiek maar evenmin bedreigend. Elke beslissing die Sara en haar familie moet maken is als mens niet licht te nemen want deze zal hoe dan ook beschadigen. Met een knap en hoopvol einde is deze film ondanks de ondertoon verre van deprimerend. In feite is het zelfs een zeer positieve film die het in zich heeft later een tweede of zelfs een derde maal te gaan zien en dan wellicht nÃƒÂ³g beter te worden bevonden.\n\nEnglish:\n\nSara is a teenager who lives with her family, who are Jehova's Witnesses. The family's devout image is questioned when the parents divorce as a consequence of the father's infidelity. One night at a party Sara meets Teis, an older boy who takes an interest in her. Teis is not a Witness, and their relationship is rejected by her father, but Sara falls in love and begins to doubt her faith. Facing ostracism from her faith and family, Sara must make the toughest choice of her young life.\n\n\nPostinformatie \n\nCategorie     : Beeld \nFormaat       : DVD5 \nBron          : Retail\nOndertitels   : Nederlands  (instelbaar) \nMenu          : Nee\nCover         : Ja\nLabel         : Ja\nGenre         : Drama\n  &lt;a href=&quot;\nhttp://www.moviemeter.nl/film/49014&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.moviemeter.nl/film/49014&lt;/a&gt;\n\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt1286731/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt1286731/&lt;/a&gt;\n  \n \n      \n*****************************************\n\nBrought to you by rocco\n2Lions Team\n\nmeer zien??\nKom dan eens kijken op ons forum \n &lt;a href=&quot;\nhttp://www.2lions.ons-forum.nl&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.2lions.ons-forum.nl&lt;/a&gt;\n\n\n******************************************\nwanna see more check our Forum\n &lt;a href=&quot;\nhttp://www.2lions.ons-forum.nl&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.2lions.ons-forum.nl&lt;/a&gt;\n\n\n\n\n\nEnjoy \n2Lions-Team\n\n\nThere are fake torrents from uploaders who use our team name.\nThose are not ours, or members from our team.\nWe 2Lions-Team are not responsible for the fake posts on our name\n\nWij 2Lions-Team zijn niet verantwoordelijk voor die zieke FAKE posten die op onze naam worden gedaan\n\nPlease check our site !!!\n\nto the fakers , get a life !!!\n\n********************************************* ","torrent":{"xt":"urn:btih:4eba2956ce9f32530cee0baf5af38cbbab6feda8","amp;dn":"To+verdener+aka+Worlds+apart+2008%28NLsubs%29%28rocco%29+2Lions-Team","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4eba2956ce9f32530cee0baf5af38cbbab6feda8","infoHashBuffer":{"type":"Buffer","data":[78,186,41,86,206,159,50,83,12,238,11,175,90,243,140,187,171,111,237,168]},"announce":[],"urlList":[]}}