{"title":"Billy Joel - Allentown","uid":4855058,"size":139980804,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:522576f2a372eaa4015a9cf3f162df5a97c30512&amp;dn=Billy+Joel+-+Allentown&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":-1,"time":1240030258,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\n&quot;Allentown&quot; is a Billy Joel song, which first appeared on Joel's The Nylon Curtain (1982) album, accompanied by a conceptual music video. It later appeared on Joel's Greatest Hits: Volume II (1985), 2000 Years: The Millennium Concert (2000), The Essential Billy Joel (2001), and &quot;12 Gardens Live&quot; (2006) albums. &quot;Allentown&quot; is the lead track on The Nylon Curtain, which was the seventh best-selling album of the year in 1982. The song reached #17 on the Billboard Hot 100, making it one of the most-played radio songs of 1982. The video,directed by Russell Mulcahy, was also in heavy rotation on MTV during 1982 and 1983. The original airing of the song featured rear male nudity in the opening of the song as steelworkers showered; the scene was edited from subsequent airings on MTV.\n\nThe song was met with mixed responses in Allentown. Some criticized the song as degrading and stereotyping by an artist who had never lived in the region (Joel is from Long Island, New York). But when Joel returned to the area following the album's release and the song's rise to global popularity, he was awarded the key to the city by Allentown's mayor, who praised it as &quot;a gritty song about a gritty city.&quot; Before a sold-out crowd at Stabler Arena in neighboring Bethlehem, People magazine reported that Joel was greeted enthusiastically with a five minute standing ovation as he closed his third encore with &quot;Allentown.&quot; At the end of the song and extended ovation, Joel was greeted with even more sustained applause when, in an apparent defense of the song's meaning, he pointedly told the Allentown crowd: &quot;Don't take any shit from anybody.&quot;\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:522576f2a372eaa4015a9cf3f162df5a97c30512","amp;dn":"Billy+Joel+-+Allentown","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"522576f2a372eaa4015a9cf3f162df5a97c30512","infoHashBuffer":{"type":"Buffer","data":[82,37,118,242,163,114,234,164,1,90,156,243,241,98,223,90,151,195,5,18]},"announce":[],"urlList":[]}}