{"title":"Blindado TS-Screener Medio Spanish 2009","uid":5211409,"size":1455194139,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:5451f6de09bfa264c68e681fea9f4a5442a00851&amp;dn=Blindado+TS-Screener+Medio+Spanish+2009&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Mois20","files":2,"time":1260612035,"description":"DespuÃƒÂ©s de la muerte de sus padres, Ty Hackett (Columbus Short) regresa del servicio activo en Irak para hacer frente a un montÃƒÂ³n de gastos mÃƒÂ©dicos, impagos, una hipoteca y asumir la responsabilidad de su hermano de 14 aÃƒÂ±os, Jimmy (Andre Jamal Kinney). Ty consigue un trabajo como guardia en Eagle Shield Security, la misma compaÃƒÂ±ÃƒÂ­a de camiones blindados para la que trabajÃƒÂ³ su padre. Bajo la tutela de su padrino, el Oficial Jefe Michael Cochrane (Matt Dillon), Ty se entrena para su difÃƒÂ­cil y, en muchas ocasiones, peligrosa nueva carrera. \n\nEn el ÃƒÂºltimo dÃƒÂ­a de su periodo de prueba, sus compaÃƒÂ±eros de trabajo sacan al joven para celebrarlo. Beben cerveza e intercambian anÃƒÂ©cdotas, revelan fallos en el sistema de seguridad y comentan sobre los intentos de robo fallidos y sobre los que han tenido ÃƒÂ©xito. Cochrane tiene la mejor historia: un robo sin resolver en Texas para el que cree tener la respuesta. La ÃƒÂºnica manera en que puede haber sucedido, afirma, es si los mismos guardias fueron los autores del golpe. \n\nCuando mÃƒÂ¡s tarde lleva a Ty hasta su casa, Cochrane le revela que el incidente del que habÃƒÂ­an estado hablando le ha dado la inspiraciÃƒÂ³n para idear el plan perfecto. Con una trabajo de 42 millones de dÃƒÂ³lares en camino, Cochrane propone desviarse de la ruta, guardar el dinero en un almacÃƒÂ©n abandonado y denunciar el robo. Sin vÃƒÂ­ctimas, sin tipos malos y sin pistas. Todo lo que se necesita para que estos seis hombres se conviertan en los tipos mÃƒÂ¡s ricos que jamÃƒÂ¡s pudieron imaginar, es la cooperaciÃƒÂ³n de todos los guardias involucrados. Cochrane ya ha convencido a los otros: al impulsivo e impetuoso Baines (Laurence Fishburne); el callado pero intenso Quinn (Jean Reno); el muy nervioso y vulnerable Dobbs (Skeet Ulrich); y el ex-convicto redimido Palmer (Amaury Nolasco). Ty es todo lo que se interpone entre ellos y sus planes para una vida mejor. \n\nEn un principio Ty se niega incluso a considerar la idea de robarle a su empresa, pero la amenaza del banco de quedarse con su casa y que su hermano termine en un hogar de acogida le convence para unirse a sus compaÃƒÂ±eros, solo pone una condiciÃƒÂ³n: Cochrane le debe prometer que nadie saldrÃƒÂ¡ herido. \n\nEn el gran dÃƒÂ­a, la recogida del dinero se produce sin tropiezos. DespuÃƒÂ©s de realizar el registro con el despachante, los hombres se desvÃƒÂ­an hasta el lugar elegido para ocultar el dinero. Llenos de energÃƒÂ­a y optimismo se disponen a descargar el dinero rÃƒÂ¡pidamente, pero una inesperada interrupciÃƒÂ³n cambia el curso de los acontecimientos. Con su futuro y millones de dÃƒÂ³lares en juego, el grupo de hombres entra en un estado de confusiÃƒÂ³n en el que tratan de salvar lo que pueden y en un trÃƒÂ¡gico instante, todo cambia.","torrent":{"xt":"urn:btih:5451f6de09bfa264c68e681fea9f4a5442a00851","amp;dn":"Blindado+TS-Screener+Medio+Spanish+2009","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5451f6de09bfa264c68e681fea9f4a5442a00851","infoHashBuffer":{"type":"Buffer","data":[84,81,246,222,9,191,162,100,198,142,104,31,234,159,74,84,66,160,8,81]},"announce":[],"urlList":[]}}