{"title":"[BP] Friend Blaster Pro v10.8.1 + CRACK - CLEAN [BP]","uid":5256463,"size":4963283,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:54a8945cad3d2052b24ea4b83488a761fa22ef1f&amp;dn=%5BBP%5D+Friend+Blaster+Pro+v10.8.1+%2B+CRACK+-+CLEAN+%5BBP%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"pieszbob1","files":-1,"time":1262565039,"description":"FRESH OUT OF THE OVEN!  VERSION 10.8.1. REGISTERED!  ENJOY!\n\n\n\n* Target your market based on a members age, sex, geographic location, interests, and more.\n* Gather friend(s) id's from browsing the groups, forums, friend lists, classi fieds or any other area of MySpace.\n* Auto Messenger that allows you to send out messages to all of your friends or to any specified target market.\n* Auto Commenter feature that allows you to send out comments to all of your friends.\n* Timed Bulletins feature that gives you full control of &quot;how many&quot; and &quot;when&quot; to send out Bulletins.\n* Accept Friends feature that allows you to accept all pending friend request and also allows you to send out a comment or message along with accepting your new friends.\n* Send message along with Friend Request feature that allows you to send both a message and a Friend Request to the same person.\n* NEW! Multiple registered accounts can now be chained together!\n* NEW! Set FriendBlasterPro to auto start (with use of Multiple account Feature).\n* NEW! Time-delay feature!\n* And still much, much more!\n\n\n***INSTALL TIPS***\n\nBE SURE TO UNINSTALL PREVIOUS VERSIONS OF FRIEND BLASTER PRO. ALSO REMOVE REGISTRY ENTRIES JUST TO ENSURE A CLEAN INSTALL!\n\nSimply install friendblasterpro_v10_8_1.exe and once installed copy and past the cracked friendblasterpro.exe over the existing one located in C:Program FilesFriendBlasterPro\n\nIf you happen to get the message saying that you can not add yourself as a friend, simply go to that part of Gather ID's and delete the first ID in the list. This should fix the problem.\n\nThis torrent was scanned with BitDefender security suite 2009!\n\nThis torrent was scanned with BitDefender security suite 2009!\n\nThis torrent was scanned with BitDefender security suite 2009!\n\nThis torrent was scanned with BitDefender security suite 2009!\n\n\nALWAYS scan your torrents before ever installing them! Even though I scan them before posting, not everyone is as kind! You can never be too safe!\n\n\nENJOY!\n","torrent":{"xt":"urn:btih:54a8945cad3d2052b24ea4b83488a761fa22ef1f","amp;dn":"%5BBP%5D+Friend+Blaster+Pro+v10.8.1+%2B+CRACK+-+CLEAN+%5BBP%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"54a8945cad3d2052b24ea4b83488a761fa22ef1f","infoHashBuffer":{"type":"Buffer","data":[84,168,148,92,173,61,32,82,178,78,164,184,52,136,167,97,250,34,239,31]},"announce":[],"urlList":[]}}