{"title":"Whitney Houston - Where Do Broken Hearts Go  (2nafish)","uid":5281296,"size":163928068,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:555de527c76c4fa01ba7081d71f4d99feab08055&amp;dn=Whitney+Houston+-+Where+Do+Broken+Hearts+Go++%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":-1,"time":1263561513,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\n&quot;Where Do Broken Hearts Go&quot; is the fourth single from Whitney Houston's second album, Whitney. The ballad was released in March 1988. The song was written by Frank Wildhorn and Chuck Jackson.\n\nInitially, Houston did not want to record the song, feeling there was no special message to convey. However, Arista Records CEO Clive Davis believed the song would go to number one if she recorded it, so she agreed. The single became Houston's seventh consecutive number one.\n\nThe music video (directed by Peter Israelson) features Houston breaking up with a boyfriend and reflecting on happy memories; asking herself the title question, &quot;where do broken hearts go?&quot; At the conclusion of the music video, the couple reunites.\n\nHouston was already in a three-way tie with The Beatles and the Bee Gees; all three acts with six consecutive number-one singles in the U.S. &quot;Where Do Broken Hearts Go&quot; gave her a record-breaking seven consecutive number-one singles, holding down the top spot for two weeks from April 23 to May 7, 1988.\n\nThe song also topped both component charts, the Billboard Hot 100 Single Sales and Hot 100 Airplay and remained in the top forty for thirteen weeks. On other Billboard charts, the song fared well, reaching number one for three weeks on the Adult Contemporary chart and number two on the R&amp;B chart. The song was ranked #33 on Billboard's year end chart in 1988 and #2 on its year end Adult Contemporary chart.\n\nThe song also became a top twenty hit in the United Kingdom and fared moderately in Australia, reaching number forty-eight.\n\n&quot;Where Do Broken Hearts Go&quot; was ranked thirty-third on The Billboard Hot 100 Year-End Charts (1988), and stayed on the chart for seventeen weeks. It was Houston's record-setting seventh consecutive number-one single on The Billboard Hot 100, sixth on the Hot 100 Single Sales chart, fifth on the Hot 100 Airplay chart, and sixth on Adult Contemporary chart.\n\nWhitney is the second studio album by American pop/R&amp;B singer Whitney Houston, released on June 29, 1987 by Arista Records.\n\nThe album became the first by a female artist ever to debut at #1 in the Billboard 200, and produced a then-record-equalling four #1 singles from one album. (This record was broken two months later when Michael Jackson's Bad album produced five #1's.) Whitney is one of only seven albums in music history to produce at least four #1 Hot 100 hits from the same album. This feat, along with the three #1's from her debut album, also gave Houston seven consecutive #1 songs, the most consecutive #1's by any musical act (a record she still holds). The most consecutive #1's title was previously held by both The Beatles and the Bee Gees with six each.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:555de527c76c4fa01ba7081d71f4d99feab08055","amp;dn":"Whitney+Houston+-+Where+Do+Broken+Hearts+Go++%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"555de527c76c4fa01ba7081d71f4d99feab08055","infoHashBuffer":{"type":"Buffer","data":[85,93,229,39,199,108,79,160,27,167,8,29,113,244,217,159,234,176,128,85]},"announce":[],"urlList":[]}}