{"title":"Jessica Harp - Boy Like Me","uid":4942865,"size":134912004,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:56051142d38bfd3209cec17a8b9fdca0dbfaddd5&amp;dn=Jessica+Harp+-+Boy+Like+Me&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"2nafish","files":-1,"time":1244529834,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 256 kbps\n\n\n&quot;Boy Like Me&quot; is a song written by Jerry Flowers, originally one-third of the Australian band The Ranch, and recorded by American country artist Jessica Harp as the first single to her debut album, A Woman Needs. &quot;Boy Like Me&quot; was released as a digital download on February 10, 2009 and was released as a single to country radio on March 9, 2009. This is Harp's first solo single release, and her first release since The Wreckers, a country duo consisting of Harp and Michelle Branch, put their project on hold in the interest of solo careers.\n\nA music video, directed by Scott Speer, was released for the song on March 3, 2009. In the video, Harp is portrayed as a housewife. Harp is shown preparing breakfast for a man in the morning. She then has a food fight with him over dinner, and they have a pillowfight in the bedroom. Mixed in are scenes of Harp singing with a microphone stand in a hallway, lying in a bath tub, and tossing photographs into the air while on a bed.\n\n&quot;Boy Like Me&quot; debuted at #58 on the Billboard Hot Country Songs chart for the week of March 28, 2009. After seven weeks on the chart, it entered the Top 40.\n\nJessica Leigh Harp (born on February 3, 1982, in Kansas City, Missouri) is an American singer who performs country music. Between 2005 and 2007, she and Michelle Branch comprised The Wreckers, a duo that topped the country charts in 2006 with the Grammy-nominated &quot;Leave the Pieces&quot;. After The Wreckers disbanded, Harp began a solo career on Warner Bros. Records, the same label to which The Wreckers were signed. Her solo debut single &quot;Boy Like Me&quot; made its chart debut in March 2009.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:56051142d38bfd3209cec17a8b9fdca0dbfaddd5","amp;dn":"Jessica+Harp+-+Boy+Like+Me","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"56051142d38bfd3209cec17a8b9fdca0dbfaddd5","infoHashBuffer":{"type":"Buffer","data":[86,5,17,66,211,139,253,50,9,206,193,122,139,159,220,160,219,250,221,213]},"announce":[],"urlList":[]}}