{"title":"The Shining DVDRIP+ENG SUBS-Hyperdrive25","uid":6134288,"size":309662152,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:575180a3fb274df47d4d312e94f0159660d973cb&amp;dn=The+Shining+DVDRIP%2BENG+SUBS-Hyperdrive25&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Hyperdrive25","files":2,"time":1296240161,"description":"                    The Shining 1980 with English Subtitles\n                   ----------------------------------------\nThe Shining is a 1980 psychological horror film directed by Stanley Kubrick, co-written with novelist Diane Johnson, and starring Jack Nicholson, Shelley Duvall, and Danny Lloyd. The film is based on the novel of the same name, by Stephen King, about a writer with a wife and young son who accepts the job of off-season caretaker at an isolated hotel. The son, who possesses psychic abilities, is able to see things in the future or past, such as the ghosts in the hotel. Soon after moving in, and after a paralyzing winter storm that leaves the family snowbound, the father becomes influenced by the supernatural presence in the haunted hotel; he descends into madness and attempts to kill his wife and son.\n\n\n\nMovie Review By Your Friendly Neighborhood Hyperdrive \n-----------------------------------------------------\nThis is another signature Kubrick film. You can expect beautiful photography and \nan excellent background music score. The script is well written and the dialogue is freely flowing. Jack Nicholson who portrays the writer and ex-schoolteacher,\ngives a professional performance and thoroughly gets into the act. The character \nhe portrays literally undergoes a transformation before your eyes. He is complemented well by Shelley Duvall who plays the wife of Jack's character. She portrays a simple housewife who passes her time with household chores and taking care of their only son. Danny Lloyd who plays Jack's son is simply a joy to behold throughout the film. The role fits him like a glove and his acting is simply phenomenal.  \n\nNot to forget to mention Scatman Crothers who always gives his best to us. He is a\nborn actor and his presence onscreen is very powerful. The film really clicks into gear when he and Danny have a personal conversation about the Overlook Hotel over some ice-cream. And it is here that he mentions about that very special gift: The Shining....\n\n...................................................................................\n\nPlayback guide for PC: To play this video make sure you have VLC media player (VideoLAN) or SMplayer installed on your PC.\n\n\nDownload VLC Media Player: http://www.videolan.org/\n\nDownload SMPlayer: http://smplayer.sf.net/\n\n\nAnother Quality Torrent Courtesy of Hyperdrive25. All My torrents are here:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/Hyperdrive25&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/Hyperdrive25&lt;/a&gt;\n\n\nRemember To Keep Seeding. A little seeding goes a long way...\n\n***************************ITS TIME TO GO HYPER!!!*********************************\n\nI love to share,\nI love to care,\nI like to sing,\nSo that I can bring,\nA ray of sunshine in your life.\n\n\nRemember: its YOUR WORLD. I just live in it. :) \n\n            ***  A BIG THANK YOU FOR ALL YOU SEEDERS OUT THERE! *** \n                            \n                           KEEP UP THE GOOD WORK!\n\n                              I LOVE U ALL!\n","torrent":{"xt":"urn:btih:575180a3fb274df47d4d312e94f0159660d973cb","amp;dn":"The+Shining+DVDRIP%2BENG+SUBS-Hyperdrive25","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"575180a3fb274df47d4d312e94f0159660d973cb","infoHashBuffer":{"type":"Buffer","data":[87,81,128,163,251,39,77,244,125,77,49,46,148,240,21,150,96,217,115,203]},"announce":[],"urlList":[]}}