{"title":"Coast to Coast Radio Program! Commercial Free! Feb 13th thru Feb","uid":4736018,"size":445523946,"categoryP":"audio","categoryS":"sound_clips","magnet":"?xt=urn:btih:58114cc522fa06dd3afce7b33aea136697a6f687&amp;dn=Coast+to+Coast+Radio+Program%21+Commercial+Free%21+Feb+13th+thru+Feb&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Stokeman","files":40,"time":1235292000,"description":"Hello All! I just wanted to stop by to drop off this week's package. Here are eight more broadcasts of C2C for you all to download, enjoy, and share! I have been trying to do my best to upload these every week and sometimes time just doesn't allow me to upload when I want. I hope you all understand that life gets in the way at times, but we all have to live it, that's for sure. Well, Download, SEED, and Enjoy! Thank you all in advance for your continued patronage. Until sometime next week when life allows..... Stokeman Out.....\n\nFriday February 13th, 2009\nHaunted Catalina\nIn the first hour, Rob &amp; Anne Wlodarski (email) talked about the ghostly and haunted happenings on Catalina Island. &quot;Most of the restaurants and hotels fronting Crescent Street in the main part of Catalina, almost all of them are haunted,&quot; Rob said. The... \nHost: George Noory\nGuest(s): Open Lines, Robert Wlodarski, Anne Wlodarski\n\nSaturday February 14th, 2009\nInfiltrating Hell's Angels\nJay &quot;Bird&quot; Dobyns spoke about his dangerous work as an undercover ATF agent. Dobyns said he created his undercover criminal persona over a period of 18 years through the use of 'street theaters' -- orchestrated plays with other undercover operatives who... \nHost: Ian Punnett\nGuest(s): Jay Dobyns, James Chiles\n\nSunday February 15th, 2009\nMilitary Experiments\nGeorge Knapp was joined by attorney Gordon P. Erspamer and psychiatrist Dr. James Ketchum, who engaged in a spirited debate over military experiments conducted on troops during the 1950s and 60s. The two guests offered vastly different perspectives on... \nHost: George Knapp\nGuest(s): Gordon P. Erspamer, Dr. James Ketchum, Frank Rochelle, Trevor Paglen\n\nMonday February 16th, 2009\nState Sovereignty\nAlternative media activist Alex Jones spoke about the issue of state sovereignty-- over 20 states have passed or proposed resolutions to maintain the 10th Amendment which asserts states' rights not expressly delegated to the federal government. Specifically,... \nHost: George Noory\nGuest(s): Alex Jones, Jerome Corsi, Matt Shea, Jim Guest, Dan Itse, Charles Key, Peter Davenport\n\nTuesday February 17th, 2009\nUFOs &amp; Nuclear Sites\nUFO researcher Robert Hastings discussed declassified documents, as well as witness testimony that confirms UFO incursions at nuclear weapons sites, weapons laboratories, and bomb test sites. UFO activity accelerated after WWII, around the time that... \nHost: George Noory\nGuest(s): Robert Hastings, Michael Shedlock\n\nWednesday February 18th, 2009\nEarth Changes, Prophecy, &amp; Preparedness\nAuthors Stan Deyo and his wife Holly Drennan Deyo discussed earth changes, prophecy, social unrest, and what we can do to prepare for the coming upheaval. Stan noted that the sun's protective &quot;bubble&quot; has been shrinking, which makes Earth more susceptible... \nHost: George Noory\nGuest(s): Stan Deyo, Holly Drennan Deyo, Michael Farris\n\nThursday February 19th, 2009\n11:11 and Synchronicities\nAppearing during the middle two hours, authors Marie D. Jones and Larry Flaxman discussed the phenomenon of frequently seeing 11:11 on clocks, and the synchronicities of numbers. For instance, sometimes when people wake up and look at the clock, it's... \nHost: George Noory\nGuest(s): Marie D. Jones, Larry Flaxman, James McCanney\n\nFriday February 20th, 2009\nEconomic Downturn\nArt Bell was joined by Wall St. insider Michael J. Panzner, who discussed the dire economic circumstances in America and around the globe. According to Panzner, the U.S. is not in a typical recession. Instead, he believes the crisis more closely resembles... \nHost: Art Bell\nGuest(s): Michael J. Panzner","torrent":{"xt":"urn:btih:58114cc522fa06dd3afce7b33aea136697a6f687","amp;dn":"Coast+to+Coast+Radio+Program%21+Commercial+Free%21+Feb+13th+thru+Feb","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"58114cc522fa06dd3afce7b33aea136697a6f687","infoHashBuffer":{"type":"Buffer","data":[88,17,76,197,34,250,6,221,58,252,231,179,58,234,19,102,151,166,246,135]},"announce":[],"urlList":[]}}