{"title":"Army Flight Aptitude Sample Test","uid":4847630,"size":78801644,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:5a0f92467f5835a95b02ae76d7e02a408c0345a2&amp;dn=Army+Flight+Aptitude+Sample+Test&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":null,"files":42,"time":1239744507,"description":"i scanned and uploaded this as a torrent so that prospective Army Aviators could see what's in store for them with the AFAST. Also I think it would be useful to have a printable version of the answer sheet, print out about 30 of those and one of everything else. Keep in mind that you will be taking a different version of the test so you WILL need to do other studying even if you ace this every time. This will help you get a feel for the format of the test and most importantly help you finish sections in the time allotted. Some of the sections are just practice, practice, practice. I highly recommend buying the ARCO Military Flight Aptitude Tests book as it will go into more detail and provide suggestions on how to study for the test. Also i found the ASA Helicopter Fundamentals Virtual Test Prep DVD to be EXTREMELY helpful, given it's not made for the AFAST or any Military test and as such there are some details pertaining to civilian flight that you won't need to know, but it covers pretty much everything you'll find in the helicopter knowledge section in detail. Good Luck and I hope that this helps someone out!","torrent":{"xt":"urn:btih:5a0f92467f5835a95b02ae76d7e02a408c0345a2","amp;dn":"Army+Flight+Aptitude+Sample+Test","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5a0f92467f5835a95b02ae76d7e02a408c0345a2","infoHashBuffer":{"type":"Buffer","data":[90,15,146,70,127,88,53,169,91,2,174,118,215,224,42,64,140,3,69,162]},"announce":[],"urlList":[]}}