{"title":"Love The Way You Lie - Eminem feat. Rihanna (HD 1080p) [mildpois","uid":5785362,"size":354547411,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:5a4a132c04141aa31eb61f0763ad69626e88e228&amp;dn=Love+The+Way+You+Lie+-+Eminem+feat.+Rihanna+%28HD+1080p%29+%5Bmildpois&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"mildpoison","files":3,"time":1282593152,"description":"                  \tLove The Way You Lie - Eminem feat. Rihanna\n\n\n\n\nAbout the Artist\n\nMarshall Bruce Mathers III (born October 17, 1972), better known by his stage name Eminem (often styled &quot;EMINÃ†Å½M&quot;), is an American rapper, record producer, and actor. Eminem quickly gained popularity in 1999 with his major-label debut album, The Slim Shady LP, which won a Grammy Award for Best Rap Album. The following album, The Marshall Mathers LP, became the fastest-selling solo album in United States history. It brought Eminem increased popularity, including his own record label, Shady Records, and brought his group project, D12, to mainstream recognition.\nThe Marshall Mathers LP and his third album, The Eminem Show, also won Grammy Awards, making Eminem the first artist to win Best Rap Album for three consecutive LPs. He then won the award again in 2010 for his album Relapse, giving him a total of 11 Grammys in his career. In 2002, he won the Academy Award for Best Original Song for &quot;Lose Yourself&quot; from the film, 8 Mile, in which he also played the lead. &quot;Lose Yourself&quot; would go on to become the longest running No. 1 hip-hop single. Eminem then went on hiatus after touring in 2005. He released his first album since 2004's Encore, titled Relapse, on May 15, 2009. Eminem is the best-selling artist of the decade on the US Nielsen SoundScan, and has sold more than 80 million albums worldwide to date, making him one of the best-selling music artists in the world. In 2010, Eminem released his seventh studio album Recovery. It became Eminem's sixth consecutive number-one album in the US and achieved international commercial success, charting at number one in several other countries. It stayed at number-one on the US Billboard 200 chart for five consecutive weeks.\n\n\nDescription\n\n&quot;Love the Way You Lie&quot; is a song by American rapper Eminem, released as the second single from his seventh studio album, Recovery. The song features vocals from Barbadian singer Rihanna and is produced by Alex da Kid. Additional vocal production on Rihanna's vocals were provided by Makeba Riddick. The song gave Eminem his fourth US Hot 100 number-one hit and Rihanna her seventh. It also claimed the top spot on eight other charts. &quot;Love the Way You Lie&quot; has currently been number one on the US Billboard Hot 100 for five consecutive weeks.\nThe song won its first music award at the Teen Choice Awards 2010, in the Best Rap/Hip-Hop Track category.\n\nJoseph Kahn directed the video, shooting for which began on July 20, 2010. On July 22, 2010, photos of the video were released showing Rihanna performing in front of a burning house. Photos were also released of Megan Fox and Dominic Monaghan playing a couple in the video. Scenes included the celebrities on top of a liquor store. Fox and Monaghan also filmed inside the store and &quot;at a seedy dive bar next door&quot; to the store. On July 24, 2010, Kahn updated his Twitter page announcing that the video would premiere in &quot;a week&quot;\n\nPlot\n\n\nThe video depicts a couple in an abusive relationship (portrayed by actors Dominic Monaghan and Megan Fox. The couple repeatedly fight, break things, steal, and make up again, with scenes flashing back to happier times in their relationship. At the end of the video, both Fox and Monaghan's characters are engulfed by the flames. Monaghan was cast in the video first, and suggested Fox for the role of the girlfriend. He also wrote or improvised many of his scenes with Fox, most notably the shots of them kissing. Shots of Rihanna in front of a house that bursts into flames are featured while she sings the chorus, with Eminem rapping his verses in a desolate field, as well as joining Rihanna in front of the burning house towards the end of the video. The video became an online phenomenon, gaining 6.6 million hits in its first 24 hours on VEVO, and 18 million views in five days. It broke arecord for having the most views in 24 hours. It has been viewed over 57 million times on\n\n\nLyrics\n\n[Chorus - Rihanna:]\nJust gonna stand there and watch me burn\nBut that's alright because I like the way it hurts\nJust gonna stand there and hear me cry\nBut that's alright because I love the way you lie\nI love the way you lie\n\n[Eminem]\nI can't tell you what it really is\nI can only tell you what it feels like\nAnd right now it's a steel knife in my windpipe\nI can't breathe but I still fight while I can fight\nAs long as the wrong feels right it's like I'm in flight\nHigh off of love, drunk from my hate,\nIt's like I'm huffing paint and I love it the more I suffer, I suffocate\nAnd right before I'm about to drown, she resuscitates me\nShe fucking hates me and I love it.\nWait! Where you going?\n&quot;I'm leaving you&quot;\nNo you ain't. Come back we're running right back.\nHere we go again\nIt's so insane cause when it's going good, it's going great\nI'm Superman with the wind at his back, she's Lois Lane\nBut when it's bad it's awful, I feel so ashamed I snapped\nWho's that dude? I don't even know his name\nI laid hands on her, I'll never stoop so low again\nI guess I don't know my own strength\n\n[Chorus - Rihanna:]\nJust gonna stand there and watch me burn\nBut that's alright because I like the way it hurts\nJust gonna stand there and hear me cry\nBut that's alright because I love the way you lie\nI love the way you lie\nI love the way you lie\n\n[Eminem]\nYou ever love somebody so much you can barely breathe\nWhen you're with 'em\nYou meet and neither one of you even know what hit 'em\nGot that warm fuzzy feeling\nYeah, them those chills you used to get 'em\nNow you're getting fucking sick of looking at 'em\nYou swore you'd never hit 'em; never do nothing to hurt 'em\nNow you're in each other's face spewing venom in your words when you spit them\nYou push pull each other's hair, scratch claw hit 'em\nThrow 'em down pin 'em\nSo lost in the moments when you're in them\nIt's the rage that took over it controls you both\nSo they say you're best to go your separate ways\nGuess if they don't know you 'cause today that was yesterday\nYesterday is over, it's a different day\nSound like broken records playing over but you promised her\nNext time you show restraint\nYou don't get another chance\nLife is no Nintendo game\nBut you lied again\nNow you get to watch her leave out the window\nGuess that's why they call it window pane\n\n[Chorus - Rihanna:]\nJust gonna stand there and watch me burn\nBut that's alright because I like the way it hurts\nJust gonna stand there and hear me cry\nBut that's alright because I love the way you lie\nI love the way you lie\nI love the way you lie\n\n[Eminem]\nNow I know we said things, did things that we didn't mean\nAnd we fall back into the same patterns, same routine\nBut your temper's just as bad as mine is\nYou're the same as me\nBut when it comes to love you're just as blinded\nBaby, please come back\nIt wasn't you, baby it was me\nMaybe our relationship isn't as crazy as it seems\nMaybe that's what happens when a tornado meets a volcano\nAll I know is I love you too much to walk away though\nCome inside, pick up your bags off the sidewalk\nDon't you hear sincerity in my voice when I talk\nI told you this is my fault\nLook me in the eyeball\nNext time I'm pissed, I'll aim my fist at the drywall\nNext time. There won't be no next time\nI apologize even though I know its lies\nI'm tired of the games I just want her back\nI know I'm a liar\nIf she ever tries to fucking leave again\nIm'a tie her to the bed and set this house on fire\nI'm just gonna\n\n[Chorus - Rihanna:]\nJust gonna stand there and watch me burn\nBut that's alright because I like the way it hurts\nJust gonna stand there and hear me cry\nBut that's alright because I love the way you lie\nI love the way you lie\nI love the way you lie   \n\n\nDetails\n\nGeneral\nFormat                           : Matroska\nFile size                        : 338 MiB\nDuration                         : 4mn 26s\nOverall bit rate                 : 10.6 Mbps\n\nVideo\nFormat                           : AVC\nDuration                         : 4mn 26s\nBit rate                         : 9,968 Kbps\nWidth                            : 1,920 pixels\nHeight                           : 1,080 pixels\nDisplay aspect ratio             : 16:9\nFrame rate mode                  : Constant\nFrame rate                       : 29.970 fps\nStream size                      : 317 MiB (94%)\n\nAudio\nFormat                           : AC-3\nDuration                         : 4mn 26s\nBit rate mode                    : Constant\nBit rate                         : 448 Kbps\nChannel(s)                       : 2 channels\nChannel positions                : Front: L R\nSampling rate                    : 48.0 KHz\nBit depth                        : 16 bits\nStream size                      : 14.3 MiB (4%)","torrent":{"xt":"urn:btih:5a4a132c04141aa31eb61f0763ad69626e88e228","amp;dn":"Love+The+Way+You+Lie+-+Eminem+feat.+Rihanna+%28HD+1080p%29+%5Bmildpois","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5a4a132c04141aa31eb61f0763ad69626e88e228","infoHashBuffer":{"type":"Buffer","data":[90,74,19,44,4,20,26,163,30,182,31,7,99,173,105,98,110,136,226,40]},"announce":[],"urlList":[]}}