{"title":"XYplorer 9.90.1000 Portable [ak]","uid":6417170,"size":3300474,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:5ab13392fade985b31cb62846e8e8bbc5a7ec21a&amp;dn=XYplorer+9.90.1000+Portable+%5Bak%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Anacondaz","files":-1,"time":1306210792,"description":"XYplorer 9.90.1000 Portable\n\nXYplorer is an Advanced File System Explorer targeting everybody who is looking for a real alternative to the Windows Explorer. It has the following features: Created Date, Last Accessed Date and Attributes are shown right in the file list. Extended file find supporting NT-only features, and including binary string search. Multiple location search (find files in all selected directories). Generates various sorts of file system reports (to clipboard, file, and printer -- we're talking about one-click directory print-outs here).\n\nExport extended file informations of whole directories (or even directory trees) to CSV-formatted files. [new in 3.21] Column Width Auto-Adjustment. Highly customizable display formats for file size and date information. For each file and folder, the (real!) disk space used is immediately displayed. Remembers last folder location and sort order. Browser-like history functionality. Can define favorite folders. A large suite of useful commands added to the standard file context menu, including Copy To, Move To, Copy Filename with Path, Copy File Properties, Copy Large/Small Icon, Multi-file Rename. Icon-extraction, multi-file time-stamping and attribute-stamping. Instant display of complete file/version information for each selected file. Instant preview of image, audio, and video files (displaying detailed media information). Instant file content view for all files (ASCII and binary), including text extraction from binaries (BTW: the fastest on the market). Full support for drag'n'drop and wheel mouse. Made to handle heavy-duty jobs. Easy to install, and easy to remove. Installing and running the program does not change your system or registry. Easy to use, start working in no time (interface closely follows Explorer standards). Small, fast, and RAM-friendly.\n\nFeatures:\n- Tabbed Browsing: have an unlimited number of tabs to make jumping around between folders a one-click affair. Rename the tabs, shift them around, hide them, drag-drop stuff onto the tab headers... the tabs remember their configuration individually and between sessions. You often search your system for files added in the last 24 hours? Let a &quot;finding tab&quot; do the job at a single click!\n- High end find files engine with tremendous power and amazing speed. Find files fully supports Boolean logic (up to 256 nesting levels), advanced pattern matching, Regular Expressions, whole word and fuzzy matching, binary string search, multiple location search (find files in all selected directories) and much more...\n- Instant preview of image (incl. PNG, JPEG, GIF, TIFF, ICO and many more), audio, and video files (displaying detailed media information).\n- Thumbnails of image files shown right in the file list, introducing the unique &quot;Mouse Down Blow Up&quot; functionality.\n- Instant preview of installed and uninstalled TrueType and Type-1 font files (displaying detailed font information).\n- Instant preview of HTML, MHT, PHP files (including configurable server mappings) with printing option.\n- Instant display of complete file/version information for each selected file.\n- Various revolutionary highlighting features add more visual grip to tree and list. Highlight Folder, Boxed Branch, Favorite Folder Bold, Highlight Focused Row, Highlight Sorted Column, ... all colors are fully customizable. And then there's a wildcard-configurable Color Filter for list items.\n- You have a Visual Filter for the file list. Control what you see by stating simple wildcard patterns like *.txt. The Visual Filter is per-tab and, as virtually all XYplorer settings, saved between sessions.\n- File Info Tips and MP3 Info Tips: extensive file information (depending on file type and individual file up to 35 fields!) pops up when you move the mouse over a file's icon.\n- Special MP3 service: instant ID3v1.1-tag view and edit, plus automatic filename to ID3v1.1-tag routine.\n- Instant file view (ASCII and HEX) for all files, including text extraction from binaries (BTW: the fastest on the market).\n- Generates various sorts of file system reports (to clipboard, file, and printer -- we're talking about one-click directory print-outs here).\n- Export extended file informations of whole directories (or even directory trees) to CSV-formatted files.\n- Created Date, Last Accessed Date and Attributes are shown right in the file list. Optionally in the revolutionary Age format, - which immediately tells you how old a file is (as opposed to when it was born).\n- Column Width Auto-Adjustment.\n- Highly customizable display formats for file size and date information.\n- For each file and folder, the (real!) disk space used is immediately displayed.\n- Remembers last folder location, sort order, scroll position, and selected file.\n- Browser-like history functionality.\n- Can define favorite folders.\n- A large suite of useful commands added to the standard file context menu, including Copy To, Move To, Copy Filename with - Path, Copy File Properties, Copy Large/Small Icon, Multi-file Rename (optionally using Regular Expressions).\n- Icon-extraction, multi-file time-stamping and attribute-stamping.\n- Full support for drag'n'drop and wheel mouse.\n- Made to handle heavy-duty jobs.\n- Installing (1.7 MB total) and running the program does not change your system or registry. In other words: XYplorer is 100% portable. Ideal for your USB memory stick.\n- Easy to use, start working in no time (interface closely follows Explorer standards).\n- Small, fast, and RAM-friendly.\n- Quick 24/7 support.\n\nHome Page - http://www.xyplorer.com\n\n","torrent":{"xt":"urn:btih:5ab13392fade985b31cb62846e8e8bbc5a7ec21a","amp;dn":"XYplorer+9.90.1000+Portable+%5Bak%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5ab13392fade985b31cb62846e8e8bbc5a7ec21a","infoHashBuffer":{"type":"Buffer","data":[90,177,51,146,250,222,152,91,49,203,98,132,110,142,139,188,90,126,194,26]},"announce":[],"urlList":[]}}