{"title":"Another Dimension to the Black Diaspora: Diet, Disease and Racis","uid":8762383,"size":9363942,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:5abd6c4e19381d7ef7a01c5ec829c600b2b3502c&amp;dn=Another+Dimension+to+the+Black+Diaspora%3A+Diet%2C+Disease+and+Racis&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"blackatk","files":-1,"time":1375267898,"description":"\nPublication Date: October 30, 2003 | ISBN-10: 052152850X | ISBN-13: 978-0521528504 | With A special thanks to &quot;wetworx12&quot; - The bitter, race-baiting troll who inspired this upload | filetype: pdf |\n\n\nThis is an engrossing study of black disease immunities and susceptibilities and their impact on both slavery and racism. Its pages interweave the nutritional, biological, and medical sciences with demography. The book begins with an examination of the pre-slavery era in Africa and then pursues its subject into the slave societies of the West Indies and the United States. This truly interdisciplinary approach permits the blending of two distinctive concepts of racial differences, that of the hard sciences based on gene frequencies and that of the social sciences stressing environmental factors. The authors investigate black health and white medical practice in the United States during the antebellum period, and establish a link between black-related diseases and white racism. A final section traces major black disease susceptibilities from the Civil War to the present, arguing that the different nutritional and medical needs of blacks are still largely unappreciated or ignored.\n\n\n\nReview\n..&quot;.meets the needs of a wide range of users. It is accessible to the layperson who will be fascinated by its information. Students will find the book valuable for term papers, while medical professionals will appreciate the research data available in the text.&quot; American Libraries\nBook Description\nThis is an engrossing study of black disease immunities and susceptibilities and their impact on both slavery and racism. Its pages interweave the nutritional, biological and medical sciences with demography. \n\n\nPaperback: 316 pages\nPublisher: Cambridge University Press (October 30, 2003)\nLanguage: English\nISBN-10: 052152850X\nISBN-13: 978-0521528504\n\n\n &lt;a href=&quot;\nhttp://www.amazon.com/Another-Dimension-Black-Diaspora-Disease/dp/052152850X/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.amazon.com/Another-Dimension-Black-Diaspora-Disease/dp/052152850X/&lt;/a&gt;\n\n\n\n\nTags: race, racism, slavery, servitude, indentured servitude, bondage, diet, health, african, afro-american, african-american, AA, african american studies, health, medicine, medical , diaspora, disease, predisposition, predisposed, sick, wealth, education, institutional racism, ","torrent":{"xt":"urn:btih:5abd6c4e19381d7ef7a01c5ec829c600b2b3502c","amp;dn":"Another+Dimension+to+the+Black+Diaspora%3A+Diet%2C+Disease+and+Racis","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5abd6c4e19381d7ef7a01c5ec829c600b2b3502c","infoHashBuffer":{"type":"Buffer","data":[90,189,108,78,25,56,29,126,247,160,28,94,200,41,198,0,178,179,80,44]},"announce":[],"urlList":[]}}