{"title":"Koko ni irukoto (Japan movie, 2001)","uid":3549711,"size":625326080,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:5d225980db1a8f78dde7f5d9bb6843100a499283&amp;dn=Koko+ni+irukoto+%28Japan+movie%2C+2001%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Pemu","files":1,"time":1162415692,"description":"The movie marks the first starring role for actress Hitomi Manaka. Inspired upon an essay by Hazuki Saisho, it tells the story of the friendship between her and her former co-worker. Set in Osaka. Directed by Masahiko Nagasawa, a multi talented filmmaker known who produced the hit movie &quot;Love Letter&quot; and who wrote the screenplay for the movie &quot;Hatsukoi.&quot; The title theme song &quot;Kokoniirukoto&quot; is the first song ever penned by Shikao Suga (lyrics) and it happened when he was 23 years old.\n\nAiba Shino (Hitomi Manaka) is an upwardly mobile career girl whose life takes an unexpected turn in Koko ni iru koto, a subtly touching comedy-drama about the art of &quot;being there.&quot; Employed in the marketing division of a Tokyo sales company, Aiba gets unceremoniously transferred to the less prestigious Osaka office after her affair with an elite manager is discovered by the wife. But the transfer is more than just a location change. Aiba is demoted from creative marketing to straight sales, and she decides that the new office is decidedly unsophisticated and ill-fitting for a girl like her. Enter Maeno Etsuro (Sakai Masato), a quirky, off-kilter transferee who entreats Aiba to stay with the company and give it a go. Maeno begins to take Aiba on his wacky trips through the back alleys of Osaka, where he shares his unique and oddball hobbies with the initially uninterested Aiba. And along the way, Aiba learns something precious, though it may not be what she expected to learn! Directed by Masahiko Nagasaw (Thirteen Steps), Koko ni iru koto is a film about finding joy, satisfaction, and even beauty in the unlikely, unusual, and everyday.\n\nMy thoughts: Fancy an art film for a change? I found this film too artistic as I&amp;#039;ve had trauma with art films in the past. I can&amp;#039;t remember much from the film as I saw it first in mid 2002. The outcome wasn&amp;#039;t that positive, the only thing I remember from the film is the rather big mole in Hitomi\nManaka&amp;#039;s jaw, hehe. Why upload this film even If I don&amp;#039;t like it? I have no idea, just posting it for fun, hehe. To watch or not, if you&amp;#039;re a die hard art films fan, give it a try. I&amp;#039;m not fond of the genre however there are some exceptions with the likes of Ozu, Mizoguchi, Iwai, Kitano etc.\n\nYou may be wondering what&amp;#039;s with the recent japanese movie postings one after another. I just wanted to share em before I remove them from the HD, running low on HD space. I&amp;#039;ll take a little break from posting after 9-10th movie smile.gif Not that I&amp;#039;m disappearing, hehe.","torrent":{"xt":"urn:btih:5d225980db1a8f78dde7f5d9bb6843100a499283","amp;dn":"Koko+ni+irukoto+%28Japan+movie%2C+2001%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5d225980db1a8f78dde7f5d9bb6843100a499283","infoHashBuffer":{"type":"Buffer","data":[93,34,89,128,219,26,143,120,221,231,245,217,187,104,67,16,10,73,146,131]},"announce":[],"urlList":[]}}