{"title":"[PSP-Movie] 911 Mysteries (2006) **MUST-SEE**","uid":3674386,"size":362640949,"categoryP":"video","categoryS":"handheld","magnet":"?xt=urn:btih:5efaa251b54753a5fb0e37ce286c0bc0220748b4&amp;dn=%5BPSP-Movie%5D+911+Mysteries+%282006%29+%2A%2AMUST-SEE%2A%2A&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Dark-Alex","files":1,"time":1177682318,"description":"WORKS ON ALL PSP! No custom firmware required.\n----------------------------------------------\n\nAbout the video:\n----------------\n\n90 minutes of demolition evidence and analysis, laced with staggering witness testimonials. Careful deconstruction of the Official Story, set right alongside clean, clear science.\n\n911 Mysteries is a very good and interesting documentary about \nthe events that took place in New York City, on September 11th, 2001.\n\nIt talks about things that almost no other documentary has ever talked about.\nYou will see and hear things that you have never seen or heard on TV.\n\nIt raises a lot of questions that you have probably never thought of before.\n \nFor example, the documentary goes in-depth about the physics of the collapse of the towers, and also talks about WTC7, which has always been more or less ignored by the news-media.\n\nFirefighters, survivors, New-Yorkers, and the people who worked inside the \ntowers tell the previously untold story of what they saw and heard on that day.\n\nJust some of the questions that are raised and looked at in detail are: \n\n- Why no large steel building has ever collapsed due to a fire.\n- How you get a 110-story pancake collapse in 10 seconds or less.\n- Why Building 7 (WTC7) suddenly imploded, although it was not hit by a plane.\n- How hot an uncontrolled open air, kersosene-fuelled fire actually gets.\n- Why people inside the towers heard explosions everywhere, including the basement. \n- How and why the nearly-indestructible core of both towers simply vanished.\n- How the towers could disintegrate into fine dust in just 10 seconds.\n- Why New-Yorkers who live near Ground Zero have now developed lung cancer.\n\nThe documentary compares real science and witness testimonials of people who actually were there, against the Official Story that 19 cavemen somehow defied the laws of physics.\n\nThe documentary compares real collapsed buildings with buildings \ndestroyed by demolition explosives and looks and the differences.\n\nAnd much, much more...\n----------------------\n\n\nInstructions:\n-------------\n\nPut both the .MP4 and the .THM files in MP_ROOT100 -&gt; ANV01 on your memory stick.\n\n&quot;MAQ14275.MP4&quot; is the video (911 Mysteries).\n&quot;MAQ14275.THM&quot; is the thumbnail.\n--------------------------------\n\n(if the MP_ROOT100 ANV01 folders doesnt exist, just create them!)\t\t\t\t\t\t\t\t\t\t\t\t \t\t\t\t\t\t\t","torrent":{"xt":"urn:btih:5efaa251b54753a5fb0e37ce286c0bc0220748b4","amp;dn":"%5BPSP-Movie%5D+911+Mysteries+%282006%29+%2A%2AMUST-SEE%2A%2A","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5efaa251b54753a5fb0e37ce286c0bc0220748b4","infoHashBuffer":{"type":"Buffer","data":[94,250,162,81,181,71,83,165,251,14,55,206,40,108,11,192,34,7,72,180]},"announce":[],"urlList":[]}}