{"title":"Anal Buffet - 3 cds (2008,DVD.xvid) - Bobbi Star, Carmella Bing,","uid":4727314,"size":2202885844,"categoryP":"porn","categoryS":"other","magnet":"?xt=urn:btih:5f18577f0ee34e694f8a57991d232ff83229f6d7&amp;dn=Anal+Buffet+-+3+cds+%282008%2CDVD.xvid%29+-+Bobbi+Star%2C+Carmella+Bing%2C&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"19__teen","files":13,"time":1234817741,"description":"Anal Buffet (2008)\n\n\n\n\n\nscreens CD1 &amp; CD2 &amp; CD3 + DVD-covers:\n &lt;a href=&quot;\nhttp://pixxtpb.blogbugs.org/4412835/Anal-Buffet---screens-CD1-CD2-CD3.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://pixxtpb.blogbugs.org/4412835/Anal-Buffet---screens-CD1-CD2-CD3.html&lt;/a&gt;\n\n\n\n\n\nIndividual &amp; detailed screens:\n\n\nScene 1: \n &lt;a href=&quot;\nhttp://pixxtpb.blogbugs.org/4412728/Anal-Buffet---scene-1.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://pixxtpb.blogbugs.org/4412728/Anal-Buffet---scene-1.html&lt;/a&gt;\n\nGorgeous brunette supermodel Bobbi Starr kicks things off by choosing from a generous sampling of dildos and buttplugs; she licks them, sucks them and lovingly crams them up her delicious asshole for us. Then she slowly pushes them out for the camera. Soon, tanned Euroslut Loona Luxx joins in. Butthole worship, de rigueur for Jay's films, ensues, with much ass-licking. Mick Blue enters the scene, intervening on our behalf to spread these girls' asscheeks and fuck their buttholes. He acquits himself admirably, and then jacks a load into their mouths. Some girl/girl snowballing tops things off. This marathon scene has it all! \n\n\nScene 2:\n &lt;a href=&quot;\nhttp://pixxtpb.blogbugs.org/4412734/Anal-Buffet---scene-2.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://pixxtpb.blogbugs.org/4412734/Anal-Buffet---scene-2.html&lt;/a&gt;\n \nCute beach bunnies Chelsie Rae and Lexi Love are playing on the sand. Chelsie looks especially great as a brunette. They laugh, chase each other and toss an over-sized beach ball back and forth before they stumble into the beachside brush and Mark Wood reclining on a towel. Soon his erect cock is in their sweet young mouths. Lexi and Chelsie quickly remove their bathing suits and into their birthday suits, and the lucky guy is treated to an outdoor party of cowgirl-style riding, anal fucking, A2M and squirting. Finally, Lexi gets it doggiestyle in the sand, and Mark shoots a load on her ass for Chelsie to gobble up. \n\n\nScene 3: \n &lt;a href=&quot;\nhttp://pixxtpb.blogbugs.org/4412735/Anal-Buffet---scene-3.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://pixxtpb.blogbugs.org/4412735/Anal-Buffet---scene-3.html&lt;/a&gt;\n\nCriss Strokes is being held in jail. He sits in a whited-out room awaiting an interrogation. Fortunately for him, a horny pair of cops enter the room, in the form of hot blonde Tricia Oaks and big-titted Carmella Bing. The tension mounts as Criss is uncooperative and is placed in a cell for further questioning. In an unconventional effort to usurp information, the girls begin sucking his dick. The young policewomen play around with each other; buttholes are licked and sucked, and dildos and vibrators inserted. Criss buttfucks both officers, and comes on Carmella's belly. \n\n\nScene 4: \n &lt;a href=&quot;\nhttp://pixxtpb.blogbugs.org/4412736/Anal-Buffet---scene-4.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://pixxtpb.blogbugs.org/4412736/Anal-Buffet---scene-4.html&lt;/a&gt;\n\nNasty, cat-eyed blonde Harmony meets a trio of tumescent gentlemen for a sloppy blowbang that includes plenty of anal fucking, fingering, spitting and A2M. This beautiful bitch works the room with her mouth, hands and asshole until all the men shoot their gooey loads on her face. \n\n\nScene 5: \n &lt;a href=&quot;\nhttp://pixxtpb.blogbugs.org/4412737/Anal-Buffet---scene-5.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://pixxtpb.blogbugs.org/4412737/Anal-Buffet---scene-5.html&lt;/a&gt;\n\n\nAaliyah Jolie is a skinny, sexy, small-breasted whore, and Annette Schwarz is the infamously perverted, intense young blond German goo girl. They enjoy a buffet of each other's ass in typical Jay Sin style; the girls savor each others sphincters by deeply inserting their tongues and using them like rigid dicks to fuck the holes. Well-hung black dude Jon Jon shows up and fucks both these trashy white whores. He finishes off the festivities by jetting his cum into their faces. SUMMARY: Jay Sin's anus-obsessed movies are renowned for their focus on sensual girl/girl rimming and unbelievably hot chicks doing impossible tricks with their stretchable rectums, often shot against stark white backgrounds which offset the bold, vivid, colorful wardrobes and sexy styling of his talented models. Anal Buffet continues this tradition, with the addition of plenty of fat cocks inserted deep into assholes and lots of nasty ass-to-mouth action. This 2-disc set has a 43-minute bonus scene (with maid Annette Schwarz getting thoroughly used by Adrianna Nicole and Ben English, the lady and lord of the manor), six photo galleries, and 52 minutes of behind-the-scenes footage, outtakes, interviews and bloopers... plus Jay Sin trailers.\n\n\n \n \n \nStarring:\n \nBobbi Starr, Loona Luxx, Chelsie Rae, Lexi Love, Carmella Bing, Aaliyah Jolie, Harmony, Annette Schwarz, Tricia Oaks\n\n\nMale cast:\nMick Blue, Criss Strokes, Mark Wood, Chris Charming, Marco Banderas, Jon Jon, Ben English \n\n\n\n\nCategory: Anal      \nStudio: Evil Angel  \nRelease Date: Dec 10, 2008\nLanguage:  English\n\n\n\n\n\n.","torrent":{"xt":"urn:btih:5f18577f0ee34e694f8a57991d232ff83229f6d7","amp;dn":"Anal+Buffet+-+3+cds+%282008%2CDVD.xvid%29+-+Bobbi+Star%2C+Carmella+Bing%2C","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5f18577f0ee34e694f8a57991d232ff83229f6d7","infoHashBuffer":{"type":"Buffer","data":[95,24,87,127,14,227,78,105,79,138,87,153,29,35,47,248,50,41,246,215]},"announce":[],"urlList":[]}}