{"title":"Voyage to the Bottom of the Sea S04V02 Special Edition DVD4 NTSC","uid":5235729,"size":4117364783,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:5f605e6cf2e8eb6dbd5c70abf4da1f008bec6782&amp;dn=Voyage+to+the+Bottom+of+the+Sea+S04V02+Special+Edition+DVD4+NTSC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"TheTooleMan","files":-1,"time":1261521668,"description":"VOYAGE TO THE BOTTOM OF THE SEA\nSPECIAL EDITION\nSEASON 4 VOLUME 2 DVD 4\n\n\nWe've all waited impatiently while a certain video company, stuck in the last century, put off the release of the final season of Voyage, and we've waited some more for the second half of season four.\n\nWell... THE WAITING IS OVER!\n\nThe Seaview first sailed across American TV screens on September 14, 1964.\nNow, 45 years later, TooleMan TV presents the final 13 episodes of Voyage to the Bottom of the Sea.\nAll episodes have been remastered from excellent broadcast recordings for the best video and audio.\nThese are FULL RESOLUTION NTSC DVD's.\n\nIncluded:\n\n- all 13 full-length episodes of the second half of season four\n- ABC-TV's &quot;In Color&quot; opener before each episode\n- uncut season four opening theme including &quot;brought to you by...&quot;\n- previews of the next episode, where available\n\n\n\nDVD 4 contains two episodes that are more relevant today than ever: aliens threaten the Earth by creating cataclysmic climate change!\n\nFirst, aliens bent on changing Earth's atmosphere create a greenhouse aboard the Seaview in...\n\n\nEpisode 21: SAVAGE JUNGLE (Airdate: February 25, 1968)\n\n\n\n&quot;Savage Jungle&quot; includes previews for the next episode, &quot;Flaming Ice!&quot;\n\nThen it's a WHITE CHRISTMAS on the Seaview as aliens threaten to melt the polar cap in...\n\nEpisode 22: FLAMING ICE (Airdate: March 3, 1968)\n\n\n\n\nAnd if you think you're watching Star Trek during &quot;Flaming Ice,&quot; it could be because its music was composed by none other than\nAlexander Courage,\nwho wrote the theme for Star Trek as well as music heard in several episodes!\n\nRemember... TooleMan TV is TheTooleMan's labor of love. If you love Voyage like TheTooleMan, be sure to post a comment when you download these rare and special DVD's.\n\nHelp keep them seeded for others to enjoy.\n\nAnd don't even think about selling them, EVER!","torrent":{"xt":"urn:btih:5f605e6cf2e8eb6dbd5c70abf4da1f008bec6782","amp;dn":"Voyage+to+the+Bottom+of+the+Sea+S04V02+Special+Edition+DVD4+NTSC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5f605e6cf2e8eb6dbd5c70abf4da1f008bec6782","infoHashBuffer":{"type":"Buffer","data":[95,96,94,108,242,232,235,109,189,92,112,171,244,218,31,0,139,236,103,130]},"announce":[],"urlList":[]}}