{"title":"Radiohead-13 album","uid":4915984,"size":1717225259,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:5f64dffae8fbc6c6df678d95b8b666ee4708446f&amp;dn=Radiohead-13+album&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"SecondOpinion","files":-1,"time":1243429377,"description":"((((((((((((((((((((((((   D..E..M..U..N..O..I..D   ))))))))))))))))))))))))\n\n\nI get all my releases from the above tracker follow the forwarded url to check out the latest zero day releases!!!!\n\n                          &lt;a href=&quot; http://www.btzip.com&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.btzip.com&lt;/a&gt;\n\n     [[[  another fine release by the D..E..M..U..N..O..I..D   Team   ]]]\n\n\n   .....................................INFO................................\n\n\nRadiohead are an English alternative rock band from Abingdon, Oxfordshire. The band is composed of Thom Yorke (lead vocals, rhythm guitar, piano, beats), Jonny Greenwood (lead guitar, keyboard, other instruments), Ed O'Brien (guitar, backing vocals), Colin Greenwood (bass guitar, synthesizers) and Phil Selway (drums, percussion).\nRadiohead released their first single, &quot;Creep&quot;, in 1992. The song was initially unsuccessful, but it became a worldwide hit several months after the release of their debut album, Pablo Honey (1993). Radiohead's popularity rose in the United Kingdom with the release of their second album, The Bends (1995). The band's textured guitar parts and Yorke's falsetto singing were warmly received by critics and fans. Radiohead's third album, OK Computer (1997), propelled them to greater international fame. Featuring an expansive sound and themes of modern alienation, OK Computer has often been acclaimed as a landmark record of the 1990s.\nKid A (2000) and Amnesiac (2001) marked an evolution in Radiohead's musical style, as the group incorporated experimental electronic music, Krautrock, post-punk and jazz influences. Although critical opinion was divided, Radiohead remained popular. Hail to the Thief (2003), a mix of guitar-driven rock, electronics and lyrics inspired by headlines, was the band's final album for their major record label, EMI. Radiohead independently released their seventh album, In Rainbows (2007), originally as a digital download for which each customer could set their own price, later in stores, to critical and chart success.\nRadiohead's work has appeared in a large number of listener polls and critics' lists. In 2005, Radiohead were ranked number 73 in Rolling Stone's list of &quot;the greatest artists of all time&quot;. While the band's later albums brought them a wide audience, their earlier sound on The Bends and OK Computer remained influential on British rock music.\n\n","torrent":{"xt":"urn:btih:5f64dffae8fbc6c6df678d95b8b666ee4708446f","amp;dn":"Radiohead-13+album","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5f64dffae8fbc6c6df678d95b8b666ee4708446f","infoHashBuffer":{"type":"Buffer","data":[95,100,223,250,232,251,198,198,223,103,141,149,184,182,102,238,71,8,68,111]},"announce":[],"urlList":[]}}