{"title":"Jean Luc Ponty - Fables TQMP","uid":4569871,"size":220084108,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:60bf9085f428aeb9800eed2c365aef09d8dda245&amp;dn=Jean+Luc+Ponty+-+Fables+TQMP&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"zootallure","files":13,"time":1229017654,"description":"Ponty is the son of a violin teacher, who began his instruction before he moved on to the Paris Conservatory. By the mid 1960s he had moved towards jazz, recording with StÃƒÂ©phane Grappelli and Stuff Smith. Ponty&amp;#039;s attraction to jazz was propelled by Miles Davis&amp;#039;s and John Coltrane&amp;#039;s music, which led him to adopt the electric violin. Critic Joachim Berendt wrote that &quot;Since Ponty, the jazz violin has been a different instrument&quot; and of his &quot;style of phrasing that corresponds to early and middle John Coltrane&quot; and his &quot;brilliance and fire&quot;.\n\nIn 1967, he visited the USA for the Monterey Jazz Festival. Ponty subsequently worked with StÃƒÂ©phane Grappelli, the Mahavishnu Orchestra, and Frank Zappa, and appeared on more than 70 recordings. His symphonic style to jazz fusion made him a popular fusion artist of the 1970s.\n\nIn 1972, he featured prominently on Elton John&amp;#039;s Honky Chateau album.\n\nIn 1977, he pioneered the use of the 5-string electric violin, with a lower C string. He sometimes also uses a 6-string electric violin called the Violectra, with low C and F strings (not to be confused with the violectra he played from the late 1960s to the mid-1980s which had 4 strings, but tuned an octave lower). Ponty was among the firsts to combine the violin with MIDI, distortion boxes, phase shifters, and wah-wah pedals. This resulted in his signature, almost synthesizer-like sound.\n\nIn 2005, Ponty formed the acoustic fusion supergroup Trio! with bassist Stanley Clarke and banjoist BÃƒÂ©la Fleck.\n\n\nBrought to you by TQMP. (The Quality Music Project)\n\nIn this project we, fellow pirates share only quality items out of our CD collections in lossless FLAC and include covers, especially for those who like to burn and print and put it in a nice and shiny jewelcase. Well, you all know the drill :)\n\nRipped by Exact Audio Copy V0.99 from 01-23-2008, encoded to FLAC with 1024kb/s\nGet Your Free Copy of the EAC and FLAC suite at: &lt;a href=&quot;\nhttp://www.exactaudiocopy.de/en/index.php/resources/download/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.exactaudiocopy.de/en/index.php/resources/download/&lt;/a&gt;\n\nPlease feel free to join the TQMP project!\nThe &quot;rules&quot; are simple: Rip your CD (no 1980&amp;#039;s cassettetapes or vinylrips please!) in lossless format AND include artwork. Include cue- and logfiles for the purists and the TQMP searchtag in your title, so it can easily be found. (Yes, on Google as well..)\n\nP.S. Say &quot;Thank you&quot; by seeding....just seed\n","torrent":{"xt":"urn:btih:60bf9085f428aeb9800eed2c365aef09d8dda245","amp;dn":"Jean+Luc+Ponty+-+Fables+TQMP","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"60bf9085f428aeb9800eed2c365aef09d8dda245","infoHashBuffer":{"type":"Buffer","data":[96,191,144,133,244,40,174,185,128,14,237,44,54,90,239,9,216,221,162,69]},"announce":[],"urlList":[]}}