{"title":"Johnny Soporno - Seductive Reasoning","uid":4343060,"size":3730395086,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:61029c2bf0b6a6dd4c54f8bca050eab969e74d6b&amp;dn=Johnny+Soporno+-+Seductive+Reasoning&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"loveany","files":61,"time":1218721961,"description":"Johnny Soporno has dedicated himself to battling cultural misogyny, and rekindling the Sexual Revolution. He does so through seminars and bootcamps all over the world. These videos contain his complete Seductive Reasoning 101 seminar, which he offers free to the world.\n\nSoporno was rated at 10th place on Thundercat&amp;#039;s list of the top 10 pick-up-artist of 2007 (http://www.thundercatseductionlair.com/2008/01/08/the-top-10-pick-up-artists-of-2007/), and Thundercat wrote:\n&quot;Johnny is also very soft-spoken and sweet.  A big contrast to how he looks.  But I can see why so many people are taken with him.  His philosophy on life and love and dating and seduction are incredible. (...) it seems like Johnny has the lifestyle and relationship aspects of his game down better than anyone else out there.&quot;\n\nI recently met Johnny when he held a seminar and bootcamp here in Trondheim, and I totally agree. The man is amazing! I asked him if I could convert his videos into different formats, and he had nothing against it - as long as i linked to http://seductivereasoning.com. \n\nThe original files were in WMV-format, but I&amp;#039;ve converted them into WMA, MP3 and AVI (With WinFF) for those who prefer those formats. The original WMV-files are included in this torrent too. If you want other formats, please leave a comment with your request.\n\nIf you don&amp;#039;t have a torrent-program that allow you to select only certain files to download (so you can download in your prefered format instead of all), get utorrent from www.utorrent.com. I think it&amp;#039;s possible with Azureus/Vuze on Mac too.\n\n\nTaking notes while watching this seminar is strongly recommended as many of the more-radical reframes might tend to overwhelm your memory at first. It is also highly advisable to re-watch the seminar in it&amp;#039;s entirety at least once to get the most out of it. \n\nOriginal videos (WMV-format) can be downloaded from http://seductivereasoning.com/\nPreviews at http://www.worthyplayboys.com/philosophy-video-clips.html\n\n\nDownload and seed like crazy - it&amp;#039;s legal!","torrent":{"xt":"urn:btih:61029c2bf0b6a6dd4c54f8bca050eab969e74d6b","amp;dn":"Johnny+Soporno+-+Seductive+Reasoning","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"61029c2bf0b6a6dd4c54f8bca050eab969e74d6b","infoHashBuffer":{"type":"Buffer","data":[97,2,156,43,240,182,166,221,76,84,248,188,160,80,234,185,105,231,77,107]},"announce":[],"urlList":[]}}