{"title":"De Avonturen van Emil deel 3 - 4 (1972)ned.gespr.NLT-Release","uid":4567568,"size":842197355,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:6294b5d92148da1d656c6a84ad931726c5a566f4&amp;dn=De+Avonturen+van+Emil+deel+3+-+4+%281972%29ned.gespr.NLT-Release&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"linday1","files":-1,"time":1228932209,"description":"Astrid Lindgren\n\nDeze heerlijke DVD-collectie biedt een royale greep uit het verfilmde werk van Astrid Lindgren (1907-2002). De wereldwijd zeer geliefde Zweedse schrijfster, haar boeken zijn vertaald in 85 talen en worden verkocht in ruim 100 landen was typisch iemand die verschillende generaties tegelijk wist te boeien. Hoewel haar boeken en verhalen eigenlijk gericht waren op kinderen, werden en worden ze ook verslonden door hun ouders. Het werk van Astrid Lindgren wordt vooral gekenmerkt door een rijke fantasie en een haarfijn gevoel voor wat kinderen interessant, grappig, spannend en verdrietig vinden. De verfilmingen in deze box doen stuk voor stuk recht aan het bijzondere gevoel dat Lindgren bij haar lezers wist op te roepen. Pure nostalgie voor de kinderen van toen, een fantastische ontdekking voor de jeugd van nu.\n\nDe avonturen van Emil de super bengel\n\nIn deze Zweedse jeugd-serie uit 1971 is Emil een kleine jongen die samen met zijn ouders en zusje Ida op een boerderij woont. Ze hebben ook een werkster Lina en een knecht Alfred. Emil zorgt voor allerlei problemen, die meer uit onhandigheid dan uit kattekwaad ontstaan. Hij is nu eenmaal nieuwsgierig naar hoe dingen werken en dan loopt het weleens mis. Hij is eigenlijk een goede jongen met een hart van goud, maar zijn humeurige vader denkt daar anders om en roept dan ook om de haverklap:?Eeee-miiiillll!! Zijn moeder schrijft alle voorvallen op in een schrift. Bijvoorbeeld als Emil een rat probeert te vangen met een val.\nIn een schuurtje heeft Emil wel 100 kleine houtpoppetjes gesneden. Hij verdient geld met het openhouden van de poort voor voorbijkomende wagens en koopt voorwerpen en limonade op de veilig. Zijn vader vindt het geld verspilling maar Emil verkoopt alles door en als vader een varken koopt dat niet voor haar biggetjes wil zorgen, redt Emil zo?n biggetje. De serie is een verfilming van de Emil-boeken van de wereldberoemde Astrid Lindgren. In de Nederlandse vertaling heet ie echter Michiel.\n\n\nDeze film is nederlands gesproken.\n\nmet dank aan Albertina \n\nDit is echt jeugdsentiment en het blijft leuk ook voor de kids van nu.\n\n\n\nVoor de nieuwste films en muziek ga je naar NLT.Ons-Forum het forum voor de Nederlands Ondertitelde torrents:\n\n &lt;a href=&quot;\nhttp://www.nlt.ons-forum.nl&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.nlt.ons-forum.nl&lt;/a&gt;\n\n\nEnjoy The Movie!!!!","torrent":{"xt":"urn:btih:6294b5d92148da1d656c6a84ad931726c5a566f4","amp;dn":"De+Avonturen+van+Emil+deel+3+-+4+%281972%29ned.gespr.NLT-Release","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6294b5d92148da1d656c6a84ad931726c5a566f4","infoHashBuffer":{"type":"Buffer","data":[98,148,181,217,33,72,218,29,101,108,106,132,173,147,23,38,197,165,102,244]},"announce":[],"urlList":[]}}