{"title":"Victory At Sea 13of26 Melanesian Nightmare VHSRip 720p Egilman","uid":11160337,"size":660524821,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:629fe2c972587a7d24f636ce7e2f5fa2ed0f8ef8&amp;dn=Victory+At+Sea+13of26+Melanesian+Nightmare+VHSRip+720p+Egilman&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Egilman","files":-1,"time":1412521111,"description":"Victory at Sea, a 26-episode series on World War II, premiered on the last Sunday of October 1952, and subsequent episodes played each Sunday afternoon (with two exceptions) through May 1953. Each half-hour installment dealt with some aspect of World War II naval warfare and highlighted each of the sea war's major campaigns: the Battle of the North Atlantic, the attack on Pearl Harbor, the Battle of Midway, antisubmarine patrol in the South Atlantic, the Leyte Gulf campaign, etc. Each episode was composed of archival footage originally accumulated by the U.S., British, Japanese or German navies. The footage was originally shot mostly in color but was carefully edited and organized to ameliorate the viciousness of war. The drama of the production was enhanced by the Leonard Graves driving voice-over narration and by Richard Rodgers's musical score.(score was arranged by Robert Russell Bennett who also was the conductor of the NBC Symphony Orchestra for this production)\n\nCompiled from over 60 million feet of  combat and newsreel footage, Victory at Sea won instant praise and loyal viewers. Television critics greeted it as a breakthrough for the young television industry. An entertaining documentary series that still provided a vivid record of recent history. The New York Times praised the series for its &quot;rare power&quot;; The New Yorker pronounced the combat footage &quot;beyond compare&quot;; and Harper's proclaimed that &quot;Victory at Sea created a new art form.&quot; It eventually garnered 13 industry awards, including a Peabody and a special Emmy. (the series has been criticized for some of it's historical accuracy and objectivity, but remembering that it is from the 50's, only seven years after the end of the war, you can give it a little leeway on that issue, Most of it still plays very well after all these years)\n\nThis release comes from my rip of the Embassy Home Entertainment VHS tapes, second release (1986 6 tape set. Very few people paid 20.00 per tape for the 1982 first 26 tape release). It is coded in x264 and AAC sound at 960x720p (4x3) resolution. It is duotone B&amp;W just like the original TV broadcast back in 1952 and I have done no alteration to the video or sound except for removing the Embassy VHS headers and trailers and converting the Mono soundtrack to Stereo..\n\n\n\nEpisode 13: Melanesian Nightmare\n\nAired on February 1, 1953\n\nThe Thirteenth volume of Victory At Sea covers the New Guinea campaign as they repel the Japanese in their drive on Port Morseby. highlighted is the use a new ship, the slow, lumbering Landing Ship, Tank, aka, the LST. General MacArthur's leapfrogging campaign is a masterful stroke, instead of taking the whole island, over many months and massive casulties, just take the bases, force the Japanese into the jungle to rot away on the vine. The price paid is great on both sides, but as Japanese casualties increase in their never-ending losing battle against the Allied onslaught, their homeland only hears propaganda of continuing victory. Also, it is shown that the loss of japanese soldiers is beginning to be felt at home by the families of the men, providing a balance of how universal grief truly is.\n\nTechnical Specs (typical)\n\nVideo Codec:         : AVC\nVideo Bitrate:       : 3,192 kbps\nVideo Aspect Ratio:  : 1.33, (4x3)\nVideo Resolution:    : 960x720\nScan type            : Progressive\nAudio Codec:         : AAC LC\nAudio language:      : English\nAudio Bitrate:       : 128 kbps\nAudio Channels:      : 2 (stereo)\nRun-Time:            : 26.5 mn\nFramerate:           : 29.970 fps\nNumber of Parts:     : 26\nContainer            : MP4\nPart Size:           : 630 MiB\nSource:              : VHS-rip\nEncoded date         : 2014-09-28\nEncoded by:          : Egilman","torrent":{"xt":"urn:btih:629fe2c972587a7d24f636ce7e2f5fa2ed0f8ef8","amp;dn":"Victory+At+Sea+13of26+Melanesian+Nightmare+VHSRip+720p+Egilman","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"629fe2c972587a7d24f636ce7e2f5fa2ed0f8ef8","infoHashBuffer":{"type":"Buffer","data":[98,159,226,201,114,88,122,125,36,246,54,206,126,47,95,162,237,15,142,248]},"announce":[],"urlList":[]}}