{"title":"I-Faker Desktop Pro {Fake Hits Generator} Cracked By Gino","uid":3832082,"size":1086261,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:62fa80b49ec3880ae6fd14bccbb7086b221625af&amp;dn=I-Faker+Desktop+Pro+%7BFake+Hits+Generator%7D+Cracked+By+Gino&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"cbugz","files":1,"time":1191693554,"description":"I-FAKER DESKTOP PRO version 2 released. Our windows application runs quicker, delivers faster and has more features than ever before allowing YOU to save time and server resources. I-FAKER DESKTOP PRO uses local system resources rather than server resources, so as long as your machine is on, you are delivering the traffic. DO NOT accept the inferior copies, try our new I-FAKER DESTOP PRO demo for free now HERE\n\nSEND THOUSANDS OF UNIQUE IP &quot;FAKE&quot; VISITORS TO YOUR WEBSITE!\n\nI-FAKER sends as many unique fake hits a day as your server can handle. It routes HTTP get requests through a massive list of anonymous proxy servers which can be defined by you. Even banners on your site get impressions! This is the most advanced software of its kind. It is not only a fake hit generator, but it can in conjunction with your ad tracker improve your site profits. Our fake traffic software is absolutely one of its kind on the web.\n\nWATCH YOUR PAGE STATS MOUNT UP!\nAll the traffic sent by our fake hits software is unique and shows up as unique in your website and server stats. It uses as minimal server resources as possible and can be configured to run for as long as you wish. It can even send fake traffic to multiple websites specified by you, the webmaster. Our fake hits script will make YOUR stats look great!\n\n\nUSE IN CONJUNCTION WITH YOUR TRAFFIC EXCHANGE!\nRun a traffic service or traffic exchange? Can&amp;#039;t deliver the traffic you promised or even charged your clients for? Our Fake traffic software can not only deliver the traffic you promised, but you can change the referring website to your own or ANY other site to make it even more unique! Send fake visitors to your clients websites!!","torrent":{"xt":"urn:btih:62fa80b49ec3880ae6fd14bccbb7086b221625af","amp;dn":"I-Faker+Desktop+Pro+%7BFake+Hits+Generator%7D+Cracked+By+Gino","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"62fa80b49ec3880ae6fd14bccbb7086b221625af","infoHashBuffer":{"type":"Buffer","data":[98,250,128,180,158,195,136,10,230,253,20,188,203,183,8,107,34,22,37,175]},"announce":[],"urlList":[]}}