{"title":"Offlajn Improved AJAX Login and Register 2.251 Joomla","uid":10427409,"size":1824081,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:67a874d8829aba21cee644c18d70db4a199a5c89&amp;dn=Offlajn+Improved+AJAX+Login+and+Register+2.251+Joomla&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":null,"files":1,"time":1403722530,"description":"Need a new Login and Registration interface?\nImproved AJAX Login is a very elegant extension, it speeds up the Login, Logout and Registration procedures with AJAX technology. These process never were so simple and easy, and the clean &amp; smooth design, of course.\n\nHow does it work so fast?\nThe Improved AJAX Login does the dirty work in the background, the login process will only take a moment, it's lightning fast! This module does not need to reload your webpage, the user is logged in as soon as he hits the login button. The Login also warns the user on unsuccesful login attempts with nicely decorated popup fields. The validation of the registration form is also make in the background, and mark the incorrect fields with an error massage. Go ahead to the demo page and try it yourself!\n\nAJAX-powered User menu\nAfter login with Improved AJAX Login a stylish User menu will appear instead of the login form. User menu is fully customisable and have some default menu items like Edit Your Details, Show Cart (only if VirtueMart installed) and of course Logout. User menu is also AJAX-powered so all menu items are loading in the background.\n\nSome more words of the registration\nThe Improved Ajax Login &amp; Register has an own popup-box for the fields. You can use captcha, to avoid bots registration to your site. As it previously mentioned, this extension make the validation and the register process with the AJAX technology, so there won't be any page-refresh during the registration.\n\nalt alt alt  alt \n(click on the pictures for larger size)\nFew words about AJAX\nWith AJAX, web applications can send data to, and retrieve data from, a server asynchronously (in the background) without interfering with the display and behavior of the existing page. AJAX is an acronym for Asynchronous JavaScript and XML.\n\nLogin with Facebook / Google / Twitter / Microsoft / LinkedIn\nNo more registration required, just one click and you can log in with your Facebook, Google, Twitter or Microsoft account. If you already have lots of users in joomla, they don't need to create new account, Improved AJAX Login will auto link people with same email address. The component includes tutorials help with configuration.\n\nLive Form Editor\nThis editor using the WYSIWYG method (What You See is What You Get) to make well-planned forms in seconds, because you see the result live. There are many predefined fields like Address, Date of birth, Terms of Services, etc... But you can also create custom fields.","torrent":{"xt":"urn:btih:67a874d8829aba21cee644c18d70db4a199a5c89","amp;dn":"Offlajn+Improved+AJAX+Login+and+Register+2.251+Joomla","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"67a874d8829aba21cee644c18d70db4a199a5c89","infoHashBuffer":{"type":"Buffer","data":[103,168,116,216,130,154,186,33,206,230,68,193,141,112,219,74,25,154,92,137]},"announce":[],"urlList":[]}}