{"title":"Los Cachorros 1x12 (Temp.1)","uid":6064146,"size":121377671,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:6c6d52faf7b71b7835239a025c3420890a3c0be9&amp;dn=Los+Cachorros+1x12+%28Temp.1%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"chusca","files":2,"time":1293266003,"description":"\nDescripcion: Los Cachorros emprenden una emocionante aventura que les llevarÃƒÂ¡ al Bosque del Medio, una tierra imaginaria repleta de antiguos cuentos, fÃƒÂ¡bulas, magia y leyendas. Por el camino se encontrarÃƒÂ¡n con personajes encantados como magos, brujas, hadas y gnomos. Los Cachorros se enfrentarÃƒÂ¡n a la Bruja Corneja, quien usarÃƒÂ¡ todos los trucos de su libro de hechizos para acabar con ellos y dominar el Bosque del Medio. A pesar de todo, nuestros amigos conseguirÃƒÂ¡n vencer a la malvada hechicera y salvar los habitantes de Bosque, al menos por el momento. En cada episodio, tendrÃƒÂ¡n que superar difÃƒÂ­ciles retos y trabajar en equipo para poder conseguir las preciosas perlas. La aventura estarÃƒÂ¡ llena de contratiempos y emocionantes peripecias que mantendrÃƒÂ¡n a los espectadores en vilo...\nLos Personajes: Los cachorros con los que siempre has soÃƒÂ±ado ya estÃƒÂ¡n aquÃƒÂ­. Son pequeÃƒÂ±os, adorables y muy, muy simpÃƒÂ¡ticos. Ã‚Â¿CuÃƒÂ¡l te gusta mÃƒÂ¡s?\nPortÃƒÂ¡til es el mÃƒÂ¡s intelectual, educado y culto de todos. Le encanta leer y contar anÃƒÂ©cdotas, le gusta viajar y tambiÃƒÂ©n la historia. Odia que le interrumpan, hacer deporte y los cotilleos.\n\nLa sabia gatita Oly es la verdadera lÃƒÂ­der del grupo, la que planea y dirige siempre la acciÃƒÂ³n. A Oly le gusta la aventura, las adivinanzas, resolver misterios y, sobre todo, defender a sus amigos. Odia holgazanear, la moda, las frivolidades y las personas que hacen trampas para ganar Ã‚Â¡Oly siempre estÃƒÂ¡ donde estÃƒÂ¡ la acciÃƒÂ³n! \n\nCilindro es un divertido conejito que, ademÃƒÂ¡s, es el atleta del grupo. Aunque es muy voluntarioso no es muy listo, y a menudo no calcula las consecuencias de sus acciones. EstÃƒÂ¡ secretamente (Ã‚Â¡aunque lo sabe todo el mundo!) enamorado de Diva e intenta satisfacerla y divertirla a toda costa. Aparte de Diva, a Cilindro le gustan las zanahorias, los deportes, Diva, Diva y mÃƒÂ¡s Diva. Odia el amor no correspondido, los puÃƒÂ±os de Diva y que no haya zanahorias.\n\nY hablando de Diva, lazo rosa, plumaje suave y blanco, y pico sensual: es ella, la pata del grupo, que naturalmente Ã‚Â¡se ve a sÃƒÂ­ misma guapÃƒÂ­sima y elegantÃƒÂ­sima! Le encanta ir de compras, tomar el sol, tener razÃƒÂ³n, los espejos, los collares, los anillos, las pulseras. Odia la gimnasia, no tener razÃƒÂ³n, estar a dieta y que no la consideren siempre la mÃƒÂ¡s guapa.\n\nA la ranita PÃƒÂ­o le gusta cantar, recitar versos y hacer imitaciones, es todo una artista. De mayor, a PÃƒÂ­o le gustarÃƒÂ­a actuar en un escenario de verdad. Odia la tensiÃƒÂ³n previa a un espectÃƒÂ¡culo y tiene miedo de olvidarse de los chistes. TambiÃƒÂ©n le asusta el peligro, por lo que suele desaparecer en situaciones de riesgo. \n\nDe plumaje amarillo y cara angelical, se le puede encontrar casi siempre encaramado a los hombros de PortÃƒÂ¡til: se trata de Sinnombre, el tierno, adorable y achuchable pollito del grupo. TodavÃƒÂ­a no sabe hablar y por eso usa carteles con dibujos para comunicarse con los otros Cachorros. \nSinnombre no le teme a nada ni a nadie, adora los desafÃƒÂ­os y los partidos de fÃƒÂºtbol, pero, sobre todo, le gusta tener siempre el cartel adecuado para cada situaciÃƒÂ³n.","torrent":{"xt":"urn:btih:6c6d52faf7b71b7835239a025c3420890a3c0be9","amp;dn":"Los+Cachorros+1x12+%28Temp.1%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6c6d52faf7b71b7835239a025c3420890a3c0be9","infoHashBuffer":{"type":"Buffer","data":[108,109,82,250,247,183,27,120,53,35,154,2,92,52,32,137,10,60,11,233]},"announce":[],"urlList":[]}}