{"title":"Underworld UNRATED PSP","uid":4337426,"size":506221441,"categoryP":"video","categoryS":"handheld","magnet":"?xt=urn:btih:6f6d02515afd967c2f3378c762f8486f6f9e2869&amp;dn=Underworld+UNRATED+PSP&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"HolyRoses","files":-1,"time":1218396706,"description":"Source: Underworld.UNRATED.DVDRip.XViD-ALLiANCE\n\nVideo\nDimensions: 480x200\nCodec: H.264 / AVC\nH.264 Level: 21\nCoder: CABAC\n\nAudio\nCodec: MPEG-4 AAC Audio\nChannels: Stereo\nSample rate: 48000 Hz\nBitrate: 128kb\n\n\nCopy files or folder to /VIDEO on your PSP memory stick.\n\nThe JPG files are thumbnails and not quality samples.  Copy these as well.\n\n\nThis should tide you over until Twilight!\n\n\nWant to watch it on the big screen?\n\nHere are a few ways to do that:\n\n1) Do you have a PSP slim?  If so buy the TV out cables and direct connect to your tv and play them that way.  You can buy regular composite cables, svideo cables, and component cables.  I recommend you buy the component cables if you have an HD capable tv.\n\n2) Do you have an XBOX 360 and a PSP?  Hook your PSP to your XBOX 360 via the usb mini b cable.  Go to the media blade on your 360, select videos, change source, select portable device, navigate to your video.\n\n3) If for some reason you don't have a PSP and you do have an XBOX 360 then you can just put the video files on any usb device, an iPod for instance, or a digital camera and just connect them to your XBOX in the same manner as above.\n\n4) You should also be able to stream the video to your XBOX 360 via windows media player 11.  I'm sure there are similar methods to get the video to play on a Sony PS3 also, but I don't own one so I cannot comment.\n\n------------------------------------------------------\n\nWell I have noticed now that far too many of you have your bittorrent client configured incorrectly.  85% or more of you direct connect to me.  I cannot connect to you.  You have incoming ports blocked.  I notice if I even stop seeding for 2hrs and come back you guys haven't budged at all.  It only moves if someone has their ports open and then can hand the data back and forth.\n\nIf you are using the Azureus client you can tell if you are ok by looking at your peers.  Double click on the torrent name, then click on the Peers tab.  There is a  column labeled T, under this there are 2 options, L or R.  Meaning you locally made the connection to the remote, or the remote made the connection to you.  If you have 0 R's that means no one is able to connect direct to you.  Another simple way to determine in Azureus if it is working correctly is by looking at the smiley face on the main tab.  If it is green then you are able to connect to people and people are able to connect to you.\n\nIf you are behind a router then check and see if UPnP is turned on.  If its turned on then Azureus or uTorrent will automatically open up the correct ports for you.  If you don't have the UPnP feature on your router then you will need to port forward the correct ports to your pc that is running the bittorrent client.\n\nIn theory I should only have to seed long enough until there is a 2 availablity.  Meaning there is enough data propagated that if everyone was behaving correctly it should fully seed to everyone.  I am finding that I am having to fully seed the release to many people.  This is not right and I am hoping some of you will read this and fix your settings.\n\nPlease play nice, the more of you that share fairly the more I can release rather than babysitting these torrents.\n\n\n-----------------------------------------------------------\n\n\n\n-HR\n\n","torrent":{"xt":"urn:btih:6f6d02515afd967c2f3378c762f8486f6f9e2869","amp;dn":"Underworld+UNRATED+PSP","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6f6d02515afd967c2f3378c762f8486f6f9e2869","infoHashBuffer":{"type":"Buffer","data":[111,109,2,81,90,253,150,124,47,51,120,199,98,248,72,111,111,158,40,105]},"announce":[],"urlList":[]}}