{"title":"onesidezero","uid":5102862,"size":97555336,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:6fb2e1146b604fd09e2d775d6534bf5a1359dd38&amp;dn=onesidezero&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"silencer6","files":15,"time":1254131053,"description":"Formed in 1997, the band recorded several demos before being signed by Maverick Records. Their first full length, Is This Room Getting Smaller, was released on November 20, 2001. The band toured for three years, alongside bands like Incubus, 311, Sevendust, Static-X, Soulfly, Soil, also appearing on HBO's Reverb with Linkin Park. The singles &quot;Instead Laugh&quot; and &quot;New World Order&quot; failed to push the album, and the band asked to be released from their contract. In 2003, Onesidezero disbanded and retreated to various side projects.\n\nThe most notable side project, Abloom (previously called Mothra), featured vocalist Jasan Radford and lead guitarist Levon Sultanian. Also part of the band was Mike Doling (ex-Snot, ex-Soulfly), Roy Mayorga (ex-Soulfly) and John Fahnestock (ex-Snot). Fahnestock left and was replaced by Marcelo Dias aka Marcello D. Rapp (ex-Soulfly). Shavo Odadjian of System of a Down took the role of executive producer.\n\nAbloom song titles included &quot;Cover Up,&quot; &quot;After That Quiet,&quot; &quot;January 2nd,&quot; &quot;What You Came For,&quot; &quot;Shadows,&quot; and &quot;Mama Don't Cry.&quot; Some of these are featured on their MySpace page while others are floating around on the internet. Abloom has a more classic rock feel while at times showcasing Levon Sultanian's guitar playing who is of Armenian descent.\n\nIn late 2004, Onesidezero decided to reunite and work on new material. The band toured throughout 2005 and 2006 while writing and recording their album with Ulrich Wild (Taproot, Static-X) at the helm. Before writing what would become their self-titled 2007 release, the band wrote, and scrapped, almost an album and a half worth of material that comprised most of their setlist from 2002 through 2006. Song titles included &quot;Empty,&quot; &quot;Summertime,&quot; &quot;Quicksand,&quot; &quot;Chasing the Sun,&quot; &quot;Say,&quot; &quot;Separate,&quot; &quot;Up From Down,&quot; &quot;U4IA,&quot; &quot;Oneside of the Zero,&quot; and more. On November 8, 2006, Onesidezero announced they had signed with Corporate Punishment Records. Their self titled album Onesidezero was released June 5, 2007. It was originally slated for a February 20 release. According to their Facebook page, they are in the process of writing new music for their next album.\n\nOnesidezero - Is This Room Getting Smaller 2001\n\nGenre(s) \tPost-grunge Hard rock\n\n1.  Instead Laugh          3:55\n2.  Holding Cell           3:37\n3.  New World Order        3:31\n4.  A Point In Time        3:59\n5.  Tapwater               4:04\n6.  Shed The Skin          4:12\n7.  Awake                  3:48\n8.  The Day We Lied        3:34\n9.  Soak                   2:54\n10. Eight                  4:41\n11. Never Ending           5:06\n12. Underground            7:21\n\n\nBitrate 256\n92.9MB\nLength 50:47\n\ncheck out my other rare torrents, bands that disband\n","torrent":{"xt":"urn:btih:6fb2e1146b604fd09e2d775d6534bf5a1359dd38","amp;dn":"onesidezero","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6fb2e1146b604fd09e2d775d6534bf5a1359dd38","infoHashBuffer":{"type":"Buffer","data":[111,178,225,20,107,96,79,208,158,45,119,93,101,52,191,90,19,89,221,56]},"announce":[],"urlList":[]}}