{"title":"Babes on Broadway (1941) DVD9 - Judy Garland, Mickey Rooney Musi","uid":9997840,"size":5974228992,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:7211c546950c0e48c1d2eefc5ae1c8b73e757faa&amp;dn=Babes+on+Broadway+%281941%29+DVD9+-+Judy+Garland%2C+Mickey+Rooney+Musi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":4,"uploader":"SaM","files":-1,"time":1397941982,"description":"Babes on Broadway (1941) DVD9 - Judy Garland, Mickey Rooney Musical [DDR]\n\nBabes on Broadway is a 1941 musical film starring Mickey Rooney and Judy Garland and directed by Busby Berkeley, with Vincente Minnelli directing Garland's big solo numbers. The film, which features Fay Bainter and Virginia Weidler, was the third in the &quot;Backyard Musical&quot; series about kids who put on their own show, following Babes in Arms (1939) and Strike Up the Band (1940). Songs in the film include &quot;Babes on Broadway&quot; by Burton Lane (music) and E.Y. &quot;Yip&quot; Harburg (lyrics), and &quot;How About You?&quot; by Lane with lyrics by Ralph Freed, the brother of producer Arthur Freed. The movie ends with a minstrel show performed by the main cast in blackface.\n\n    CAST:-\n    Mickey Rooney as Tommy Williams\n    Judy Garland as Penny Morris\n    Fay Bainter as Miss &quot;Jonesy&quot; Jones\n    Virginia Weidler as Barbara Josephine &quot;Jo&quot; Conway           \n    Ray McDonald as Ray Lambert\n    Richard Quine as Morton &quot;Hammy&quot; Hammond\n    Donald Meek as Mr. Stone\n    Alexander Woollcott as himself\n    Luis Alberni as Nick\n    James Gleason as Thornton Reed\n    Emma Dunn as Mrs. Williams\n    Anne Rooney as Jenny\n    Ava Gardner as Pitt-Astor Girl\n\n    Donna Reed appears uncredited as a secretary.\n    Margaret O'Brien (Film Debut) appears uncredited as an ambitious little girl at an audition who melodramatically pleads: &quot;Don't send my brother to the chair! Don't let him burn!&quot;\n\nDirected by Busby Berkeley, Vincente Minnelli\nProduced by Arthur Freed\nWritten by Fred F. Finklehoffe\nMusic by \tScore: Leo Arnaud, George Bassman\nRunning time 118 minutes\n\nPROUCTION NOTES:-\nThis was the third film in the &quot;Backyard Musical&quot; series, which included Babes in Arms (1939), Strike Up the Band (1940) and Girl Crazy (1943). Good News (1947) and Summer Stock (1950) were also originally planned to become part of the series. Judy Garland starred in the latter with Gene Kelly.\n\nThe film was stalled in the middle of production when Garland secretly flew to Las Vegas to wed her first husband David Rose. She was 19 years old.\n\nMUSICAL NUMBERS:-\n    &quot;Babes on Broadway&quot; (Main Title) (MGM Studio Chorus)\n    &quot;Anything Can Happen in New York&quot; (Mickey Rooney, Ray McDonald, and Richard Quine)\n    &quot;How About You?&quot; (Judy Garland and Mickey Rooney)\n    &quot;Hoe Down&quot; (Judy Garland, Mickey Rooney, Six Hits and a Miss, The Five Musical Maids, and MGM Studio Chorus)\n    &quot;Chin Up! Cheerio! Carry On!&quot; (Judy Garland, St. Luke's Episcopal Church Choristers, and MGM Studio Chorus)\n    Ghost Theater Sequence:\n        &quot;Cyrano de Bergerac&quot; (Mickey Rooney as Richard Mansfield)\n        &quot;Mary's a Grand Old Name&quot; (Judy Garland as Fay Templeton)\n        &quot;She's Ma Daisy&quot; (Mickey Rooney as Harry Lauder)\n        &quot;I've Got Rings On My Fingers&quot; (Judy Garland as Blanche Ring)\n        &quot;La Marseillaise&quot; (Judy Garland as Sarah Bernhardt)\n        &quot;The Yankee Doodle Boy&quot; (Mickey Rooney and Judy Garland)\n    &quot;Bombshell from Brazil&quot; (Judy Garland, Mickey Rooney, Richard Quine, Ray McDonald, Virginia Weidler, Anne Rooney, Robert Bradford, and MGM Studio Chorus)\n    &quot;Mama Yo Quiero&quot; (Mickey Rooney)\n    Minstrel Show Sequence:\n        &quot;Blackout Over Broadway&quot; (Judy Garland, Mickey Rooney, Ray McDonald, Virginia Weidler, Richard Quine, Anne Rooney and MGM Studio Chorus)\n        &quot;By the Light of the Silvery Moon&quot; (Ray McDonald)\n        &quot;Franklin D. Roosevelt Jones&quot; (Judy Garland and MGM Studio Chorus)\n        &quot;Old Folks at Home&quot; (Eddie Peabody on banjo, dubbing for Mickey Rooney)\n        &quot;Alabamy Bound&quot; (Eddie Peabody on banjo, dubbing for Mickey Rooney)\n        &quot;Waiting for the Robert E. Lee&quot; (Judy Garland, Mickey Rooney, Virginia Weidler, Anne Rooney, Richard Quine, and MGM Studio Chorus)\n    &quot;Babes on Broadway&quot; (Finale) (Judy Garland, Mickey Rooney, Virginia Weidler, Ray McDonald, Richard Quine, and MGM Studio Chorus)\n\nSYNOPSIS:- Babes on Nroadway (1941)\nTommy Williams desperately wants to get to Broadway, but as he is only singing in a spaghetti house for tips he is a long way off. He meets Penny Morris, herself no mean singer, and through her gets the idea to promote a show to send orphaned children on a country holiday. But he is only using the kids to get on himself, which Penny soon realises. With his romance off, an engagement in Philadelphia he can't get to, and, indeed, war in Europe, life can be difficult.\n\nAdvertised as a sort of sequel to MGM's Babes in Arms (1939), Babes on Broadway reunites the two stars of the earlier film: Mickey Rooney and Judy Garland. Rooney is the guiding force of a group of young showbiz hopefuls who are trying to make it on Broadway. When things look darkest, he goes into his &quot;Say, kids!&quot; routine, rousing his companions to put on their own show. Highlights include a sequence in which Rooney and Garland go through a series of imitations of past theatrical greats. As cute and perky as Garland is, she has nothing on the &quot;Carmen Miranda&quot; takeoff performed--in full makeup and platform shoes--by the ubiquitous Rooney. Babes on Broadway ends with a typically overproduced production number stage by the film's director, the immortal Busby Berkeley\n\nTECHNICAL SPECIFICATIONS:-\nVideo Codec: MPEG-2\nVideo Bitrate: 4999 kbps\nVideo Resolution: 720x480\nVideo Aspect Ratio: 1.333:1\nFrames Per Second: 23.976\nAudio Codec:  AC3\nAudio Bitrate: 192kb/s CBR 48000 Hz\nAudio Streams:  2\nAudio Languages: English\nRunTime 119 mins\nSubtitles: None\nRipped by: Trinidad [DDR]\nDuration: 119 mins","torrent":{"xt":"urn:btih:7211c546950c0e48c1d2eefc5ae1c8b73e757faa","amp;dn":"Babes+on+Broadway+%281941%29+DVD9+-+Judy+Garland%2C+Mickey+Rooney+Musi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7211c546950c0e48c1d2eefc5ae1c8b73e757faa","infoHashBuffer":{"type":"Buffer","data":[114,17,197,70,149,12,14,72,193,210,238,252,90,225,200,183,62,117,127,170]},"announce":[],"urlList":[]}}