{"title":"PCE-CD images converted to PSP ISO's Sony's &quot;Official","uid":4933904,"size":10413299759,"categoryP":"games","categoryS":"handheld","magnet":"?xt=urn:btih:753272801077d17809d9f2674b95ed17d00901ef&amp;dn=PCE-CD+images+converted+to+PSP+ISO%5C%27s+Sony%5C%27s+%5C%22Official&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"B2K24","files":104,"time":1244158409,"description":"If you want to play PC Engine CD images on your PSP using sony's PCE emulation these iso's are for you.\n\nFirst off i recommend IR SHELL so you can see the name of the game your launching and to rename the saves since all iso's have same umd id you have to rename the HCD5078 using IR SHELL if you wish to keep more than 1 on same card.\n\nNow, run the game on your PSP. It'll show up as 'PC Engine Collection'. Once you're past the title screen, just hit 'Circle'. This is the game that we replaced. Now, it's going to ask you to save a bunch of times; so just keep hitting 'Circle'. Yes, you do have to save when asked. Then you'll see a screen that has three options; just hit 'Circle' again. You'll end up saving again, blah blah blah. You'll see some some more Japanese, with the words 'Pause Option' in english. Just hit 'Circle' again. The PC Engine bios screen will flash momentarily, and then, you're in the game! The right trigger will let you select the screen size, and the left trigger brings up the 'Pause Options'; the first one takes you back to the game, the second one also lets you select the screen size, and the third option will let you save where you're at.\n\nThanks MacTheFork for the converter and to others who helped with these conversions.","torrent":{"xt":"urn:btih:753272801077d17809d9f2674b95ed17d00901ef","amp;dn":"PCE-CD+images+converted+to+PSP+ISO%5C%27s+Sony%5C%27s+%5C%22Official","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"753272801077d17809d9f2674b95ed17d00901ef","infoHashBuffer":{"type":"Buffer","data":[117,50,114,128,16,119,209,120,9,217,242,103,75,149,237,23,208,9,1,239]},"announce":[],"urlList":[]}}