{"title":"3 classics: History of Rape/La Puberte Sensuelle/Secret Mistress","uid":4779792,"size":2633901241,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:75440493ed334a9930cd467c25aefc15fed245b2&amp;dn=3+classics%3A+History+of+Rape%2FLa+Puberte+Sensuelle%2FSecret+Mistress&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"h0tspurred","files":10,"time":1237338600,"description":"3 classics: History of Rape / La Puberte Sensuelle / Secret Mistress\n\n\n\n\n\n\n\nall 3 screens (+ all 3 covers):\n\n &lt;a href=&quot;\nhttp://dandy.blogbugs.org/7731986/3-classics---all-screens.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://dandy.blogbugs.org/7731986/3-classics---all-screens.html&lt;/a&gt;\n\n\n\n\n\n\n1. History of Rape Box Set 2        (1978)       [AVI/1.13G]     01:23:18\n\n2. La Puberte Sensuelle             (1983)       [AVI/651MB]     01:08:05\n\n3. Secret Mistress                  (1986)       [AVI/700MB]     01:25:32\n\n\n\n\n1. History of Rape Box Set 2\n\n\nThe most notorious and shocking series in the history of underground porn finally arrives on DVD! This collection documents the 1970's rarest, darkest and most unsettling scenes of sexual barbarity, culled from long forgotten loops &amp; lost feature films.\nEach disc contains approximately 2 hours of UNRELENTINGLY FILTHY, SADISTIC &amp; DOWNRIGHT DERANGED XXX FOOTAGE!\n\nStudio: Alpha Blue\nCast:   Jamie Gillis, John Holmes, Marc Stevens\nGenres: Abduction, Anal, Big Cock, Black Cock, Bondage, D/P, Domination, Gangbang, Graphic Violence, Horror, Lesbian, Rape, S/M, Teen, Torture, Watersports, Whipping \n\n\n\n2. La PubertÃƒÂ© sensuelle\n\nReleased: \t1983\nDirector: \tMichel Ricaud\nNotes: \t        Laura Video Productions\n\nAlternate Titles\n\n    * Schoolgirl Tricks 1986 German version, 58 minutes, Color Climax, Blue Climax 466\n\nActresses\n\n    * Anna Lombardi plays une lycÃƒÂ©enne\n    * Christine Verger plays la fille\n    * Lydie Marlene plays une lycÃƒÂ©enne\n    * Sandy Wilson plays la mÃƒÂ¨re\n\nNotes\n\nMales -\n\n    * Jacques Marbeuf plays le pÃƒÂ¨re\n    * Eric Dray as Sylvain Ray plays l'amant\n    * Corado Martini plays un ami de l'amant\n    * Geremy Teel plays un ami de l'amant\n    * Bob Oroff plays le satyre\n\nPlotline: The blonde wife (Sandy Wilson) wakes up a little randy and tries to stir up her husband. She goes underneath the sheets and blows him (throughout this scene Marbeuf is doubled by another man). She gets into a reverse cowgirl. (She has long honey blonde hair, plain looks, medium sized breasts with rather thick nipples, looks at least &quot;mature&quot; for the role of the mother). She moans very loudly. The husband admonishes her to stay quiet, lest she wakes up their daughter. The alarm goes off, and the daughter (Christine Verger) is now awake (she is wearing a blue top, she has medium length brown hair, small breasts, rather plain looks, very expressionless face throughout the movie). While the parents continue to screw to climax, the daughter goes to take a shower: she caresses her body and squirts jets of water on her hairy vagina from the hand-held shower head. The daughter gets dressed in her school uniform (white blouse, dark blue skirt, dark blue long jacket) and sees her parents have sex (in doggie and spoon postion) through the partly open door. The daughter has seen enough, returns to her room, packs her school bag and says goodbye to her parents (there is no cum shot).\n\nWhile walking through a big park on her way to school, the young girl is accosted by a lecherous guy (Oroff, in awful make-up), who sneaks up behind her and tries to fondle her. The girl tells her experience to two school mates, XNK0478 and XNK0479 (Anna Lombardi, Lydie Marlene : one has short brown hair and the other longer wavy brown hair, both make silly faces, stare and recite their lines as they were auditioning for a school play, they were very amateurish). She goes and see her boyfriend Eric (?) (Sylvain Ray), and he calls her by name: Marie. He asks her what's wrong, and she tells him that that morning in the park a creep stuck his finger in her ass (this action was not seen in the actual sequence), and on top of that she has been suspended from school for 3 days due to some poor grades. He lower her panties and introduces his finger in her anus. He notes that it went in too easy and now must punish her. He brings out a shaving kit, lathers up her vagina and completely shaves her with a long razor. After he has finished the job, he removes her clothes and gets her to blow him.He screws her standing, then reverse cowgirl, then anals her in reverse cowgirl (there is no cum shot either in this scene, she tells him she has to leave and has go to home, but promises him to return tomorrow, this more or less seems to &quot;justitfy&quot; why the scene ends abruptly that way).\n\nMarie keeps her promise and return to see her lover the next day. She changes clothes in the stairway, before she enters his pad. Once inside he removes her clothes, sucks on her small breasts, starts to finger her shaved vagina, then tells her has a surprise for her. He calls out to two of his male friends to come out and join in on the fun: Raoul, Lucien (Corado Martini, Geremy Teel). No sooner has the fun started, than the boyfriend tells the two guys a step aside while he fucks her missionary, spoon, reverse cowgirl, doggie on a red couch. He anals her in reverse cowgirl, with the other two guys just holding her legs apart. Again the scene ends abruptly, as the girl says she has to get back home (scene fades out, with no cum shot).\n\nMarie meets up with her two female classmates who tells them that they will spend a great day together. She takes the two girls to her boyfriend's pad. He is there with the other two guys, Raoul and Lucien who really look like nerds. Marie tells her lover that the two girls are real sluts and that they had an experince at school: we see this scene in flashback. Marie is masturbating, and is watched by the two girls in another room. The two girls join in and have a 3-way g/g scene (mild tit sucking and pussy eating). Marie coes int the living room where the guys and girls are, open up her dress and shows them her bald pussy. Raoul and Lucien screw the two girls at opposite ends of the couch, with the long-haired brunette getting analed while lying on her side. The boyfriend enteres the scene with the shaving kits and the three guys proceed to shave the two girls (the one with the short dark hair has really bad teeth). The sex resumes again, with the guys changing partners. The boyfriend screws the long-haired brunette and cums on her shaved vagine in spoon position (that is about it for this scene).\n\nMarie tells her mother that he has a boyfriend and that they have had sex. The mother is quite understanding as long as she has taken &quot;precautions&quot;, but the girl confesses she is pregnant. The boyfriend tells the mother he loves Marie. She welcomes him in the household, and she throws herself in his arms: he sucks her blonde hairy pussy, she blows him. She rides him in reverse cowgirl, then he screws her in doggie position and he cums on her ass cheeks.\n\n\n\n3. Secret Mistress\n\n\nDistributor: Vidco Entertainment\nDirector:    Lasse Braun\nReleased:    1986\n \nActresses\n\n    * Colleen Brennan\n    * Kristara Barrington\n    * Scarlett Fever\n    * Siobhan Hunter\n    * Stacey Donovan\n    * Taija Rae\n\nActors\n\n    * Ashley Moore\n    * Robert Bullock\n    * Rod Retta\n\n\n\n\n\n\n\n\n\n\n\n.\n","torrent":{"xt":"urn:btih:75440493ed334a9930cd467c25aefc15fed245b2","amp;dn":"3+classics%3A+History+of+Rape%2FLa+Puberte+Sensuelle%2FSecret+Mistress","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"75440493ed334a9930cd467c25aefc15fed245b2","infoHashBuffer":{"type":"Buffer","data":[117,68,4,147,237,51,74,153,48,205,70,124,37,174,252,21,254,210,69,178]},"announce":[],"urlList":[]}}