{"title":"CLASICO NÃ‚Âº 50 HONORIFICO: La bruja novata (1974)","uid":4743443,"size":997091328,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:786a81d790d39c077647c0f5c69675f1a1e4c9b3&amp;dn=CLASICO+N%C3%82%C2%BA+50+HONORIFICO%3A+La+bruja+novata+%281974%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"NITRISH","files":1,"time":1235680441,"description":"Trasncurre la segunda guerra mundial en el aÃƒÂ±o 1940 cuando un museo en una pequeÃƒÂ±a aldea de la costa sureÃƒÂ±a inglesa es el encargado de alojar a pequeÃƒÂ±os lejos de los bombardeos en Londres. La seÃƒÂ±orita Eglantine Price no estÃƒÂ¡ muy feliz o convencida cuando se le asigna el alojar en su casa a tres hermanos huÃƒÂ©rfanos, Charlie, Carrie y Paul Rawlings. La seÃƒÂ±orita Price vive sola en una enorme casa de campo en las afueras de la aldea y los niÃƒÂ±os pronto descubren que tambiÃƒÂ©n guarda un secreto; la seÃƒÂ±orita Price es una bruja novata. Los niÃƒÂ±os prometen no desvelar el secreto si la seÃƒÂ±orita Price les da algo a cambio; los niÃƒÂ±os aceptan como regalo un boliche que es la clave del 'conjuro para viajar,' que permite a las personas viajar a cualquier parte del mundo a bordo de una antigua cama. El correo trae para la seÃƒÂ±orita Price malas noticias; la academia de brujerÃƒÂ­a dirigida por el seÃƒÂ±or Emilius Browne ha cerrado a causa de la guerra y la seÃƒÂ±orita no recibirÃƒÂ¡ el ÃƒÂºltimo conjuro, con el cual ella contaba para ayudar a acabar con la guerra. La seÃƒÂ±orita pide de Paul, quien es el encargado del mÃƒÂ¡gico boliche, que le devuelva el preciado objeto para poder viajar a Londres y obtener el conjuro de la locomociÃƒÂ³n substitutiva. No logran ÃƒÂ©xito en Londres, pero sÃƒÂ­ la amistad del profesor. Todos juntos, abordo de la cama, emprenden en aventura tras aventura en busca del famoso conjuro, desde Portobello Road en Londres hasta una isla de ficciÃƒÂ³n, la Isla de Naboombu, donde atienden un particular juego de fÃƒÂºtbol cuyos jugadores son animales. Una vez obtenido el conjuro, el grupo deberÃƒÂ¡ luchar contra y derrotar a los soldados Nazis para lograr una victoria para Inglaterra y contribuir para la conclusiÃƒÂ³n de la horrible guerra.\n\n\nEl clasico NÃ‚Âº 50 cierra el Ciclo de CLASICOS DISNEY hasta la fecha actual del 26 de febrero de 2009.","torrent":{"xt":"urn:btih:786a81d790d39c077647c0f5c69675f1a1e4c9b3","amp;dn":"CLASICO+N%C3%82%C2%BA+50+HONORIFICO%3A+La+bruja+novata+%281974%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"786a81d790d39c077647c0f5c69675f1a1e4c9b3","infoHashBuffer":{"type":"Buffer","data":[120,106,129,215,144,211,156,7,118,71,192,245,198,150,117,241,161,228,201,179]},"announce":[],"urlList":[]}}