{"title":"Win7codecs 1.0.2","uid":4741905,"size":18882567,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:78dc22744474269251134b337ef13ddcfa328907&amp;dn=Win7codecs+1.0.2&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"olofolleola4","files":-1,"time":1235598330,"description":"Copied from Shark007 Homepage:\n\n\nWhen dealing with codecs, more does not equal better.\n\nHaving the least amount on your system is the best configuration.\n\nThis is exactly what these packages will do for you.\n\n\n\nYou will no longer be restricted to using a specific player.\n\nWindows Media Player and Media Center will be able to play all your files.\n\n\nThe Win7codecs package which I have created does not change or interfere with what Microsoft has going on concerning native codec support in Windows Media Player 12 and Media Center.\nDXVA accelerated H264 playback is provided by the codec package for all other capable players.\n\nCodecs have been a problem for most users at one time or another.\n\nThis is because there has never been an 'out of the box' working solution that the average computer user could install and just have everything work properly from the beginning. There are several decent codec package solutions out there, but none of them did everything I wanted.\nI was always in need of a tweak, adjustment, or even a re-installation just to get the codecs I needed/wanted and most of the time, the file still didn't play properly.\nI've never claimed to be a media guru. My media experience prior to creating these packages was to double-click a file I downloaded and hope that it played.\nSo with the help of the MSFN community, I decided to package up the bare minimum of codecs required by most computer users and share them with the rest of the world. \n\nThe installer will automatically remove most other popular codec releases from your computer before installing this concise yet comprehensive package.\nYou won't need to make any adjustments or tweaks to enjoy your media content immediately. Windows Media Player and Media Center will instantly recognize all your files as playable. \n\nIt does not contain a media player and it does not associate file-types.\nWith this package installed you will be able to use any media player, limited only by the players' capabilities, to play all movies and video clips.\nStreaming video is supported in several formats in all popular web browsers.\nUsers of the Win7codecs have the ability to choose what is installed and where to install it using the public redistributable.\nAfter installation you can select to remove specific portions without removing the entire package. You can also re-add the removed items at any time.\n\n\nThis package supports 18 localizations.\nThe default is English and the installer includes support for the following other languages; Chinese Simplified/Traditional, Japanese, Czech, Dutch, Finnish, French, German, Greek, Italian, Norwegian, Portuguese, Russian, Spanish, Polish, Swedish and Turkish.\n\n\nChangelog:\n\n\nUpdate ffdshow rev 2719\n\nUpdate Gabest to rev 1004\n\nFix memory leak in DXVA codec\n\nMinor changes to default settings\n\n\nComments from the uploader (olofolleola4):\nThis is a freeware codec package specially complied for Windows 7 :D","torrent":{"xt":"urn:btih:78dc22744474269251134b337ef13ddcfa328907","amp;dn":"Win7codecs+1.0.2","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"78dc22744474269251134b337ef13ddcfa328907","infoHashBuffer":{"type":"Buffer","data":[120,220,34,116,68,116,38,146,81,19,75,51,126,241,61,220,250,50,137,7]},"announce":[],"urlList":[]}}