{"title":"BitDefender AntiVirus 2009 x32 and x64","uid":4474639,"size":120263150,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:7950ae20100b00e45005339ceb7c4957c12edf88&amp;dn=BitDefender+AntiVirus+2009+x32+and+x64&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"dmark035","files":2,"time":1225292138,"description":"A professional antivirus program including security features\n\nBitDefender Antivirus 2009 was designed to be provide advanced proactive protection against viruses, spyware, phishing attacks and identity theft, without slowing down your PC.\n\nBitDefender AntiVirus 2009 - Superior Proactive Protection from Viruses, Spyware, and other e-Threatsthat wont slow you down!\nBitDefender provides security solutions to satisfy the protection requirements of today&amp;#039;s computing environment, delivering effective threat management to home and corporate users. BitDefender Antivirus is a powerful antivirus and antispyware tool with features that best meet your security needs. Ease of use and automatic updates make BitDefender Antivirus an install and forgetproduct.\n\nBitDefender a global provider of award-winning antivirus software and data security solutions, has launched BitDefender 2009 its new line of security solutions providing state-of-the-art proactive protection from todays most damaging viruses, spyware, hackers, spam, phishing attacks, and other common Internet security threats.\n\nFeatures:\n\nÃ‚Â· Confidently download, share and open files from friends, family, co-workers and even total strangers!\nImproved: Scans all web, e-mail and instant messaging traffic for viruses and spyware, in real-time\nProactively protects against new virus outbreaks using advanced heuristics\nÃ‚Â· Protect your identity: shop, bank, listen, watch privately and securely\nBlocks attempted identity theft (phishing)\nImproved: Prevents personal information from leaking via e-mail, web or instant messaging\nÃ‚Â· Guard your conversations with top-of-the line encryption\nInstant Messaging Encryption\nÃ‚Â· Play safe, play seamlessly!\nImproved: Reduces the system load and avoids requesting user interaction during games\nÃ‚Â· Get fine-tuned performance from your computer !\nUses few system resources\nLaptop mode prolongs battery life\nImproved: Scans all web, e-mail and instant messaging traffic for viruses and spyware, in real-time\nProactively protects against new virus outbreaks using advanced heuristics\nÃ‚Â· Family network protection\nManage the security of your home network from a single location. BitDefender software from other computers in the network can be remotely configured, while tasks such as scans, backups tune-ups and updates can be run on-demand or scheduled to run during off-hours.\nÃ‚Â· Hassle Free Hourly Updates\nHourly updates ensure that you are protected against the latest threats without pushing a button. Lost program files are not a problem either. In the rare event of file damage due to PC problems, BitDefender automatically repairs and updates itself.\nÃ‚Â· FREE 24/7 Support\nGot a question? Our security experts are available to help you 24/7 via phone, email or chat at no additional cost.","torrent":{"xt":"urn:btih:7950ae20100b00e45005339ceb7c4957c12edf88","amp;dn":"BitDefender+AntiVirus+2009+x32+and+x64","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7950ae20100b00e45005339ceb7c4957c12edf88","infoHashBuffer":{"type":"Buffer","data":[121,80,174,32,16,11,0,228,80,5,51,156,235,124,73,87,193,46,223,136]},"announce":[],"urlList":[]}}