{"title":"Democracy Now - 07 mar 2011","uid":6226192,"size":453732944,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:795a1a81360bde397c7e87695dfc27f85f8e0ab5&amp;dn=Democracy+Now+-+07+mar+2011&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":null,"files":1,"time":1299519555,"description":"An alternative daily newschannel. One hour with news as you do not see it elsewhere.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n\nHeadlines for Mar 07, 2011\n\n- Libya: Gaddafi Mounts Counter-offensive, Hundreds of Thousands Flee\n- U.S. Senators Support No-Fly Zone, Defense Secretary Expresses Concern\n- Saudi Arabia Bans Public Protests\n- Thousands Continue Protests in Wisconsin\n- Budget Cuts and Threats to Unions Prompt Nationwide Protests\n- Karzai Rejects U.S. Apology for Killing Children as Hundreds Protest\n- Egyptian Protesters Overrun Secret Police Headquarters, Seize Evidence of Torture\n- Greece: Nearly 100 Hunger Strike Migrants Hospitalized\n- Forced Nudity Continues for WikiLeaks Suspect, Comparison Drawn to Abu Ghraib\n- China Begins Violent Crackdown on Dissidents and Journalists\n- Fatal Attack on California Sikhs May Have Been a Hate Crime\n\n\nSpecial reports\n\n- Hopes of Peaceful Revolution in Libya End as Opposition Prepares for Long Battle Against Gaddafi Forces\n\nLibyan leader Col. Muammar Gaddafi's regime has launched a counter-offensive in the attempt to retake several cities captured by opposition forces in a popular uprising that began Feb. 17. Gaddafi's forces are attacking opposition fighters with helicopter gunships, fighter planes and tanks in several cities, including Bin Jawad, Tobruk, Ras Lanuf and Misurata. Meanwhile, the United Nations is launching an appeal to help 600,000 people within Libya who are expected to need humanitarian aid. We go to Benghazi to speak with Democracy Now! correspondent Anjali Kamat.\n\n\n- Thousands of Migrant Workers Stranded at Libyan Borders and Ports As Violent Clashes Spread: Video Report by Anjali Kamat in Benghazi\n\nSince forces loyal to Libyan leader Col. Muammar Gaddafi began violently cracking down on the popular uprising weeks ago, many of Libya's migrant workforce attempted to flee the country. Of Libya's estimated 2.5 million foreign workers, the United Nations estimates that at least 200,000 workers have fled the country since the fighting began-and that number is expected to double. Thousands of workers are congregating at Libya's border with Egypt, Tunisia and along its port towns, creating a humanitarian crisis where shelter, food, sanitation and transportation is desperately needed. Democracy Now! correspondent Anjali Kamat speaks with migrant workers in the port town of Benghazi and to Peter Bouckaert, the emergencies director for Human Right Watch. Special thanks to videographer Yusuf Misdaq who contributed to this report.\n\n\n- As Public Broadcasting and Community Media Face Potentially Massive Cuts At Home, Hillary Clinton Calls For Increased Funding For U.S. Propaganda Overseas\n\n&quot;The United States is in an information war and we are losing that war,&quot; said U.S. Secretary of State Hillary Clinton last week as she praised Al Jazeera's dedication to &quot;real news.&quot; To win the war, Clinton called for expanding U.S. propaganda TV and radio broadcasts overseas. At the same time, public broadcasting and community media are under attack in the United States. Last month, the House voted to eliminate all financing for the Corporation for Public Broadcasting by the year 2013. We speak to Robert McChesney, co-founder of Free Press, and air highlights from Amy Goodman's three-day &quot;Don't Ice Out Public Media&quot; tour in Colorado.\n\n\n- Michael Moore Joins Wisconsin Labor Protests: &quot;America Is Not Broke&quot;\n\n&quot;Contrary to what those in power would like you to believe so that you'll give up your pension, cut your wages, and settle for the life your great-grandparents had, America is not broke. Not by a long shot,&quot; said Michael Moore at Saturday's labor rally in Madison opposing Wisconsin Gov. Scott Walker's attempt to end the collective bargaining rights for the majority of public sector workers. &quot;The country is awash in wealth and cash. It's just that it's not in your hands. It has been transferred, in the greatest heist in history, from the workers and consumers to the banks and the portfolios of the uber-rich.&quot;\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;","torrent":{"xt":"urn:btih:795a1a81360bde397c7e87695dfc27f85f8e0ab5","amp;dn":"Democracy+Now+-+07+mar+2011","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"795a1a81360bde397c7e87695dfc27f85f8e0ab5","infoHashBuffer":{"type":"Buffer","data":[121,90,26,129,54,11,222,57,124,126,135,105,93,252,39,248,95,142,10,181]},"announce":[],"urlList":[]}}