{"title":"Howard Jones - Like To Get To Know You Well","uid":4843535,"size":143626244,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:7ad5c1a90e63b69250e7f705716641deb2f96f07&amp;dn=Howard+Jones+-+Like+To+Get+To+Know+You+Well&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":-1,"time":1239591759,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 256 kbps\n\n\nLike To Get To Know You Well is a single by musician Howard Jones released in the second half of 1984, which was subsequently included on his twelve inch remix album The 12&quot; Album. The single climbed to number 4 on the UK Singles Chart.\n\nThe sleeve carried the motto &quot;Dedicated to the original spirit of the Olympic Games&quot;. The extended version, subtitled &quot;International Remix&quot;, featured Jones singing in English, German and French.\n\nThe song was included as a bonus track on the singer's second studio album, Dream Into Action.\n\n&quot;The dance music artist mohito sampled this song heavly in there song 'Slip Away.'\n\nHoward Jones (born John Howard Jones, 23 February 1955) is an English singer and songwriter who gained acclaim in the 1980s.\n\nIn the summer of 1984, he released a single called &quot;Like To Get To Know You Well&quot;, which he said was 'dedicated to the original spirit of the Olympic Games'. Although it was not an official Olympic anthem for the Games in Los Angeles that summer, it caught on and was a huge worldwide hit. The sleeve featured the song title in ten different languages; while Jones sang the title line in French and German on the extended version. The song appeared in the film Better Off Dead (1985) and the computer game Grand Theft Auto: Vice City Stories (2006).\n\nJones' second album was a 'remix' album. It contained six songs, all but one of which had been previously released, but which appeared in elongated formats, including the multilingual version of &quot;Like To Get To Know You Well&quot;. The album was called The 12 Inch Album and the sleeve featured a miniature Jones standing next to a 12-inch ruler.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:7ad5c1a90e63b69250e7f705716641deb2f96f07","amp;dn":"Howard+Jones+-+Like+To+Get+To+Know+You+Well","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7ad5c1a90e63b69250e7f705716641deb2f96f07","infoHashBuffer":{"type":"Buffer","data":[122,213,193,169,14,99,182,146,80,231,247,5,113,102,65,222,178,249,111,7]},"announce":[],"urlList":[]}}