{"title":"Tommy Roe - Greatest Hits [MCA] (1993)","uid":8427280,"size":283490437,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:7b90d1c8c4d9aa6eb8249322a72b38da5c840241&amp;dn=Tommy+Roe+-+Greatest+Hits+%5BMCA%5D+%281993%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":null,"files":25,"time":1367380210,"description":"This is the same torrent that was uploaded to Demonoid in August 2011.\n\n\nTommy Roe - Greatest Hits [MCA] (1993)\n &lt;a href=&quot;\nhttp://ecx.images-amazon.com/images/I/5134KvqNNyL._SL500_AA300_.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://ecx.images-amazon.com/images/I/5134KvqNNyL._SL500_AA300_.jpg&lt;/a&gt;\n\nIncludes:\nFiles by track, ripped at FLAC 8 using Easy CD-DA Extractor (www.poikosoft.com)\nDVD-ROM: LG GDR816B\nTracks have full tags (including embedded thumbnail)\nAMG Bio.txt\nAMG Review.txt\ninfo.txt (which is simply these notes included in the torrent)\n\nBiography from All Music (by Bill Dahl):\n\nWidely perceived as one of the archetypal bubblegum artists of the late '60s, Tommy Roe cut some pretty decent rockers along the way, especially early in his career -- many displaying some pretty prominent Buddy Holly roots. In fact, Roe's initial pop smash, 1962's chart-topping &quot;Sheila,&quot; was quite reminiscent of Holly's &quot;Peggy Sue,&quot; utilizing a very similar throbbing drumbeat and Roe's hiccuping vocal. The singer had previously cut the song for the smaller Judd label before remaking it in superior form for ABC-Paramount. The infectious &quot;Everybody&quot; -- another hot item the next year -- was waxed in Muscle Shoals at Rick Hall's Fame studios, normally an R&amp;B-oriented facility (it's not widely known that Roe wrote songs for the Tams, a raw-edged soul group from his Atlanta hometown). Once Roe veered off on his squeaky-clean bubblegum tangent, he stuck with it for the rest of the decade. His lighthearted &quot;Sweet Pea&quot; and &quot;Hooray for Hazel&quot; burned up the charts in 1966, and he was still at it three years later when he waxed his biggest hit, &quot;Dizzy,&quot; and &quot;Jam Up Jelly Tight.&quot;\n\nTaken from: &lt;a href=&quot; http://www.allmusic.com/artist/tommy-roe-p5296/biography&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.allmusic.com/artist/tommy-roe-p5296/biography&lt;/a&gt;\n\nAll Music Album Review (by Tim Sendra):\n\nTommy Roe's Greatest Hits on MCA is a fine 18-track collection that serves up the bubblegum icon's best songs and very little filler. Unlike a large number of Roe collections, this disc contains all original recordings made during his prime. And what a prime it was! Between 1962 and 1969, Roe was responsible for some of the brightest, snappiest bubblegum on the planet. From the funky breakbeats of &quot;Dizzy&quot; to the hushed romanticism of &quot;It's Now Winter's Day&quot; to the swampy groove of &quot;Jam Up and Jelly Tight,&quot; there are enough hits here to make you think twice about calling Roe anything less than Hall of Fame material. This collection does a fairly good job of rounding up the hits and great songs, though there are a few omissions that knock it down a notch (&quot;Cinnamon,&quot; &quot;Money Is My Pay&quot;) as does the inclusion of a mediocre take on &quot;Stagger Lee&quot; from the early '70s. A couple of collections have come along since the release of this to challenge it's worth, but they are each flawed in their own way too. Until the perfect Roe collection comes along, this is a fine purchase. And if you are a fan of bubblegum, pop, or good old rock &amp; roll, you need some Tommy Roe in your collection.\n\nTaken from: &lt;a href=&quot; http://www.allmusic.com/album/greatest-hits-mca-r229652&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.allmusic.com/album/greatest-hits-mca-r229652&lt;/a&gt;\n\nAmazon.com's page: &lt;a href=&quot; http://www.amazon.com/dp/B000002OPG&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.amazon.com/dp/B000002OPG&lt;/a&gt;\n\nTrack List:\n\n01. Sheila\n02. The Folk Singer\n03. Everybody\n04. Come On\n05. Party Girl\n06. Everytime A Bluebird Cries\n07. Sweet Pea\n08. Hooray For Hazel\n09. It's Now Winter's Day\n10. Dottie I Like It\n11. Dizzy\n12. Heather Honey\n13. Jack And Jill\n14. Jam Up And Jelly Tight\n15. Stir It Up And Serve It\n16. Pearl\n17. We Can Make Music\n18. Stagger Lee\n","torrent":{"xt":"urn:btih:7b90d1c8c4d9aa6eb8249322a72b38da5c840241","amp;dn":"Tommy+Roe+-+Greatest+Hits+%5BMCA%5D+%281993%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7b90d1c8c4d9aa6eb8249322a72b38da5c840241","infoHashBuffer":{"type":"Buffer","data":[123,144,209,200,196,217,170,110,184,36,147,34,167,43,56,218,92,132,2,65]},"announce":[],"urlList":[]}}