{"title":"Dead Space Un-Touched (Original)","uid":4798224,"size":7975600128,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:7c9a5f2c6d4f8cb30a61b3ab21a1c64d5b1fca9b&amp;dn=Dead+Space+Un-Touched+%28Original%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"utsa-guzman","files":-1,"time":1237954500,"description":"Dead Space\n\nThere was a time not too long ago when PC games came out first, and then several months, if not years, later it would come out on a console system. Well, the times they are a changing my friend; now, most cross-platform games come out first on a console and then trickle down to the PC. I could type a 25,000 word essay on why this is happening, but to sum it all up, most people don't like buying $500.00 graphic cards every year just to play the new slew of games that won't run smoothly if you don't have a 2-gig graphics card. Buy a console, get (hopefully) five years of gaming out of it and then move on to the next generation system. Anyway, case in point is today's review of Dead Space. A game that came out prior to Halloween, and in a rare instance, came out the same time the console versions did.\n\nDead Space is a kick-in-the-pants survival horror video game set on a very large, very creepy spaceship. As the main protagonist named Isaac Clarke (2001 fans take note) you are a part of the salvage and repair team. A seemingly innocent enough job, showing up to derelict vessels and getting them running again so they can return to port. He's an engineer, but that's just the fancy way of saying he's a grease monkey, a mechanic. And nothing in his job description has prepared him for the kind of double-barrel shenanigans he's neck deep in.\n\n___________________________________________________________________________________\n\nRemember That to open these files you are going to need Power ISO, although do not extract them just yet but instead mount them onto an image... Then open them for safer extraction....\n_____________________________________________________________________________________\n\nHey guys; I know that all of you, like myself are trying to meet loose ends meet due to this tough economy. So that's why i have brought you a couple of links that could help you keep money in your pocket and maybe even earn some without wasting a cent.\n\n\n","torrent":{"xt":"urn:btih:7c9a5f2c6d4f8cb30a61b3ab21a1c64d5b1fca9b","amp;dn":"Dead+Space+Un-Touched+%28Original%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7c9a5f2c6d4f8cb30a61b3ab21a1c64d5b1fca9b","infoHashBuffer":{"type":"Buffer","data":[124,154,95,44,109,79,140,179,10,97,179,171,33,161,198,77,91,31,202,155]},"announce":[],"urlList":[]}}