{"title":"Vista Codec Package 5.2.4","uid":4889359,"size":18249955,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:803935ecfeb4f418ecec2ea03f9c84511cbc8226&amp;dn=Vista+Codec+Package+5.2.4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"olofolleola4","files":-1,"time":1241891098,"description":"Copied from Shark007 Homepage:\n\n\nThe Vista Codec Package is compatible with all versions of Windows XP\n\nThe latest releases contain a new Settings Application which enables the user to choose a different splitter 'on the fly' for specific filetypes.\nThe application also lets you to choose from eight different speaker configurations from 'same as input' and all the way up to full 7 channel output.\n\nCodecs have been a problem for most users at one time or another.\n\nThis is because there has never been an 'out of the box' working solution that the average computer user could install and just have everything work properly from the beginning. There are several decent codec package solutions out there, but none of them did everything I wanted.\nI was always in need of a tweak, adjustment, or even a re-installation just to get the codecs I needed/wanted and most of the time, the file still didn't play properly.\nI've never claimed to be a media guru. My media experience prior to creating these packages was to double-click a file I downloaded and hope that it played.\nSo with the help of the MSFN community, I decided to package up the bare minimum of codecs required by most computer users and share them with the rest of the world. \n\nThe installer will automatically remove most other popular codec releases from your computer before installing this concise yet comprehensive package.\nYou won't need to make any adjustments or tweaks to enjoy your media content immediately. Windows Media Player and Media Center will instantly recognize all your files as playable. \n\nIt does not contain a media player and it does not associate file-types.\nWith this package installed you will be able to use any media player, limited only by the players' capabilities, to play all movies and video clips.\nStreaming video is supported in several formats in all popular web browsers.\nUsers of VCP have the ability to choose what is installed and where to install it using the public redistributable. After installation you can select to remove specific portions without removing the entire package.\nYou can also re-add the removed items at any time.\n\n\nThis package supports 18 localizations.\nThe default is English and the installer includes support for the following other languages; Chinese Simplified/Traditional, Japanese, Czech, Dutch, Finnish, French, German, Greek, Italian, Norwegian, Portuguese, Russian, Spanish, Polish, Swedish and Turkish.\nLanguages can be added upon request.\n\n\nUNINSTALL YOUR OLD VERSION  - upgrades are enabled but not recommended\n\n\nChangelog:\n\n\nUpdate FFDShow rev 2936\n\nUpdate Gabest rev 1093\n\nUpdate settings application\n\nFix false virus reports uninst.exe","torrent":{"xt":"urn:btih:803935ecfeb4f418ecec2ea03f9c84511cbc8226","amp;dn":"Vista+Codec+Package+5.2.4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"803935ecfeb4f418ecec2ea03f9c84511cbc8226","infoHashBuffer":{"type":"Buffer","data":[128,57,53,236,254,180,244,24,236,236,46,160,63,156,132,81,28,188,130,38]},"announce":[],"urlList":[]}}