{"title":"EVE Online: LV Comments on Teamspeak After Losing Their Titan Bu","uid":3620112,"size":20165094,"categoryP":"audio","categoryS":"sound_clips","magnet":"?xt=urn:btih:80a37c40c06fabe217efe04d54f98251029a1370&amp;dn=EVE+Online%3A+LV+Comments+on+Teamspeak+After+Losing+Their+Titan+Bu&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"gaiusmuhammad","files":3,"time":1171666129,"description":"EVE Online:\n\nJV1V: THE PORNOGRAPHIC FALLOUT OF A TITANIC ABORTION\n &lt;a href=&quot;\nhttp://www.kugutsumen.com/showthread.php?t=249&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.kugutsumen.com/showthread.php?t=249&lt;/a&gt;\n\nQuote:\nOriginally Posted by The Mittani\nJV1V: THE PORNOGRAPHIC FALLOUT OF A TITANIC ABORTION In chronological order. Once it happened, Lotka.org went into &amp;#039;full no-negative post lockdown&amp;#039; because censorship will really save you! As a result most of the whining is on corp forums and channels, which is difficult to leak for the risk of timestamping agents.\n\nAnnouncement of the CTA:\n\nQuote:\n\nMembers of Lotka Volterra, the time has come for us to show our worth in the eve universe. It is time.... We shall stand our ground and fight!\n\nI urge all pilots accross all aspects of the allaince to help in the defence of our home system jv1v. Our enemy forces think they have gained one on us, think they can make a decisive blow on us under the cover of night. We shall move to jv1v in force, we shall deploy our capital ships, we shall decimate anyone who stands in our way.\n\nAll avaliable pilots i request you to be in tenerifis area ready for deployment. ALL capital ships pls move urself to this area, and report to LVCAPFLEET. Everyone else pls come in one of the following:\n\nBS - Sniper\nBS - Neutralising and nossing\nBC - gang mods\nCruisers/hacs/recons - anit support\nInterdictors - Fit a cloak pls\nCov ops - have probes and be ready to scan capitals\nInterceptors - fit for anit support also\nEverything else\n\nYes the timing of the POS could have been better, could have been easier, i dont see this as a a bad situation, this is a challange, this is our day........\n\nThis is Lotka Volterra\n\nGhost Reaper\n\n---\n\nloosing systems wont cause an alliance to fall\nloosing posses wont cause an alliance to fall\nloosing ships wont cause an alliance to fall\nlossing titans wont cause an alliance to fall\n\nlooking for somebody to blame after something didn&amp;#039;t went the way tou want dous cause an alliance to fall\n\npeople who say &quot;What moron fucked up like this?&quot; bring us closer to falling\npeople who say &quot;What can I do to prevent stuff like this to happen and how can I help to solve the current situation&quot; have gotten us in the position we are in now\n\nWe are one off the strongest alliances in eve and maintain our space under constant presure being outnumbered 5 to 1\n\nI will be waking up 2 hours earlyer to help defending the pos before i go to colege tomorrow\nI would like to see all euro timezone peeps to at least try to do the same\n\ncya all tomorrow\n\n---\n\nSo we lost one station in GB- and what I heard BoB another somewhere other side of galaxy... IF Red Coalition even has balls to show up tomorrow no one will remember 15Th Feb and those two stations but 16Th Feb and how whole universe trembled when Davit slayed Goliath in the greatest combined capital+support fleet battle EvE has ever seen.\n\nI dont care if the odds will be 5:1, tomorrow is the day we stand up and show what it means to be LV. If we take heavy losses, so be it. If the whole screen is red from hostiles, so be it. But God help us If we start running now, we just might all go in Jita mine Velds what I care.\n\n\n\nAs a side note, could who ever runs the industry in station provide us ready fitted frigs and cruisers to some POS so that if and when someone looses ship he doesn&amp;#039;t have to leave system for new one?\n\n---\n\nGet Shrike and Chow in there... One on the gate, one on the station\n\nDDD ^_^ even then we can get cov ops and snipers to the safe people after we get 10 people probing people out.\n\nBut atleast get Chow in JV1, then Nerf him on the KB\nBefore they lost:\n\nQuote:\nHmmm, all the moaning on Eve-o.\n\nWhen LV&amp;Coalition where attacking RA, did we not suffer the same node drops that the gooniesquad are now facing. It was proved then that the servers cannot handle large engagements, why do they think it would be any different now?\nWe break the camp:\n\nQuote:\nApparently, RA has cyno&amp;#039;d in 20 cap ships, they are shooting at the POS right now. All of our Caps are unable to log in.\n\n---\n\nhow the fuck can this happen?\n\n---\n\nThis is bullshit. I haven&amp;#039;t been able to log on for like 3 hours...and they are gonna destroy our pos? Shit better be reimbursed.\n\n---\n\nIf not this game is so fucked up I might just quit on this fucking char and go do missions in empire with my alt\n\n---\n(This post is by LordInvisible, Mr. ?Crash the Node? himself)\nthis is fucking sad!\n\nI&amp;#039;ve logged on at 4.09am, got crashed at 4.36, and now, 7.32am i still couldnt log in. SO that is 3hours of watching at logon screen!!\n\nIf this is not undo by devs, i am canceling my account..\n\n---\n\nI&amp;#039;m sure it is a combination of me being tired from staying up so late and for the fucked upness of staring at a black screen for 3 hours. But this is the first time in any online game that I&amp;#039;m actually considering cancelling as well.\n\n---\n\nThis would not hurt half so badly if we&amp;#039;d actually gotten to fight. To just lose it while staring at a login screen for three hours leaves me feeling very frustrated.\n\n---\n\n\nWhat fucks me up is not beign able to log those capships in. We didn&amp;#039;t stand a chance when almost all of our caps where unable to perform. Especially titan and all the hostiles in the gate boubbles.\n\nAlso node going down on critical moments (gate) and series of nodecrashes later on basicly forced 1/3 of our pilots to leave for work.\n\n---\n\nFrustrations aside, how can you beat an enemy that gets login advantage because of where they are geographically or because they spend serious coin on a T1 line for all of them to use?\n\nAt this stage of the game, if RA can login all their cap ships, while our logins sit at the back of the queue and we stare at black screens; the game is broken, and I hardly ever say a game is broken. We play to beat the players, not the server setup.\n\nSad.\n\nSoldiers, march on.\nThe aftermath:\n\n\n\nQuote:\nLadies and Gentlemen,\nAs I am sure that you are aware of by now, a coalition of RA and pals got their way through to lag-lockdown and took out the POS at Planet 4 Moon 1. There are a couple points that must be made in this regard.\n\n1. Your alliance leaders will/are dealing with this situation and will be working with CCP to assure that our loss is recovered.\n\n2. You should not log into JV1V-0 for a while due to the absolute control that RA and pals have. Showing up in space is a meal ticket for them to blow your ship up and cause you to file another petition which would only slow down the process of getting what we have &quot;lost&quot; tonight reclaimed.\n\n3. There will be NO posting on the eve-o forums in ANY regard to tonight&amp;#039;s events. We need CCP to maintain their respect for us as an alliance, and any flame by us would only decrease the probability that we are reimbursed for this fault in game mechanics.\n\n4. There will be NO negative posting on these forums. It will only be used as a rally for goons and their buddies.\n\nDo not be confused, what we did tonight was nothing short of amazing. We had a system completely locked down and amassed a capital fleet that would make the Spanish Armada turn around. I cannot express in words my absolute pride in this evening&amp;#039;s events. What we showed EVE tonight was a TRUE alliance. We had Americans skipping class, calling off work and staying up past bedtimes. We had europeans setting their alarms for hours of the morning that would make even the eldery cringe. It is not humanly possible for me to be more proud of what my alliance ticker says. We did exactly what we were supposed to do, and rest assured that your alliance leadership, who are some of the most seasoned and knowledgeable players in all of EVE, will handle this situation professionally, and rapidly.\n\nAgain, let me reiterate how absolutely proud of every single member of this alliance. If we have lost anything, it was only the ability to engage in the most massive and epic battle that the game has ever seen. It is too bad.... that would have been a lot of hostile wrecks.\n\nLV FTW!\n\nAgmar\n\n---\n\nThis is exaclty the kind of post i expected to find on LV forum.\n\nI&amp;#039;m proud of being a member of this fantastic alliance.\n\nOff to work.\n\n---\n\nI am very proud to be part of a REAL WORLD WIDE ALLIANCE.\n\nLotka Volterra FOREVER!\n\n---\n\nThank you for posting this I was about to do so myself.\nI know we are all concerned that things were taken out of our control but please trust the LV leaders we are not going to allow this to happen and will be meeting later to formulate the correct response to CCP, to ensure this is given the best chance of a sympathtic hearing from CCP we need all our alliance members to maintain a dignified silence and allow us the CEO&amp;#039;s to deal with CCP from the highest level.\nPlease do not shoot us in the foot by running off your mouth\n\n---\n\nK, so now that my woman is happily asleep and not threatening to bash my head in with an aluminum baseball bat:\n\n1st and foremost my apologies for not being able to stay till the very end, see above :\\\n\nSecondly, a huge thanks to everyone that woke up / stayed up tonight. I &lt;3 each and every one of you for the herculean effort you put in tonight.\n\nI&amp;#039;m sure we all wish that the node would have held so we could have taken a big fucking flyswatter to the swarm, but it didn&amp;#039;t work out that way. There will be a next time. We will take it to them and we will smear them all over the fucking pavement. After tonight, that is something that I am 100% sure of.\n\nI lub all you guys and thanks for showing up in such huge numbers tonight.\n\nGO LV!!\n\n-- Psan\n\nP.S. - FU Aimez for getting to shoot at things.\n\n---\n\nI&amp;#039;m proud to have started at the same login screen as all of you.\n\nWhile that may sound like a backhand, I honestly mean it. The amount of determination and grit we showed tonight is the stuff of legends. More than anything, win or lose, I&amp;#039;d have wanted to fight and die alongside the entirety of LV; alas, jita node or not, it was not to be.\n\nWe could&amp;#039;ve done nothing more than we did. And in the end, that will be enough.\n\nNow, to call work and call in sick, and then sleep. Catch you all on the flipside.\n\n---\n\nMy wife took one look at the forum boards of somethingawful.com and told me I was fighting the good side. My wife 4tw!\n\n---\n\nNothing annoys me more than the smack on the Eve-O forums from Goon et al, referring to us as the bad guys, often comments from players less than a year old.\n\nWe know we are the good guys in this.\n\nThe continual smack is a successful recruiting drive for new players who dont know anything about LV&amp;#039;s history, and what a great alliance we are.\n\n---\n\nI was awkened by a danish guy who misstook GMT and Danish local time so woke up almsot an hour earlier than I had intented. (Yes Clipped I will keep bashing you for this until I get some sleep)\n\nI log on hoping we will have at least bit over 100 gang. I usually never played at this time but have heard our US TZ is a lot smaller than the EU TZ. I get logged on, I ask for an invite. I get into a gang and think &quot;Feck, we dont have enough numbers!!111oneeleventy&quot;. After a few minutes, when my eyes open correctly I remember to open local. Something doesn&amp;#039;t add up...... &quot;Oh, this is only our Captial ships!!!! Wooot!!!&quot; I am not going to go into what numbers we had in this semi-public forum, but it was impressive.\n\n---\n\nAny bystander will quickly see on the EVE-O boards that those smacking Goons and all are clearly not the &quot;good guys&quot;.\n\nI&amp;#039;m proud to be in Lotka Volterra.\n\n---\n\nWe did what we could &amp; what the server would let us, but the most important thing is that most of us showed up..\n\nI woke up and logged on at the exact moment of the first node crash/reset, but seeing the amount of people in alliance and on TS plus the screenies of that game camp just shows the pure dedication that we can put in for our beloved Alliance just shows.\n\nConstant node crashes/resets and we where still there infront of our screens. Would the server have been more &quot;friendly&quot; I&amp;#039;m pretty sure the evil forces would have been crushed even outnumbered that we where.\n\nAs stated, pacience, I&amp;#039;m pretty sure CCP will reimburse anything lost tonight. I would be very suprised if they didn&amp;#039;t. i just hope that this will prove once more there are a very good bunch of issues that need addressing in gamewise.\n\nI only have a couple of issues;\n\n1) TS Discipline.\nApart from the usual &quot;useless&quot; chat that pops out from time to time, I would like to ask for some people to take the time to configure there sound/voice settings so we can hear clearly. This may include me.. but you can tell me off when that happens, hence I dont speak much on TS.\n\n2) EVE-O Forums.\nAllready addressed in this very post. I&amp;#039;m extremely glad this has been clarified &amp; I do hope that people take note of it.\n\nAll in all we will prevail.\n\nLove you all.\n\n---\n\nSo we basically got screwed because people jumping into jv1 got higher priority then people logging in to jv1 ?\n\nSo what is the counter then? Keeping our capitals + BS&amp;#039;s out of the target system until the last moment and then jump in (using jump bridge for the bs&amp;#039;s) all the while keeping a token (but effective) gate camp going in the target system?\n\nI&amp;#039;m hoping CCP will decide on a course of action today that either gives us back the pos or zaps 1/3 to 1/2 of the RA cap fleet that we couldn&amp;#039;t kill because of their laggy game. For all I care RA can choose which one they want.\n\n---\n\nThe likely outcome is that we get the titan materials in JV station and have to restart production.\n\nRA still get the stopping the titan being built thing.\n\nNo one in effect loses apart from 3-4 weeks of our building time.\n\nIMHO anyway.\n\nGame is a nonsense if CCP doesnt refund this tbh , it basically gives GOONs free reign to run a gang of 1000 into every system they want to take and it will crash.\n\nVery dissappointing that CCP even allowed people to get into the system when they knew it was fucked.\n\nAnyway , if we dont get it back then we dont need to sit on the POS for a further 4 weeks. Gives us a chance to go bring some hurt to those who choose to attack us\n\n---\n\nHow much time was left on the titan?\n\n---\n\n25+ days I think , cant exactly remember\n\n---\n\nLet&amp;#039;s do the same to them...attack their systems en masse so we can give them some node crash-caused losses!\n\n---\n\neven if we get nothing back, it will only strengthen my resolve to beat this &quot;coalition&quot;. Despite looking at the entering game screen for 3 hours this morning it was amazing to see such comitment from everyone. I cant see an alliance like ours with such determination to fall through normal gameplay mechanics.\n\n---\n\nAs I have posted on UKC internal forums I have noted every single band wagon alliance and corp that posted thier virulent blind ignorant hate-filled drivel and once I get online (is that possible now?) barring any operational orders from UKC/LV command I am going to grab any pilots willing to fly and begin visiting thier systems and ganking the living shit out of anything unlucky to be in my path\n\nAnd that includes lo-sec empire too. Bye bye sec status baby\n\nLook...I&amp;#039;m one of the grunts here. I witnessed the entire thing from 2300 or so thru 0600 when I finally called it a night/day after 2 hours of black screen. I heard it all and saw it all....and even managed to get a solo kill on some tools rifter before the initial node crash. All I witnessed were 400+ LV and pals in local defending our space with heads held high and morale through the roof. We were spoiling for a fight regardless of the outcome (and based on the first Goon wave going poof like it did I think we would have held our own in the end).\n\nOur leadership was there...the FC&amp;#039;s did what they could under horrible circumstances...and it must be said there was NEVER a hint of us using any sort of exploit. Ignore the eve-o short bus kiddies....they don&amp;#039;t know shit and trust our alliance leaders to get some sort of resolution with CCP.\n\n&quot;That which does not kill us makes us stronger&quot;\n\nAnd LV is strong indeed\n\n---\n\n&lt;3 to Psan and Aimez for running the fleet last night while it lasted. I guess it was wishful thinking to believe we had a chance at a fair (as in having the game work as intended) fight to defend our system.\n\n---\n\nA big thanks to everyone who showed up and an even bigger thanks to those who FC&amp;#039;d the lag won again it seems, would of been some good fights if we could log in.\n\nwe held that gate for a long time, well after our prime time and well into theirs we, as LV and allies, should be proud of what we managed to do in that system and i firmly believe we would of continued to hold the gate had the node of held.","torrent":{"xt":"urn:btih:80a37c40c06fabe217efe04d54f98251029a1370","amp;dn":"EVE+Online%3A+LV+Comments+on+Teamspeak+After+Losing+Their+Titan+Bu","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"80a37c40c06fabe217efe04d54f98251029a1370","infoHashBuffer":{"type":"Buffer","data":[128,163,124,64,192,111,171,226,23,239,224,77,84,249,130,81,2,154,19,112]},"announce":[],"urlList":[]}}