{"title":"Daryl.Hall.Live.from.Daryl's.House.Part.20.WebRip.[PSoul]","uid":4956947,"size":216416795,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:857f78a507adf440ce4ba6ab2d5bc43700a4c9d5&amp;dn=Daryl.Hall.Live.from.Daryl%5C%27s.House.Part.20.WebRip.%5BPSoul%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"PhillySoul","files":7,"time":1245157693,"description":"Live from Daryl's House Part 20 (WebRip)\n\nLandmark 20th edition of acclaimed web show features Daryl and Mercury Records group with #1 iTunes album singing its hit &quot;She Is Love,&quot; Daryl Hall &amp; John Oates classics\n\nNEW YORK, June 09, 2009 - Marking the 20th episode of his critically acclaimed online series Live From Daryl's House, Daryl Hall invited Mercury Records rockers (and longtime Daryl Hall and John Oates fans) Parachute to join him, in a brand-new installment which debuts June 15 at www.livefromdarylshouse.com, where it can be seen along with archived footage of past episodes.\n\nThe Charlottesville, VA-based band recently climbed to #1 on the iTunes album charts with their debut, Losing Sleep, and hit single, &quot;She Is Love,&quot; one of seven songs the five-piece band performed with Daryl Hall for the show. &quot;She Is Love&quot; was also featured in the national television advertising campaign for Nivea Body's Smooth Sensations, while the group has had its music spotlighted on such shows as 90210 and One Tree Hill, with a recent performance on the CBS Early Show.\n\nWill Anderson, the group's vocalist/guitarist and piano player, was thrilled by the experience. &quot;Getting to do Live From Daryl's House was amazing,&quot; he enthused. &quot;We had an absolute blast singing some of the Daryl Hall and John Oates songs I grew up listening to and hope we'll get to jam with Daryl and the guys again soon!&quot;\n\nParachute (www.weareparachute.com), which also includes saxophone player/keyboardist Kit French, bassist Alex Hargrave, drummer Johnny Stubblefield and lead guitarist Nate McFarland, performed four of their own songs with Daryl, including, in addition to &quot;She Is Love,&quot; &quot;Under Control,&quot; &quot;All That I Am&quot; and &quot;She,&quot; two Daryl Hall and John Oates classics, &quot;It's a Laugh&quot; and &quot;Say It Isn't So,&quot; as well as a rousing cover of Junior Walker's &quot;Shotgun.&quot;","torrent":{"xt":"urn:btih:857f78a507adf440ce4ba6ab2d5bc43700a4c9d5","amp;dn":"Daryl.Hall.Live.from.Daryl%5C%27s.House.Part.20.WebRip.%5BPSoul%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"857f78a507adf440ce4ba6ab2d5bc43700a4c9d5","infoHashBuffer":{"type":"Buffer","data":[133,127,120,165,7,173,244,64,206,75,166,171,45,91,196,55,0,164,201,213]},"announce":[],"urlList":[]}}