{"title":"Rob Forbes: Ways of seeing","uid":4651534,"size":58817165,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:85c43fff62c6062ce201d38e06bead3f4c010b8a&amp;dn=Rob+Forbes%3A+Ways+of+seeing&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"the_Phyrexian","files":-1,"time":1232058902,"description":"Rob Forbes, the founder of Design Within Reach, shows a gallery of snapshots that inform his way of seeing the world. Charming juxtapositions, found art, urban patterns -- this slideshow will open your eyes to the world around you.\n\nA decade ago, if you wanted to buy a piece of classic modern furniture for your house -- say, a classic Eames chaise longue -- you had basically two options: make friends with a commercial office designer who could order you a piece from the supplier, or wait until your neighborhood psychiatrist redecorated his office and put all the 1960s-vintage Eames chairs out on the curb. Rob Forbes, a potter with a background in retail, saw a market for clean, modern design made available to regular people, and turned this idea into the brilliant nationwide chain and catalog Design Within Reach.\n\nAlong with new and classic home goods, DWR became a platform for Forbes' way of seeing. The early-2000-vintage DWR newsletters were packed with colorful images from Forbes' travels and news about designers he loved. And this is not to forget each holiday's annual champagne chair contest -- in which DWR fans were challenged to create a miniature modern masterpiece from the foil, wire and cork of a bottle of bubbly.\n\nIn July 2007, Forbes left DWR to focus on a new project that will blend design and retailing: Studio Forbes. Get details via the link at right -- and yes, you'll also find another wonderful Forbes image gallery.\n\n    &quot;He promotes good design, not just as a retailer but as a missionary -- in lectures around the world and in his intelligent and eloquent DWR internet newsletter.&quot;\n\n2003 Russel Wright Awards\n___________________________________________________________________________________\nplease leave a comment if you want, this is just to show what is out there...\nAnd before you go and spam, dl it watch it and make up your own mind...\ncheers the_phyrexian\n\nAre you a British citizen? Click here! (Petition to stop Sharia Law)\n &lt;a href=&quot; http://petitions.number10.gov.uk/shariastop&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://petitions.number10.gov.uk/shariastop&lt;/a&gt;\t\n\nthere is a reseed section, read it / use it...\n &lt;a href=&quot; http://suprbay.org/forumdisplay.php?f=35&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://suprbay.org/forumdisplay.php?f=35&lt;/a&gt;\n\nor visit my blog...\n &lt;a href=&quot; http://thephyrexian.tk&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://thephyrexian.tk&lt;/a&gt;","torrent":{"xt":"urn:btih:85c43fff62c6062ce201d38e06bead3f4c010b8a","amp;dn":"Rob+Forbes%3A+Ways+of+seeing","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"85c43fff62c6062ce201d38e06bead3f4c010b8a","infoHashBuffer":{"type":"Buffer","data":[133,196,63,255,98,198,6,44,226,1,211,142,6,190,173,63,76,1,11,138]},"announce":[],"urlList":[]}}