{"title":"METRO 2033","uid":5452559,"size":6807160832,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:870afe48d9a4689d54b2e9ffa1f05102fe872f62&amp;dn=METRO+2033&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"saferot65","files":1,"time":1269231928,"description":"In 2013 the world was destroyed by a global catastrophe that destroyed the population of the Earth and turn it into a surface in the poisoned wasteland. A handful of survivors found refuge in the depths of the Moscow metro, and human civilization has again plunged into the Dark Ages.\n\nNow the yard 2033rd year. An entire generation of people born and raised under the ground, watching as their besieged city subway fight for survival with each other and with the nightmarish mutants that are waiting outside.\n\nThe atmospheric first-person shooter, created based on the bestselling Dmitry Glukhovski. Game &quot;Metro 2033&quot;, which the unfolding events in the devastated post-apocalyptic Moscow subway - a dismal history of severe survival, where the fate of humanity is in your hands.\n\nYou - Artem, ordinary Muscovite, born before the world apocalypse, but grew up under the ground. Never before had he not leave the limits of their own, already has become home to him the subway station, but fate decided differently. Now he is forced to carry out the mission throughout his life: to get to the center of the Moscow Metro and the remnants of human society to warn of the impending danger, or die in a way and to condemn the survivors to certain death.\n\nBecome a hero of the book, and go on their way Artem, determine the fate of humanity!\n\nCrack inside!","torrent":{"xt":"urn:btih:870afe48d9a4689d54b2e9ffa1f05102fe872f62","amp;dn":"METRO+2033","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"870afe48d9a4689d54b2e9ffa1f05102fe872f62","infoHashBuffer":{"type":"Buffer","data":[135,10,254,72,217,164,104,157,84,178,233,255,161,240,81,2,254,135,47,98]},"announce":[],"urlList":[]}}