{"title":"500 days of summer.avi","uid":5221906,"size":729190400,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:8746a4fe54fb647d67f4272cbf51bf2ab1401f4b&amp;dn=500+days+of+summer.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Vi4or","files":1,"time":1260924337,"description":"(500) Days of Summer is a 2009 American romantic comedy film. It was written by Scott Neustadter and Michael H. Weber, directed by Marc Webb, produced by Mark Waters, and stars Joseph Gordon-Levitt and Zooey Deschanel. Principal photography began in April 2008 in Los Angeles, California.\nThe film made its debut at the 2009 Sundance Film Festival and was a hit with festival audiences. It was picked up for distribution by Fox Searchlight Pictures and opened in US and Canadian limited release on July 17, 2009, later expanding to wide release in the US on August 7, 2009. The film was also released on September 2, 2009, in the Republic of Ireland and the United Kingdom, and opened in Australia on September 17, 2009.\nThe film proved a critical and commercial success, with widespread praise and over $40 million in worldwide returns on a $7.5 million budget. The film received numerous awards and nominations, with Scott Neustadter and Michael H. Weber later receiving the 2009 Hollywood Film Festival's Breakthrough Screenwriter Award, as well as being named as one of the ten best movies of the year by the National Board of Review Awards 2009. The film also received two nominations at the 67th Annual Golden Globe Awards, for Best Picture (Musical or Comedy), and a nomination for Joseph Gordon-Levitt for Best Actor, Musical or Comedy.","torrent":{"xt":"urn:btih:8746a4fe54fb647d67f4272cbf51bf2ab1401f4b","amp;dn":"500+days+of+summer.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8746a4fe54fb647d67f4272cbf51bf2ab1401f4b","infoHashBuffer":{"type":"Buffer","data":[135,70,164,254,84,251,100,125,103,244,39,44,191,81,191,42,177,64,31,75]},"announce":[],"urlList":[]}}