{"title":"El Diario De Ellen Rimbauer [DVDRip] [Spanish]","uid":4471058,"size":734433290,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:87e0e62ed7be3b770fc6d36c5529ee33cd5a1c3d&amp;dn=El+Diario+De+Ellen+Rimbauer+%5BDVDRip%5D+%5BSpanish%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Mois20","files":2,"time":1225132184,"description":"Misterio Descubre la pelÃƒÂ­cula en la que se basÃƒÂ³ el ÃƒÂ©xito de Stephen King &quot;La mansiÃƒÂ³n de Rose Red&quot; . &quot;El diario de Ellen Rimbauer&quot; nos descubre los aterradores comienzos de la construcciÃƒÂ³n de una enorme mansiÃƒÂ³n que cobra vida y el misterioso matrimonio que habita en ella a principios del siglo XX.Los estremecedores pasajes del diario nos van descubriendo una serie de encuentros mortales que transformarÃƒÂ¡n a Ellen (Lisa Brenner) de una inocente y sumisa esposa, en una mujer poseÃƒÂ­da por las fuerzas del mal que habitan en la mansiÃƒÂ³n. En El DIARIO DE ELLEN RIMBAUER, la historia se centra en la tormentosa relaciÃƒÂ³n de la protagonista y su inseparable Sukeena con el marido de la primera: un hombre corrompido por la lujuria, alcohÃƒÂ³lico y uno de los hombres mÃƒÂ¡s influyentes del Seattle de finales del siglo pasado. A este triangulo se suma la gran mansiÃƒÂ³n, que pasa a convertirse en un personaje tan importante ?o incluso mÃƒÂ¡s- que cualquiera de los anteriores. Su posesiva y celosa relaciÃƒÂ³n con Ellen (Lisa Brenner) es lo que desencadena la turbia y dramÃƒÂ¡tica historia de este edificio. El personaje de Sukeena, que vuelve a ser protagonizado por la escalofriante Tsidii Leloka, es quien sufre mÃƒÂ¡s variaciones respecto a la novela. En ÃƒÂ©sta, Sukeena era mostrada como una aborigen que poco a poco iba occidentalizÃƒÂ¡ndose. Sin embargo, en la pantalla es presentada de comienzo como una mujer educada, culta y que habla el idioma de los Rimbauer a la perfecciÃƒÂ³n. Sin duda, El diario de Ellen Rimbauer es un tÃƒÂ­tulo muy entretenido que gustarÃƒÂ¡ a los aficionados a las mansiones encantadas. ","torrent":{"xt":"urn:btih:87e0e62ed7be3b770fc6d36c5529ee33cd5a1c3d","amp;dn":"El+Diario+De+Ellen+Rimbauer+%5BDVDRip%5D+%5BSpanish%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"87e0e62ed7be3b770fc6d36c5529ee33cd5a1c3d","infoHashBuffer":{"type":"Buffer","data":[135,224,230,46,215,190,59,119,15,198,211,108,85,41,238,51,205,90,28,61]},"announce":[],"urlList":[]}}