{"title":"MKV Converter Studio v2.0.1[Activated]","uid":5611794,"size":26496000,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:8bafbe5288a42a8b14ea2d5692184003907c3bf7&amp;dn=MKV+Converter+Studio+v2.0.1%5BActivated%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"dario_high","files":-1,"time":1275905426,"description":"MKV Converter Studio v2.0.1\nMKV Converter is the best software to convert MKV files with subtitles. This MKV Converter can convert MKV to any video or audio formats like AVI, MP4, Divx, DVD Video, MPEG, and WMV. MKV Converter also supports converting videos to iPod, iPhone, Zune, PSP, MP4 player and other digital devices.\n\n\nKey Features\n\nPowerful MKV Converter\n\nBest way to convert MKV files; support MKV to AVI, MKV to MP4, MKV to WMV, MKV to Divx. Also support other MKV to other video formats like (H.264/AVC, WMV, DivX, MP4, XviD and MOV, etc). Also help you convert MKA to audio formats like MP3, WMA, AAC, OGG, M4A etc.\n\nSupport MKV Subtitles Editing\n\nYou can load external subtitle file or embedded subtitle for the MKV video when converting, support formats like .srt . sub .ssa .ass .smi .psb .tex .idx etc.\n\nAudio track conversion settings;\nYou can choose an audio language track that is inside the MKV video.\n\nConvert MKV and Compatible with any mobile devices\n\nThe final video you convert from MKV file will be completely compatible with any digital player like iPod, iPhone, MP4 player, Zune, PSP etc.\n\nMerging MKV file into video with batch mode\n\nYou can convert several MKV file into one video file with Merging, and support converting several MKV files at a time, you can call this batch conversion process.\n\nCrop, Trim and Convert MKV video\n\nYou can capture images from the MKV video to your computer as JPEG or bmp, cropping and trimming mkv file before converting to other video formats.\n\nConvert MKV with excellent quality and super fast speed.\n\nOffers your best videoand fast conversion speed, this extremely useful for this who want to Convert MKV files:\n\nConvert MKV to AVI video, Convert MKV to DVD Video, Convert MKV to Divx Video, Convert MKV to WMV Video.\n\nHOMEPAGE: &lt;a href=&quot;\nhttp://www.convertmkv.net/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.convertmkv.net/&lt;/a&gt;","torrent":{"xt":"urn:btih:8bafbe5288a42a8b14ea2d5692184003907c3bf7","amp;dn":"MKV+Converter+Studio+v2.0.1%5BActivated%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8bafbe5288a42a8b14ea2d5692184003907c3bf7","infoHashBuffer":{"type":"Buffer","data":[139,175,190,82,136,164,42,139,20,234,45,86,146,24,64,3,144,124,59,247]},"announce":[],"urlList":[]}}