{"title":"atlantis III the new world ps2","uid":4897297,"size":3822850327,"categoryP":"games","categoryS":"psx","magnet":"?xt=urn:btih:8c45d016bce591c43c6d39fe7215104a2475aad0&amp;dn=atlantis+III+the+new+world+ps2&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"thenoobish","files":3,"time":1242413677,"description":"Games : Playstation 2 : Full Game : English\n\nIn Atlantis III: The New World, the Egyptologist (Mastroianni), searches for a metropolis (Atlantis) built by the ancient Egyptians located near a mysterious well. She is fascinated by the very existence of the lost city of Atlantis because it is still undiscovered and is a long way from her native Egypt.\n\nAlong her journey she is befriended by the handsome Tuareg, a loner who lost his family some years ago and decided to turn his back on the modern world to live as his ancestors before him. Refusing to leave our beautiful heroine alone in the desert, he decides to accompany her on her mysterious and dangerous quest for the lost city. 3\n\nAtlantis, an age-old legend that has survived eras, carries mysterious images of its undiscovered city, in its entire splendor and apocalypse. Like it's predecessors, Atlantis III brings a brand new quest in an even stranger world marked with eternal beauty and a web of intrigue.\n\nFrom the grand palaces of the Thousand and One Nights to the Hoggar desert, from the Egyptian Book of the Dead to the icy plains of the Palaeolithic, the heroine of Atlantis will guide the player of the game to his or her final destination. Do the former Atlantians still exist?\n\nWhat is the extraordinary power that would change the destiny of humanity forever? How many challenges must be faced before the truth about the lost city is eventually revealed?\n\nPAL\n\nfrom www demonoid,com","torrent":{"xt":"urn:btih:8c45d016bce591c43c6d39fe7215104a2475aad0","amp;dn":"atlantis+III+the+new+world+ps2","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8c45d016bce591c43c6d39fe7215104a2475aad0","infoHashBuffer":{"type":"Buffer","data":[140,69,208,22,188,229,145,196,60,109,57,254,114,21,16,74,36,117,170,208]},"announce":[],"urlList":[]}}