{"title":"David Weber - Safehold 07 - Like a Mighty Army","uid":9701394,"size":1585551582,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:8ccef9dbf4c4342b8e5df70a9b15edd03d6def6c&amp;dn=David+Weber+-+Safehold+07+-+Like+a+Mighty+Army&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"bbwizard","files":44,"time":1394001434,"description":"Safehold Volume 7 - Like a Mighty Army\nby David Weber\nRead by: Oliver Wyman\nDuration: 27:33:06\nQuality: MP3 44Khz, 128kb CBR Joint Stereo\n\nNOTE: This is a direct rip from the CD's. \n\nNOTE: The directory labeled 'cues' holds .cue files which will split the 21 CD's into 84 chunks of approximately 20 minutes each (give or take a little to be sure they split between sentences), if you use them with mp3DirectCutSome players react better with shorter segments. Just ignore them if you don't want that.\n\nDescription:\n\nFor centuries, the world of Safehold, last redoubt of the human race, lay under the unchallenged rule of the Church of God Awaiting. The Church permitted nothing new-no new inventions, no new understandings of the world.\n\nWhat no one knew was that the Church was an elaborate fraud-a high-tech system established by a rebel faction of Safehold's founders, meant to keep humanity hidden from the powerful alien race that had destroyed old Earth.\n\nThen awoke Merlyn Athrawes, cybernetic avatar of a warrior a thousand years dead, felled in the war in which Earth was lost. Monk, warrior, counselor to princes and kings, Merlyn has one purpose: to restart the history of the too-long-hidden human race.\n\nAnd now the fight is thoroughly underway. The island empire of Charis has declared its independence from the Church, and with Merlyn's help has vaulted forward into a new age of steam-powered efficiency. Fending off the wounded Church, Charis has drawn more and more of the countries of Safehold to the cause of independence and self-determination. But at a heavy cost in bloodshed and loss-a cost felt by nobody more keenly that Merlyn Athrawes.\n\nThe wounded Church is regrouping. Its armies and resources are vast. The fight for humanity's future isn't over, and won't be over soon...\n","torrent":{"xt":"urn:btih:8ccef9dbf4c4342b8e5df70a9b15edd03d6def6c","amp;dn":"David+Weber+-+Safehold+07+-+Like+a+Mighty+Army","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8ccef9dbf4c4342b8e5df70a9b15edd03d6def6c","infoHashBuffer":{"type":"Buffer","data":[140,206,249,219,244,196,52,43,142,93,247,10,155,21,237,208,61,109,239,108]},"announce":[],"urlList":[]}}