{"title":"Gravetemple - The Holy Down - FLAC - sunn O)))","uid":5353747,"size":341692552,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:8ce64e0b9157eee27c5a25ab95f8dace1c6ed19c&amp;dn=Gravetemple+-+The+Holy+Down+-+FLAC+-+sunn+O%29%29%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"fiaj","files":4,"time":1265871346,"description":"Gravetemple consists of Australian experimentalist Oren Ambarchi, Stephen O'Malley (of sunn O))) and KTL) and hungarian vocal legend Attila Csihar (of VOV, sunn O))), Mayhem etc.).\n\n This intense first release was recorded live in Tel Aviv, Israel in the midst of the second Lebanon war and makes a powerfully atmospheric listen.  The sound is similar to the later sunn releases with Csihar, but with more focus on ambience and build up. This is one that needs to be played loud in a candle lit room where you can really let the music take you.\n \n The CD was limited to 3000 copies and won't be around for long so if you like the album get your copy fast!! I could only find MP3 rips which ruin the albums sound and feel due to compression, so hopefully people will get more enjoyment from the FLAC.\n\nI will also be posting the other two Gravetemple offerings, Ambient/Ruin and Le Vampire de Paris (both limited to 350 copies and long gone) in lossless when this has spread so if you like their stuff check back and help keep it seeded!!\n\n I can only get online off peak (7.00pm-7.00am GMT) and my phone is my modem so appologies for the slow speed, if everyone seeds after downloading this won't be a problem for long and i will give you more great music, so help out!!","torrent":{"xt":"urn:btih:8ce64e0b9157eee27c5a25ab95f8dace1c6ed19c","amp;dn":"Gravetemple+-+The+Holy+Down+-+FLAC+-+sunn+O%29%29%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8ce64e0b9157eee27c5a25ab95f8dace1c6ed19c","infoHashBuffer":{"type":"Buffer","data":[140,230,78,11,145,87,238,226,124,90,37,171,149,248,218,206,28,110,209,156]},"announce":[],"urlList":[]}}