{"title":"Tesla - Fallin' Apart","uid":5003284,"size":152680452,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:8daefc368047bd3080a02a3aa7c9f56c0a4d5ff8&amp;dn=Tesla+-+Fallin%5C%27+Apart&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":-1,"time":1247611535,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 256 kbps\n\n\nForever More is the eighth studio album by hard rock band Tesla, released on October 7, 2008}. The album was produced by Terry Thomas, engineered by Michael Rosen, and recorded and mixed at J Street Recorders in Sacramento, California by Terry Thomas and Michael Rosen.\n\nTesla is an American hard rock band formed in Sacramento, California in 1984. They have sold 6 million albums in the United States as of 2008.\n\nTesla have recorded a covers album titled Real to Reel, which was released on June 5, 2007. The recording is available as a 2 CD set. The first CD (containing 13 songs) is sold in a case with a blank slot for the second CD. The second CD (containing 12 additional songs) will initially be available to concert goers in the USA at no additional charge beyond the cost of a ticket. The second CD was also given away with the August edition of Classic Rock magazine in Europe.\n\nAt the end of August Tesla announced their first world tour in 16 years with dates in Australia, Japan, and Europe in October and November 2007.\n\nIn February 2008, Tesla helped fund and headlined a benefit concert for victims of the Station nightclub fire. The show was broadcast by VH1 Classic. Tesla played three songs: &quot;What You Give&quot;, &quot;Signs&quot;, and &quot;Love Song&quot;, though &quot;What You Give&quot; did not make it onto the broadcast.\n\nIn June and July 2008, Tesla played few shows in Europe and in the USA, including Sweden Rock Festival, Graspop Metal Meeting and Rocklahoma.\n\nOn August 11, 2008, it was reported that Tesla's next album, entitled Forever More, would be released on October 7th on their own record label, Tesla Electric Company Recordings. The album was produced by Terry Thomas, who produced Bust a Nut. The band aired the album's first single, &quot;I Wanna Live&quot; on radio stations across the globe on August 18th and kicked off a world tour on October 1st.\n\nIn 2009, it was announced that Tesla will be among the performers on the cruise ship &quot;ShipRocked&quot; in November 2009. \n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:8daefc368047bd3080a02a3aa7c9f56c0a4d5ff8","amp;dn":"Tesla+-+Fallin%5C%27+Apart","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8daefc368047bd3080a02a3aa7c9f56c0a4d5ff8","infoHashBuffer":{"type":"Buffer","data":[141,174,252,54,128,71,189,48,128,160,42,58,167,201,245,108,10,77,95,248]},"announce":[],"urlList":[]}}