{"title":"Rounders (DVD-Rip)  (X-Vid) 8-27-07 Please Seed (Tuberok).avi","uid":3787027,"size":832374252,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:8f817a1c40b67391241d16704eb0cbdd8bde8252&amp;dn=Rounders+%28DVD-Rip%29++%28X-Vid%29+8-27-07+Please+Seed+%28Tuberok%29.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"tuberok","files":1,"time":1188309587,"description":"Rounders (1998)\nadvertisement  photos   board   trailer   details  \n\nRegister or login to rate this title User Rating: 7.2/10 (25,632 votes) \nmore \n\n\n--------------------------------------------------------------------------------\n \n\nDirector:John Dahl\n\nWriters (WGA):David Levien (written by) &amp;\nBrian Koppelman (written by)\n\nRelease Date:11 September 1998 (USA) more \nGenre:Drama more \nTagline:You\\&amp;#039;ve got to play the hand you\\&amp;#039;re dealt. more \nPlot Outline:A young man (Damon) is a reformed gambler who must return to playing big stakes poker to help a friend pay off loan sharks. \nPlot Synopsis:This plot synopsis is empty. Add a synopsis \nPlot Keywords:Truck Driver / Loan Shark / Strip Joint / Loud Shirt / Thick Accent more \nAwards:1 win &amp; 1 nomination more \nUser Comments:The Son of the Cincinnati Kid Rides Again! more \n\n--------------------------------------------------------------------------------\n(Cast overview, first billed only)\n\n Matt Damon ...  Mike McDermott \n\n Edward Norton ...  Lester \\&amp;#039;Worm\\&amp;#039; Murphy \n Paul Cicero ...  Russian Thug \n\n John Turturro ...  Joey Knish \n\n Ray Iannicelli ...  Kenny \n\n Gretchen Mol ...  Jo \n\n Famke Janssen ...  Petra \n Merwin Goldsmith ...  Sy \n\n John Malkovich ...  Teddy KGB \n\n Martin Landau ...  Abe Petrovsky \n Sonny Zito ...  Tony \n Michael Rispoli ...  Grama \n\n Melina Kanakaredes ...  Barbara \n Mal Z. Lawrence ...  Irving \n Josh Mostel ...  Zagosh \nmore\n\n--------------------------------------------------------------------------------\n \n\nMPAA:Rated R for pervasive strong language, some sexuality and brief drug use. \nParents Guide:Add content advisory for parents \nRuntime:121 min \nCountry:USA \nLanguage:English / Hebrew / Russian \nColor:Color (DeLuxe) \nAspect Ratio:2.35 : 1 more \nSound Mix:Dolby Digital / SDDS \nCertification:Iceland:12 / Argentina:16 / Australia:MA / Canada:PA (Manitoba) / Chile:18 / Finland:K-12 / France:U / Peru:14 / Portugal:M/16 / Singapore:NC-16 / South Korea:18 / Spain:13 / Sweden:11 / Switzerland:16 (canton of Geneva) / Switzerland:16 (canton of Vaud) / UK:15 / USA:R / Philippines:PG-13 \nFilming Locations:Atlantic City, New Jersey, USA more \nMOVIEmeter:  1% since last week why? \nCompany:Miramax Films more \n\n--------------------------------------------------------------------------------\n \n\nTrivia:Worm was originally supposed to smoke but avid nonsmoker Edward Norton refused. more \nGoofs:Continuity: The card player sitting across from Worm in jail removes a cigarette from his ear twice. more \nQuotes:[first lines] \nMike McDermott: Listen, here\\&amp;#039;s the thing. If you can\\&amp;#039;t spot the sucker in the first half hour at the table, then you ARE the sucker.\nmore \nMovie Connections:References Lock, Stock and Two Smoking Barrels (1998) more \nSoundtrack:Chitlins Con Carne more \n\n--------------------------------------------------------------------------------\n \nHow does it end? \nWhat is Teddy KGB holding during the final hand of heads up, when Mike flops the nut straight? \nIf Mike spotted Teddy KGB\\&amp;#039;s tell at the poker table, what was it? \nmore \n--------------------------------------------------------------------------------\n (Comment on this title) \n\n28 out of 31 people found the following comment useful:- \nThe Son of the Cincinnati Kid Rides Again!, 2 October 2001\n\nAuthor: pae-sk from Framingham MA \n\nI love this movie: the plot line is pat and predictable as it effortlessly unfolds; the characters are clearly defined and you know who to root for and who to despise; and there are no dull scenes or dead end sub-plots. Matt Damon is Mike, an affable law student with little interest in the law and a passion for high stakes poker. When he loses his shirt and promises his girl friend (cute and perky Gretchen Mol) that he will never play poker again, you know this pie-crust promise will quickly be broken. And broken it is when Matt picks up his former schoolmate buddy, \\&quot;Worm\\&quot; (Edward Norton) who is getting out of prison and leads him back to the poker table and deep, deep into debt and hot water.\n\nAs usual, Matt Damon is adorable as the talented gambler, flashing those dimples and that Gary Cooper down-turned grin; John Malkovich is over the top as cookie-munching Teddy KGB, and, yes, if you\\&amp;#039;re familiar with Russians just off the boat, you know they really DO speak like that and have a natural flare for the dramatic; Martin Landau delivers another impeccable performance as the aging, melancholic law professor whose family expected him to become a rabbi; Famke Janssen is nicely understated as the errand girl who has the obvious hots for Matt; and John Turtorro puts is solid as Knish, the grinder. Indeed, Mr. Turorro is becoming one of the most reliable and dependable supporting players to grace any film in which he appears. When the time and the role are right, his time will come.\n\nBut the real star of this film is Edward Norton as the low-life sociopath who bears the appropriate sobriquet \\&quot;Worm.\\&quot; Twenty years ago when I first saw \\&quot;The Onion Field,\\&quot; I thought James Wood had created the sleaziest character ever to appear on film. Jim, move over. Norton is cheap, slimy, and skinny, devoid of scruples and empathy, a little wise guy with a big mouth and nothing to back it up. You just KNOW this scumbag neither bathes nor brushes his teeth, and when the little rat gets the stuffings beaten out of him by a group of off-duty cops whom he has cheated, you want to join in and get in a punch. Women will want to slap him. In his first scene he lets you know he\\&amp;#039;s a hard-hearted louse: told that he is being released from prison in the middle of a penny-ante card game with his cell mates who beg him to leave his cigarettes behind, he gathers them up and then contemptuously drops them in the dumper on the way out. This is a cockroach with no redeeming social value who lives to use and con and degrade people.\n\nIt\\&amp;#039;s no trick for an actor to make you love him; to make you despise him so much you\\&amp;#039;d like to throttle him takes real talent. I\\&amp;#039;ve seen Ed Norton in \\&quot;Fight Club,\\&quot; \\&quot;Primal Fear,\\&quot; and \\&quot;The People vs. Larry Flynt\\&quot; and this is one young actor to watch. He\\&amp;#039;s one of those natural actors who can be whatever he wants to be and it will be sheer joy watching him grow and mature.\n\n\\&quot;Rounders\\&quot; may be short on originality, but it\\&amp;#039;s long on suspense, action, and entertainment and while not the best flick to come down the pike, it\\&amp;#039;s a wonderfully satisfying two hours. I don\\&amp;#039;t know much about the game of poker, but I sure do know a good movie when I see one. I give it an 8 out 10 rating for human interest. \n\n\nEnjoy!\n\nTuberok","torrent":{"xt":"urn:btih:8f817a1c40b67391241d16704eb0cbdd8bde8252","amp;dn":"Rounders+%28DVD-Rip%29++%28X-Vid%29+8-27-07+Please+Seed+%28Tuberok%29.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8f817a1c40b67391241d16704eb0cbdd8bde8252","infoHashBuffer":{"type":"Buffer","data":[143,129,122,28,64,182,115,145,36,29,22,112,78,176,203,221,139,222,130,82]},"announce":[],"urlList":[]}}