{"title":"13 days (bigboss07)","uid":4794643,"size":735279151,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:984393694136215e58cdcbd6f5ca56c0555ded2c&amp;dn=13+days+%28bigboss07%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"bigboss07","files":-1,"time":1237834651,"description":"When released in December 2000, Thirteen Days was pummeled for taking liberties with the facts of the Cuban missile crisis and smothering its compelling drama with phony Boston accents by its primary stars. More tolerant critics hailed it as one of the year's best films, and that's the opinion to believe for anyone who enjoys taut, intelligent political thrillers. For those too young to relate directly to the timeless urgency of the crisis that played out over 13 days in October 1962, Thirteen Days joins the classic TV treatment The Missiles of October (1973) as an intense and thought-provoking study of leadership under pressure.\nThe film (and costar-coproducer Kevin Costner) drew criticism for fictionally enhancing the White House role of presidential aide Kenneth O'Donnell, but while Costner's Boston accent may be grating, his fine performance as O'Donnell offers expert witness to the crisis, its nerve-wracking escalation, and the efforts of John F. Kennedy (Bruce Greenwood) and Robert F. Kennedy (Steven Culp) to negotiate a peaceful settlement with Russia. While Soviet missiles approach operational status in Cuba, director Roger Donaldson (who directed Costner in No Way Out) cuts to exciting U.S. Navy flights over the missile site, ramping up the tension that history itself provided. Donaldson's occasional use of black and white is self-consciously distracting, and he's further guilty of allowing a shrillness (along with repetitive, ominous shots of nuclear explosions) to invade the urgency of David Self's screenplay. Still, as Hollywood history lessons go, Thirteen Days is riveting stuff. You may find yourself wondering what might happen if reality presented a repeat scenario under less intelligent leadership.","torrent":{"xt":"urn:btih:984393694136215e58cdcbd6f5ca56c0555ded2c","amp;dn":"13+days+%28bigboss07%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"984393694136215e58cdcbd6f5ca56c0555ded2c","infoHashBuffer":{"type":"Buffer","data":[152,67,147,105,65,54,33,94,88,205,203,214,245,202,86,192,85,93,237,44]},"announce":[],"urlList":[]}}