{"title":"Dark Shadows the Beginning Volume One Disc One DVDRip","uid":4384272,"size":4680871936,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:98f22299267a4bee8a87b0625c721631da811e80&amp;dn=Dark+Shadows+the+Beginning+Volume+One+Disc+One+DVDRip&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Excitableboy","files":11,"time":1220828852,"description":"Episodes 1 - 35.\n\nOld and new fans of the beloved Dark Shadows will finally be able to watch how it all began as MPI Home Video rolls out the first DVD Boxed Set of six of the series&amp;#039; very first episodes. This first DVD boxed set includes the first 35 episodes of the series. \n\nSpecial features include the original commericals from the first episode, and an interview with Alexandra Moltke Isles, who played Victoria Winters, and an original Dark Shadows promo. \n\nCreator, the late Dan Curtis, literally dreamed the series. He dreamed about a young governess riding on a train en route to a dark, strange and brooding estate. Talking over his dream with his wife and family, Curtis decided to turn it into an incredible soap opera, and the rest is history. \n\nDark Shadows ran on ABC from 1966 to 1971 and enjoined an iconic fan following similar to Star Trek and Batman, which also both premeired in 1966. Dark Shadows fans continue to hold annual conventions, and many of the actors have formed real and enduring friendships with the fans they&amp;#039;ve seen each year. \n\nOn this DVD boxed set, the Collins Family of Collinsport, Maine, are introduced: Matriarch Elizabeth Collins Stoddard (portrayed by the legendary screen actress Joan Bennett), who hasn&amp;#039;t left her family&amp;#039;s great estate, Collinwood, in 18 years because of an enormoust secret; her brother, Roger Collins (played by the fantastic Louis Edmonds), who is vain, a snob and, like his sister, hiding a huge secret; Elizabeth&amp;#039;s daughter, Carolyn Stoddard (played wonderfully by Nancy Barrett), who is full of 1960s teen angst; Governess Victoria Winters (played by the aforementioned Alexandra Moltke Isles), a young woman who grew up in a New York foundly home and was unexpectedly and mysteriously offered her post as governess; and Roger&amp;#039;s son David Collins (played by David Henesey), who is BEYOND troubled. \n\nThose who live in Collinsport are also introduced in this boxed set: Collinsport Inn Waitress Maggie Evans (played by Kathryn Leigh Scott), who is Vicki&amp;#039;s best friend; her artist father and troubled alcoholic, Sam Evans, (played by Mark Allen for seven episodes then the rest of the series by David Ford); successful businessman and Collins Family nemesis Burke Devlin (played to the hilt by Mitch Ryan), who was wrongly convicted to manslaughter and blames Roger Collins; and Collins Plant Manager Bill Malloy (played by Frank Schofield). \n\nThe series began as a gothic romance, which this first boxed set portends. But, ratings were poor and the series faced cancellation after only about six months. Dan Curtis has said that he was forced to do something drastic to try and save the show, and drastic he did: he made the series revolve around the supernatural, so he introduced a ghost. \n\nMr. Curtis said that every time he introduced another supernatural element he was surprized to find that ratings increased markedly, so he decided that he had nothing to lose, since the series was still facing cancellation, and went all the way --- throwing a vampire into the mix in 1967! \n\nThe vampire, Barnabas Collins, was played to perfection by classically trained actor Jonathan Frid. The vampire was only to have been a temporary character that would be killed off following a reign of utter terror, but Frid&amp;#039;s compelling characterization of a &quot;sensative&quot; and remorseful Barnabas was a revelation. Ratings soared, the series was saved, and Frid became an international superstar virtually overnight. \n\nWhile casual viewers are very familiar with Barnabas, many are unaware that there were wonderful episodes that preceded him. It is truly incredible to be able to watch the progression of the series in these early episodes. \n\nThe gothic elements depicted in the episodes in this boxed set remain very entertaining, long before the supernatural plots began. \n\nThe core brilliance of what has made this daytime series endure for more than 40 years (and be the only daytime drama to be released on VHS and DVD) is the real emotions and life themes it dealt with: Love, death, fear, longing, revenge, obsession, lies, secrets, loyalty and betrayal. \n\nWhat made it unique among all daytime dramas is that those themes were played out against a compelling backdrop of Gothic sensibilities that eventually included the 175-year-old guilt-ridden and love-lorn vampire, seances, time travel, ghosts, mystery, murder, intrigue and a constant dose of the unexpected. \n\nThis &quot;soap opera&quot; managed to transcend its genre by bringing a taste of Gothic horror and science-fiction fantasy to the hum-drum world of the afternoon drama. \n\nBut, it was the stellar repertoire cast that made it all work, because they played it straight, and gave some of the most incredible performances ever captured in daytime, and did so under the pressure of the series being virtually produced live! \n\nThe series has too many memorable moments to mention. For me, I still remember the beginning voiceover by Alexandra Moltke Isles of the very first episode, released on this set for the first time on DVD: \n\n&quot;My name is Victoria Winters. My journey is just beginning. A journey that I hope will open the doors of life to me, and link my past with my future ... A journey that will bring me to a strange and dark place, to the edge of the sea, high atop Widow&amp;#039;s Hill to a place called Collinwood ... A world I&amp;#039;ve never known, with people I&amp;#039;ve never met. People who are still only shadows in my mind, but who will soon fill the days and nights of my tomorrows.&quot;","torrent":{"xt":"urn:btih:98f22299267a4bee8a87b0625c721631da811e80","amp;dn":"Dark+Shadows+the+Beginning+Volume+One+Disc+One+DVDRip","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"98f22299267a4bee8a87b0625c721631da811e80","infoHashBuffer":{"type":"Buffer","data":[152,242,34,153,38,122,75,238,138,135,176,98,92,114,22,49,218,129,30,128]},"announce":[],"urlList":[]}}