{"title":"Spyware.Doctor.v5.0.5.258.WinAll.Incl.Key.Patch-DEC0DE (Mr. Pira","uid":3810066,"size":32652249,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:9a7b82373eda1f058ac656f2c48e9203c4c78e31&amp;dn=Spyware.Doctor.v5.0.5.258.WinAll.Incl.Key.Patch-DEC0DE+%28Mr.+Pira&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"mr_piracy","files":1,"time":1190061833,"description":"****DOWNLOADED OFF IRC, INSTALLED &amp; TESTED!****\n\n\n--RELEASE INFO----------------\n\nRelease......: Spyware.Doctor.v5.0.5.258.WinAll.Incl.Key.Patch-DEC0DE\nRelease Date.: 09/08/07\nCracker......: DEC0DER / DEC0DE CRACKER TEAM\nProtection...: SERIAL/EXE\nPatcher......: DEC0DER\nWebsite......: http://www.pctools.com/spyware-doctor/\nFiles........: 07 x 31.1mb\nFileNames....: dcswd505.zip\nOS...........: WinAll\nSoftware Cost: $29.95\n\n--Release Notes--------------\n\nSpyware Doctor has been downloaded over 100 Million times; with a million more downloads every week. Millions of people worldwide use Spyware Doctor to protect their identity and PC security.\n\nSpyware Doctor has consistently been awarded Editors&amp;#039; Choice, by leading PC magazines and testing laboratories around the world, including United States, United Kingdom, Sweden, Germany and Australia. All current versions of Spyware Doctor have won Editors&amp;#039; Choice awards from PC Magazine in United States. In addition, after leading the market in 2005, Spyware Doctor was awarded the prestigious Best of the Year at the end of 2005.\n\nSpyware Doctor continues to be awarded the highest honors by many of the worlds leading PC publications such as PC Pro, PC Plus, PC Authority, PC Utilities, PC Advisor, PC Choice, Microdatorn, PC Answers Magazine plus number of reputable 5-star ratings including CNET&amp;#039;sand Tucows.\n\nNote : If you are choosing Anti-Spyware make sure you choose one that is proven and has genuine awards from one or more world leading research labs such a PC Magazine, PC World, CNET, PC Pro Magazine, PC Authority, PC Answers and other trusted labs. More importantly do not use ratings from unknown review websites, as often these are designed to mislead you into purchase of affiliated, inferior or rogue product.\n\n\nDetects, removes and blocks all types of Spyware.\n\nDid you know that numerous programs tested against Spyware Doctor detected only small fraction of Spyware and completely removed an even smaller amount? Also most of them were unable to effectively block Spyware in real time from being installed on users PC in the first place.\n\nSpyware Doctor has the most advanced update feature that continually improves its Spyware fighting capabilities on daily basis. As Spyware gets more complex to avoid detection by AntiSpyware programs Spyware Doctor responds with new technology to stay one step ahead.\nEasiest to Use\n\nSpyware Doctor is advanced technology designed specially for people, not experts. That is one reason why it won the People&amp;#039;s Choice Award in 2005 and 2006. It is automatically configured out of the box to give you optimal protection with limited interaction so all you need to do is install it for immediate and ongoing protection.\n\nSpyware Doctor&amp;#039;s advanced OnGuard technology only alerts users on a true Spyware detection. This is significant because you should not be interrupted by cryptic questions every time you install software, add a site to your favorites or change your PC settings. Such messages can be confusing and lead to undesirable outcomes such as inoperable programs, lost favorites or even Spyware being allowed to install on the system. We&amp;#039;ve done the research so you don&amp;#039;t have to.\n\n--Install-Notes------------\n:\n1. Unpack\n2. Run/Install sdsetup.exe\n3. Move This Patcher to C:\\Program Files\\Spyware Doctor\nor your installdir\n4. Push Patch Button\n5. Overwrite if askÃ‚Â´t\n6. Enter This reg.\nName: teamdec0de\nserial: HR4PV6-WK2YHT-6HV227-DYD2JP-89FNN5-5CJX2G\n7. Reboot\n8. Update\nEnjoy Spyware doctor regged :)\n\n","torrent":{"xt":"urn:btih:9a7b82373eda1f058ac656f2c48e9203c4c78e31","amp;dn":"Spyware.Doctor.v5.0.5.258.WinAll.Incl.Key.Patch-DEC0DE+%28Mr.+Pira","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9a7b82373eda1f058ac656f2c48e9203c4c78e31","infoHashBuffer":{"type":"Buffer","data":[154,123,130,55,62,218,31,5,138,198,86,242,196,142,146,3,196,199,142,49]},"announce":[],"urlList":[]}}