{"title":"Science Magazine  dec 13 2013","uid":9345808,"size":38099307,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:9b4318efa6bf9f0f6e0e79b73936d87069370dda&amp;dn=Science+Magazine++dec+13+2013&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"sidmal","files":-1,"time":1387039605,"description":"Science - 13 December 2013\n English | 132 pages | True PDF | 36.33 MB\n\n\n\n\n\nScience, also widely referred to as Science Magazine, is the academic journal of the American Association for the Advancement of Science (AAAS) and is one of the world's top scientific journals.\n\nThe peer-reviewed journal, first published in 1880, is circulated weekly and has a print subscriber base of around 130,000. Because institutional subscriptions and online access serve a larger audience, its estimated readership is one million people.[5]\n\nThe major focus of the journal is publishing important original scientific research and research reviews, but Science also publishes science-related news, opinions on science policy and other matters of interest to scientists and others who are concerned with the wide implications of science and technology. Unlike most scientific journals, which focus on a specific field, Science and its rival Nature cover the full range of scientific disciplines. According to the Journal Citation Reports, Science's 2012 impact factor was 31.027.\n\nAlthough it is the journal of the AAAS, membership in the AAAS is not required to publish in Science. Papers are accepted from authors around the world. Competition to publish in Science is very intense, as an article published in such a highly cited journal can lead to attention and career advancement for the authors. Fewer than 10% of articles submitted to the editors are accepted for publication and all research articles are subject to peer review before they appear in the journal.\n\nScience is based in Washington, D.C., United States, with a second office in Cambridge, England\n &lt;a href=&quot;\nhttp://www.sciencemag.org/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.sciencemag.org/&lt;/a&gt;\n","torrent":{"xt":"urn:btih:9b4318efa6bf9f0f6e0e79b73936d87069370dda","amp;dn":"Science+Magazine++dec+13+2013","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9b4318efa6bf9f0f6e0e79b73936d87069370dda","infoHashBuffer":{"type":"Buffer","data":[155,67,24,239,166,191,159,15,110,14,121,183,57,54,216,112,105,55,13,218]},"announce":[],"urlList":[]}}