{"title":"The Line in the Sand (2005) Open Borders Immigration.avi","uid":4506130,"size":925276236,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:9c27e43295f7ee09cdb0328158396614e21cb21f&amp;dn=The+Line+in+the+Sand+%282005%29+Open+Borders+Immigration.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"klj9","files":1,"time":1226600291,"description":"The Line in the Sand\n\nWatch as Mexicans illegally cross the border, without a care in the world. The government has ignored this issue for far too long, and it has become so easy to cross that somewhere between 12 to 20 million illegal aliens now live in the U.S., with current talk by the government of rewarding them with citizenship for their illegal deeds.\n\nUndoubtedly, many of these illegal aliens are hardened criminals from Mexico, who have come to the U.S. and set-up shop, escaping their own government&amp;#039;s wrath.\n\nWatch as U.S. citizens near the border describe the mayhem--the gunfights and drug peddling with which they must daily face.\n\nHear of how some Americans are left to compete with the Mexican laborers at the depressed wages that they&amp;#039;ll work.\n\nView the lands surrounding the borders, and the filth and waste left in the area surrounding them. Listen to people around the border-areas describe the horrors that they must daily face, and how their real estate has become practically worthless as a result of the illegal aliens moving in all around them.\n\nWhile the government may have abandoned the American people for so long, you&amp;#039;ll also see some brave and fearless people who are working to protect the border, doing the government&amp;#039;s job since they won&amp;#039;t.\n\nThis is a documentary that every American who cares about its borders needs to see--and even those Americans who don&amp;#039;t--as it portrays the truth of what is occurring, not the made-for-TV nonsense we hear. This is a DVD that you won&amp;#039;t soon forget.\n\nPURCHASE ONLINE\n\nMORE INFO","torrent":{"xt":"urn:btih:9c27e43295f7ee09cdb0328158396614e21cb21f","amp;dn":"The+Line+in+the+Sand+%282005%29+Open+Borders+Immigration.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9c27e43295f7ee09cdb0328158396614e21cb21f","infoHashBuffer":{"type":"Buffer","data":[156,39,228,50,149,247,238,9,205,176,50,129,88,57,102,20,226,28,178,31]},"announce":[],"urlList":[]}}