{"title":"D.O.A.- Dead or Alive[VCD]-2006","uid":4962320,"size":914285992,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:9c2fda18672f8cf17a6830b8d9956329bd8456e8&amp;dn=D.O.A.-+Dead+or+Alive%5BVCD%5D-2006&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"i2eaction","files":-1,"time":1245365587,"description":"USE VLC PLAYER\n\n\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0398913/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0398913/&lt;/a&gt;\n\n\n\n\nPlot: The movie adaptation of the best selling video game series Dead or Alive.\n\nThe film opens at temple of princess Kasumi (Devon Aoki). Hayabusa informs her of the death of her brother. Not wanting to believe, she leaves the temple and becomes an outcast shinobi. Before leaving she is confronted by Ayane (Natassia Malthe) who states that if Kasumi leaves, she is honor-bound to kill her. Jumping the wall of the temple she catches a flying shuriken on which the words &quot;You are invited to DOA&quot; appear.\n\nOut at sea, Tina (Jaime Pressly) is on her yacht, arguing with her father on the phone about professional wrestling. A gang of pirates (led by Robin Shou) pull alongside and try to take her boat. Tina defeats them and a DOA shuriken pierces the side of her boat.\n\nIn a Hong Kong hotel, Christie (Holly Valance) is being questioned by a number of policemen after a theft of diamonds. Wearing only a towel, she manages to disarm and defeat all of them and then leaves the building, driving off on a motorcycle. All the while she is observed by Maximillian Marsh (Matthew Marsden). While driving she receives her own shuriken.\n\nThe three girls are amongst a number of invited fighters, including Tina's father Bass (Kevin Nash) and Max, on a plane going to DOA island. On the plane they're informed by Helena that in order to reach DOA island they must jump off with parachutes and get to the compound by sundown. Quite coincidentally the three girls land close to one another and must work together to climb a giant Buddha statue when Kasumi realizes it's getting late. At the compound the fighters go on to meet Dr. Victor Donovan (Eric Roberts), the organizer of this year's DOA, who explains about the $10 million prize money, and some of the history about the tournament.\n","torrent":{"xt":"urn:btih:9c2fda18672f8cf17a6830b8d9956329bd8456e8","amp;dn":"D.O.A.-+Dead+or+Alive%5BVCD%5D-2006","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9c2fda18672f8cf17a6830b8d9956329bd8456e8","infoHashBuffer":{"type":"Buffer","data":[156,47,218,24,103,47,140,241,122,104,48,184,217,149,99,41,189,132,86,232]},"announce":[],"urlList":[]}}