{"title":"BUS STOP","uid":4911122,"size":806970158,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:a229308dc4b91dd55c6dec779df7db583728e5fd&amp;dn=BUS+STOP&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"marcosau","files":13,"time":1243171190,"description":"Nunca Fui Santa\nBus Stop\nPais: Estados Unidos\nAno: 1956\nTÃƒÂ­tulo Alternativo: The Wrong Kind of Girl\nGÃƒÂªnero: ComÃƒÂ©dia\nDuraÃƒÂ§ÃƒÂ£o: 90 min\nDireÃƒÂ§ÃƒÂ£o: Joshua Logan\nIMDB: http://www.imdb.com/title/tt0049038/\nIdioma: Ingles\nLengenda: PortuguÃƒÂªs\n\nSinopse: 'Bo' Decker ÃƒÂ© um jovem vaqueiro criado num rancho de Montana.  Tendo-se preparado para participar de um rodeio, aos 21 anos sai pela primeira vez do rancho e viaja para Phoenix, no Arizona, em companhia do amigo Virgil Blessing, um homem de meia-idade, que o trata como se fosse um filho.  Os dois pegam um ÃƒÂ´nibus interestadual e, durante a viagem, Virgil comenta que ele estÃƒÂ¡ na idade de conhecer uma mulher.  O jovem, que nunca teve uma namorada, diz a Virgil que nÃƒÂ£o estÃƒÂ¡ interessado em mulheres e que, quando se deparar com o anjo de sua vida, ele vai identificÃƒÂ¡-lo imediatamente e partirÃƒÂ¡ logo para um casamento.\n\nUma vez em Phoenix, hospedam-se num pequeno hotel e, antes da parada que dÃƒÂ¡ oficialmente por aberto o rodeio, eles entram no CafÃƒÂ© Blue Dragon, onde estÃƒÂ¡ se apresentando uma bela cantora, Cherie.  Ela ÃƒÂ© uma jovem pobre que sonha em chegar um dia ÃƒÂ  Hollywood.  Ao vÃƒÂª-la, Bo diz a Virgil que Cherie ÃƒÂ© o anjo de sua vida que ele tanto esperava.  O experiente Virgil tenta dissuadi-lo da idÃƒÂ©ia, por acreditar que os dois pertencem a mundos totalmente diferentes.\n\nNa primeira oportunidade, Bo a procura e lhe propÃƒÂµe casamento.  Embora veja nele um jovem atraente, Cherie nÃƒÂ£o pensa em se comprometer afetivamente jÃƒÂ¡ que, seu primeiro objetivo ÃƒÂ© vencer como profissional.  Mesmo assim, determinado, ele planeja casar-se com ela no dia seguinte, logo apÃƒÂ³s o encerramento do rodeio.\n\nCherie e uma amiga, Vera, assistem ao rodeio.  Ao final, antes dos espectadores deixarem a arena, elas percebem que Bo havia tomado todas as providÃƒÂªncias para a cerimÃƒÂ´nia, quando vÃƒÂªem inclusive a presenÃƒÂ§a de um padre no local.  Contando com a ajuda da amiga, Cherie deixa o rodeio, passa pela pensÃƒÂ£o onde mora, faz sua mala e se dirige ÃƒÂ  rodoviÃƒÂ¡ria da cidade, onde compra um bilhete para Los Angeles.  Antes de embarcar, entretanto, Bo chega ao local e a impede de seguir no tal ÃƒÂ´nibus.\n\nEm seguida, embarca com Virgil e Cherie num ÃƒÂ´nibus de volta ÃƒÂ  Montana.  A jovem sente-se vÃƒÂ­tima de um seqÃƒÂ¼estro.  Quando Bo adormece, ela tenta saltar em algum lugar, mas uma forte nevasca comeÃƒÂ§a a castigar a regiÃƒÂ£o, impedindo-a de seguir ÃƒÂ  frente com seu plano.  Ao chegarem ao Grace's Diner, parada obrigatÃƒÂ³ria do ÃƒÂ´nibus, com a ajuda da jovem Elma Duckworth, ela tenta se esconder de Bo, mas ele logo a encontra.  Grace, proprietÃƒÂ¡ria do local, comunica a Carl que as autoridades acabam de fechar a estrada, face ÃƒÂ  intensidade da nevasca, de modo que todos vÃƒÂ£o ser obrigados a pernoitarem ali.\n\nTodos se revoltam contra Bo, ao saberem da forma como ele vem tratando Cherie.  AutoritÃƒÂ¡rio, como sempre e sentindo-se imbatÃƒÂ­vel, ele nÃƒÂ£o se dobra diante dos argumentos dos presentes e termina sendo obrigado a enfrentar fisicamente Carl.  O motorista do ÃƒÂ´nibus vence a luta que se trava entre os dois e imobiliza Bo.  Virgil aproveita a ocasiÃƒÂ£o para fazer com que o jovem prometa desistir de Cherie e pedir desculpas a todos por seu procedimento.\n\nDepois que ele procura cada um dos presentes para se desculpar pelo transtorno por ele causado, Cherie passa a vÃƒÂª-lo com outros olhos e o procura para uma reconciliaÃƒÂ§ÃƒÂ£o.\n\nElenco: Marilyn Monroe\nDon Murray\nArthur O'Connell\nBetty Field\nEileen Heckart\nRobert Bray\nHope Lange\nHans Conried\nCasey AdamsÃ‚Â¹\nLinda Brace\nBudd Buster\nMary Carroll\nJ.M. Dunlap\nBuddy Heaton\nFay L. Ivor\nRichard Culvert Johnson\nTerry Kelman\nLucille Knox\nPete Logan\nKate MacKenna\nHelen Mayon\nDavid McMahon (1)\nDel Moore\nPhil J. Munch\nJim Katugi Noda\nJames O'Rear\nWilbur Plaugher\nEdward G. Robinson Jr.\nWilliam Schub\nHenry Slate\nGreta Thyssen\nCasey Tibbs\nAndy Womack\n\nCrÃƒÂ­ticas\n\nBaseada numa peÃƒÂ§a homÃƒÂ´nima de William Inge, produzida para a Broadway, &quot;Nunca fui Santa&quot; ÃƒÂ© uma comÃƒÂ©dia muito bem feita.  Realizada pelo competente cineasta Joshua Logan, a trama gira em torno de um jovem e ingÃƒÂªnuo vaqueiro que se apaixona perdidamente pela cantora de um CafÃƒÂ©, tendo como pano de fundo o ambiente e a atmosfera de um rodeio.\n\nJoshua apresenta um ÃƒÂ³timo trabalho na direÃƒÂ§ÃƒÂ£o, tanto em relaÃƒÂ§ÃƒÂ£o aos movimentos de cÃƒÂ¢mera, como na conduÃƒÂ§ÃƒÂ£o dos atores.  A fotografia de Milton Krasner ÃƒÂ© um outro ponto alto do filme.\n\nNo elenco, Marilyn Monroe mostra, mais uma vez, como jÃƒÂ¡ havia feito em outros filmes, como por exemplo, &quot;Almas Desesperadas&quot;, de 1952, que nÃƒÂ£o era apenas um sÃƒÂ­mbolo sexual.  Sua atuaÃƒÂ§ÃƒÂ£o ÃƒÂ© brilhante, tendo por ela sido indicada ao Globo de Ouro de Melhor Atriz (ComÃƒÂ©dia/Musical).  No filme, ela canta &quot;That Old Black Magic&quot;, numa interpretaÃƒÂ§ÃƒÂ£o tumultuada pelos clientes do CafÃƒÂ©.  Don Murray, que jÃƒÂ¡ havia aparecido em vÃƒÂ¡rias sÃƒÂ©ries produzidas para a televisÃƒÂ£o, estrÃƒÂ©ia com essa comÃƒÂ©dia no cinema, recebendo uma indicaÃƒÂ§ÃƒÂ£o ao Oscar por seu trabalho.  O filme conta ainda com as boas atuaÃƒÂ§ÃƒÂµes de Arthur O'Connell e Betty Field.  A exemplo de Don Murray, Hope Lange tambÃƒÂ©m estrÃƒÂ©ia no cinema com esse filme.  Os dois se casariam, na vida real, nesse mesmo ano de 1956.\n\nIndicaÃƒÂ§ÃƒÂµes:  Academia de Hollywood  -  Indicado ao Oscar de Melhor Ator Coadjuvante  (Don Murray)\n\nAcademia BritÃƒÂ¢nica  - Indicado ao PrÃƒÂªmio de RevelaÃƒÂ§ÃƒÂ£o Masculina  (Don Murray)\n\nGlobo de Ouro  - Indicado aos PrÃƒÂªmios de Melhor Filme-ComÃƒÂ©dia/Musical e de Melhor Atriz-ComÃƒÂ©dia/Musical  (Marilyn Monroe)\n\nAudio:\n\tData Rate: 128 kbps\n\tCompactaÃƒÂ§ÃƒÂ£o: Mpeg\n\nVideo:\n\tData Rate: 936 kbps\n\tImagem: 672 x 256 pixels\n\tQuadros: 25.000 fps\n\tCompactaÃƒÂ§ÃƒÂ£o: Xvid\n\nTamanho: 695 mb\n","torrent":{"xt":"urn:btih:a229308dc4b91dd55c6dec779df7db583728e5fd","amp;dn":"BUS+STOP","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a229308dc4b91dd55c6dec779df7db583728e5fd","infoHashBuffer":{"type":"Buffer","data":[162,41,48,141,196,185,29,213,92,109,236,119,157,247,219,88,55,40,229,253]},"announce":[],"urlList":[]}}