{"title":"MP1","uid":5427728,"size":621770986,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:a33c9b3d8800aed93a22ad683015230363e97d78&amp;dn=MP1&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"sanju1234","files":3,"time":1268308699,"description":"Created by Finnish developer Remedy Entertainment, Max Payne has been in production for a very long time. It's a gritty third-person shooter that's clearly inspired by the stylish cinematography and choreography of the Hong Kong action movie genre, particularly the work of director John Woo. Like many of Woo's films, Max Payne is rife with gunplay that's almost indescribably beautiful to watch--and yet actually playing it is even better. Max Payne does have a few weaknesses, most notably in that it isn't very long and lacks any multiplayer features--but these things are hardly detrimental. After all, it's not often you get an outstanding and original action game that's not just different from all other shooters to date, but also in many ways superior. \n\nWhen a game has been in development for an inordinate length of time, you never can tell how it will finally turn out. Oftentimes, such games end up overwrought, incomplete, or behind the times. But once in a while, the extra time and effort paid by the developers is plainly apparent in the finished product. That's the case with Max Payne. Don't worry about what it doesn't have--you'll relish this highly polished, tightly focused, graphically stunning shooter for what it is. The game's incredible technical accomplishments and its original play mechanics all combine to make it one of the very finest shooters ever made.\n\nRequirements-\n\n    * 450 MHz CPU,\n    * 96 MB RAM,\n    * 16 MB video card RAM,\n    * 4X CD-ROM drive, DirectX 8.0,\n    * Windows 95 (WIN)or Better one.\n\n\nALSO INCLUDED 2 MODS.","torrent":{"xt":"urn:btih:a33c9b3d8800aed93a22ad683015230363e97d78","amp;dn":"MP1","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a33c9b3d8800aed93a22ad683015230363e97d78","infoHashBuffer":{"type":"Buffer","data":[163,60,155,61,136,0,174,217,58,34,173,104,48,21,35,3,99,233,125,120]},"announce":[],"urlList":[]}}