{"title":"UNDERWORLD TRILOGY-1,2,3,DVDRIP.XVID.AVI.VIRUSOFSATEN","uid":4884239,"size":2203619328,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:a40c18519172463d4900fba1a114609f6786dd17&amp;dn=UNDERWORLD+TRILOGY-1%2C2%2C3%2CDVDRIP.XVID.AVI.VIRUSOFSATEN&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"virusofsaten","files":-1,"time":1241562259,"description":"UNDERWORLD TRILOGY 1,2,3,  -  AVI  -  .\n\n\n\n\n\n\nUnderworld (2003) More at IMDbPro Ã‚Â»\nA war has been raging between the Vampires and Lycan for centuries, Selene (Beckinsale) is a death dealer, assigned to hunt down and eradicate the last of the Lycan. When she comes across Michael Corvin(Speedman)who holds the key to end the war she must decide where her alligances will lie.\n\n\n\nPlot summary for\nUnderworld: Evolution (2006) More at IMDbPro Ã‚Â»\nAs the adventure continues, the saga of war between vampires and werewolves. Selene, the vampire &quot;death dealer&quot; who's now fighting to stop the release of the original &quot;Lycan&quot; werewolf, William from the prison that's held him for centuries. As we learn from the film's action-packed prologue, William and his brother Marcus began the bloodline of vampires and werewolves, and after witnessing centuries of warfare between them, their immortal father Corvinus now seeks Selene and the human vampire/lycan hybrid Michael to put an end to the war perpetuated by Victor, the vampire warrior whose betrayal of Selene turns Underworld: Evolution into an epic tale of familial revenge.\n\n\n\nPlot summary for\nUnderworld: Rise of the Lycans (2009) More at IMDbPro Ã‚Â»\nThe prequel story traces the origins of the centuries-old blood feud between the aristocratic vampires and their onetime slaves, the Lycans. In the Dark Ages, a young Lycan named Lucian emerges as a powerful leader who rallies the werewolves to rise up against Viktor, the cruel vampire king who has enslaved them. Lucian is joined by his secret lover, Sonja, in his battle against the Vampire army and his struggle for Lycan freedom.\n\n\n\n\n\n\n\n\n\n\n\n     * AFTER DOWNLOADING PLEASE SEED SO OTHERS CAN DOWNLOAD THIS TORRENT AS WELL*\n\n\n  {IF EVERY ONE SEEDS TO A 3.0 % RATIO THE NEXT PERSON WILL GET THERE FILE QUICKER}\n\n                {THE MORE SEEDERS THERE ARE THE FASTER THE DOWNLOAD}\n\n\n                         {PLEASE ENJOY FROM THE VIRUSOFSATEN}\n          \n\n                                {LETS SHARE THE FILES}\t\n\n\n                         {SUPPORT THE BAY DOWNLOAD AND SEED}\n\n","torrent":{"xt":"urn:btih:a40c18519172463d4900fba1a114609f6786dd17","amp;dn":"UNDERWORLD+TRILOGY-1%2C2%2C3%2CDVDRIP.XVID.AVI.VIRUSOFSATEN","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a40c18519172463d4900fba1a114609f6786dd17","infoHashBuffer":{"type":"Buffer","data":[164,12,24,81,145,114,70,61,73,0,251,161,161,20,96,159,103,134,221,23]},"announce":[],"urlList":[]}}