{"title":"Corbin Fisher - - - Brent Fucks Trent ((MictrmbL))","uid":4994578,"size":269078601,"categoryP":"porn","categoryS":"other","magnet":"?xt=urn:btih:a45b495bad15d321784f7b8b0c9dfa439ca27f85&amp;dn=Corbin+Fisher+-+-+-+Brent+Fucks+Trent+%28%28MictrmbL%29%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"mictrmbl","files":44,"time":1247216072,"description":"From the vaults of Corbin Fisher:\n\n\nI have a feeling this video will instantly become one of our most popular. The passion is intense, these two guys hold nothing back as they go at it, and it's clear throughout every second that each one is experiencing extreme pleasure and really getting off on pleasuring one another as well.\n\nIt really shouldn't be any other way when you get Brent and Trent in a video together, either. Brent has become synonymous with passion and intensity since first arriving here at CFU and when you watch him, you know you're not only watching this hot young stud have sex or fuck but, you're watching him seduce and make love.\n\nLikewise, Trent doesn't ooze just sexuality, but also real emotion and intensity in his videos. Since we first saw him shoot a load with Dawson to when we saw him gripping the sheets, gasping and moaning as he got fucked for the very first time, Trent's been the perfect example of what a hot young college man looks like when overwhelmed with pleasure and experiencing feelings they can barely handle, much less contain.\n\nThis, right here, is what sex is meant to be - passionate, intense, and hardcore! ","torrent":{"xt":"urn:btih:a45b495bad15d321784f7b8b0c9dfa439ca27f85","amp;dn":"Corbin+Fisher+-+-+-+Brent+Fucks+Trent+%28%28MictrmbL%29%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a45b495bad15d321784f7b8b0c9dfa439ca27f85","infoHashBuffer":{"type":"Buffer","data":[164,91,73,91,173,21,211,33,120,79,123,139,12,157,250,67,156,162,127,133]},"announce":[],"urlList":[]}}