{"title":"Cannonball in Europe","uid":3697170,"size":77205721,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:a76acd546741ef66b3d3574f8aef656982c7cd64&amp;dn=Cannonball+in+Europe&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"spet1363","files":8,"time":1180122286,"description":"Cannonball In Europe! was recorded live on August 5, 1962 at the International Jazz Festival in Comblain-La-Tour, a small town in Belgium. The recent addition of legendary reedsman Yusef Lateef pushed Adderley?s combo to a powerful sextet. With three horns blazing (Lateef, brother Nat Adderley on trumpet and Cannonball on alto sax), the band charged through a stunning concert in front of the largest audience it had ever played. The five song, 50 minute set blasts off with Lateef?s complex \\&quot;P.Bouk\\&quot; and never lets up. Favorites \\&quot;Gemini\\&quot; and \\&quot;Work Song\\&quot; are played with fire and passion. And Lateef?s soulful, moving oboe on the blues standard \\&quot;Trouble in Mind\\&quot; is stellar. But, it?s the frisky call and response between the reeds and horn, underpinned by Sam Jones? sturdy bass, Louis Hayes? energized drums and an understated Joe Zawinul on piano, that creates the fireworks that blasts this gig into the stratosphere. The reissue doesn?t unearth any extra tracks, but the sound has been improved and newly penned liner notes describe the historical background to this superb show. --Hal Horowitz  ","torrent":{"xt":"urn:btih:a76acd546741ef66b3d3574f8aef656982c7cd64","amp;dn":"Cannonball+in+Europe","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a76acd546741ef66b3d3574f8aef656982c7cd64","infoHashBuffer":{"type":"Buffer","data":[167,106,205,84,103,65,239,102,179,211,87,79,138,239,101,105,130,199,205,100]},"announce":[],"urlList":[]}}