{"title":"Rapid Typing Tutor 2 7 7","uid":4766737,"size":3951687,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:a7fca939e267938ac52e31e81443b1c2b6531996&amp;dn=Rapid+Typing+Tutor+2+7+7&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"MaskiShow77","files":-1,"time":1236896253,"description":"Free Tool to Improve Typing Skills for Adults and Kids\n\nRapidTyping Team announces the release of Rapid Typing Tutor, a free software tool to improve one's typing skills. Rapid Typing Tutor helps computer users to learn how to type properly without looking at the keyboard while making keyboard training fun and entertaining. The tool is completely free, and does not cost a dime. Kids, and adults too, can use Rapid Typing Tutor to improve their typing skills through a series of easy, fun lessons.\n\nRapid Typing Tutor is not another boring keyboard training tool. With numerous colorful skins and avatars and a game-like environment, Rapid Typing Tutor makes learning typing fun for both adults and children. A built-in typing game makes learning to type an easy and entertaining experience. The built-in typing game makes training more like a game, not studying.\n\nWith Rapid Typing Tutor, it's easy to evaluate typing performance at any time by simply looking at charts. Rapid Typing Tutor tracks user progress, and allows students to see their results at any time. The progress and statistics are represented as tables and charts, allowing students to see their progress and become motivated for taking yet another lesson. The statistics displays both typing speed and accuracy, always with a summary at the end of each lesson.\n\nRapid Typing Tutor is absolutely free, and does not have any hidden fees, adware or spyware included.\n\nRapid Typing Tutor is fully customizable, allowing students to plan their own lessons according to their skills and capabilities. Rapid Typing Tutor offers the complete freedom of learning, allowing students to make their own lessons and plan their studies. There is no enforcement of pre-defined learning plans. Rapid Typing Tutor allows accessing any lesson at any time, from the easiest to the most advanced. Custom lessons are easy to make, too. If there is a need to practice a particular key or any set of keys, it's easy to create a specific lesson to train for those particular keys.\n\nTo help typists learn how to place their fingers on the keyboard, Rapid Typing Tutor displays a virtual keyboard with zone highlights. This way, typists always know which hand belongs to which zone. To make learning even more fun while teaching students how to type correctly, Rapid Typing Tutor displays two moving hands over the keyboard.\n\nhome page:  &lt;a href=&quot; http://www.rapidtyping.com&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.rapidtyping.com&lt;/a&gt;\n\ndescription: http://www.rapidtyping.com/features.html","torrent":{"xt":"urn:btih:a7fca939e267938ac52e31e81443b1c2b6531996","amp;dn":"Rapid+Typing+Tutor+2+7+7","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a7fca939e267938ac52e31e81443b1c2b6531996","infoHashBuffer":{"type":"Buffer","data":[167,252,169,57,226,103,147,138,197,46,49,232,20,67,177,194,182,83,25,150]},"announce":[],"urlList":[]}}