{"title":"Post Regiment","uid":5783567,"size":76534402,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:a96f663c3d7db487f77703582e25809555fcd481&amp;dn=Post+Regiment&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"azitromax","files":-1,"time":1282509701,"description":"Post Regiment \nThe torrent contains a mix from two albums and a demotape.\n\n\nPost Regiment were a Polish punk rock or hardcore punk band. They formed in Warsaw in 1986.\n\nIn the early days, Post Regiment had a much slower pace and more conventional singing style with vocalist Darek &quot;Tolek&quot; Gracki. By 1987, he left and Dominika &quot;Nika&quot; Domczyk took over on vocals. The band developed a faster, melodic punk sound by their 1992 self-titled first album.\n\nTheir second album, Czarzly, was released in 1995 and adopted a faster crust punk sound with rawer vocals and d-beat-style drumming.\n\nTheir final album, Tragiedia wg Post Regiment (&quot;Tragedy According To Post Regiment&quot;) was released in 1998 on Profane Existence records in the USA and Skuld releases in Europe. It was an album of hardcore punk songs by the Polish band Tragiedia, longtime friends of Post Regiment who broke up without ever putting out a record.\n\nPost Regiment had a fairly unique sound in hardcore punk, with some unusual elements like melodic singing, Eastern European modes, instrumentals and the occasional synthesizer. The band broke up in 2001, although they still practice from time to time.\n\nAlbum Death Before The Metal, released in 2007, contains songs recorded between 1988 and 1990.","torrent":{"xt":"urn:btih:a96f663c3d7db487f77703582e25809555fcd481","amp;dn":"Post+Regiment","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a96f663c3d7db487f77703582e25809555fcd481","infoHashBuffer":{"type":"Buffer","data":[169,111,102,60,61,125,180,135,247,119,3,88,46,37,128,149,85,252,212,129]},"announce":[],"urlList":[]}}