{"title":"The Alex Jones Show - Alex Jones - ALL FOUR PLUS HOURS - 23 Jul","uid":4312334,"size":77326468,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:aa1c1244c2cda490e99429d7b3340ff3225584ef&amp;dn=The+Alex+Jones+Show+-+Alex+Jones+-+ALL+FOUR+PLUS+HOURS+-+23+Jul+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Anotha_modemho","files":1,"time":1216877962,"description":"THE EMPIRE IS ON THE RUN..........All 4 PLUS Hours AND OVERDRIVE\n\nAlex is known for not just talking the talk, but walking the walk. He combines his media presence with actual physical activism, a practice that once led to him being arrested on the personal order of George W. Bush! Alex Jones has gained international attention for standing up for what he believes in.\n\nFrom Italy&amp;#039;s La Prensa to the Wall Street Journal and USA Today, Jones has brought the information war to the mainstream print media worldwide, speaking out against tyranny in defense of the Constitution.\n\nTotal Recorder 4.4 Capture in 48 kbs stereo from Ku satellite feed or 56 kbs internet streaming audio with commercial edit. About 6.25 hr listening time.\n\nPM me with any of your comments.\n\nTodays gueststopic: \n\nIn an exclusive interview, Alex will talk with iconic musician and truther Willie Nelson on today&amp;#039;s show. Nelson will talk about Dennis Kucinich&amp;#039;s brave effort to have George W. Bush impeached for war crimes, trashing the Constitution and the Bill of Rights, and a litany of other abuses and high crimes. Willie will also talk about the neocon drive to attack Iran. Additional guests include William Pepper, Mark Koernke, and Saint John Hunt. Rep. Dennis Kucinich will join Alex at the end of the show. ","torrent":{"xt":"urn:btih:aa1c1244c2cda490e99429d7b3340ff3225584ef","amp;dn":"The+Alex+Jones+Show+-+Alex+Jones+-+ALL+FOUR+PLUS+HOURS+-+23+Jul+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"aa1c1244c2cda490e99429d7b3340ff3225584ef","infoHashBuffer":{"type":"Buffer","data":[170,28,18,68,194,205,164,144,233,148,41,215,179,52,15,243,34,85,132,239]},"announce":[],"urlList":[]}}