{"title":"EXPLOITED COLLEGE GIRLS - Angela - Hot Young Blonde 720p *NEW*","uid":11534097,"size":1730391175,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:af8ea60016ae7d6a0e0944e87a4b246fc67f6312&amp;dn=EXPLOITED+COLLEGE+GIRLS+-+Angela+-+Hot+Young+Blonde+720p+%2ANEW%2A&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"beta2008x","files":1,"time":1416608584,"description":" &lt;a href=&quot;\nhttp://www.dumppix.com/viewer.php?file=2zudj_agl.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.dumppix.com/viewer.php?file=2zudj_agl.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://www.dumppix.com/viewer.php?file=kqo67_ecg_14_11_20_angela_.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.dumppix.com/viewer.php?file=kqo67_ecg_14_11_20_angela_.jpg&lt;/a&gt;\n\n\nSay hello to Angela: a smiley blonde beauty who happens to be an undercover cumslut. Watch as this pretty, corn fed midwestern girl rides Jay's dick to a couple of real, intense orgasms and then when he tries to administer a facial finish she catches it in her mouth. Which is possibly the best example of an actual &quot;talent&quot; we've ever caught on film here at Ex Co Gi. Angela comes off as innocent, but don't let the fresh face fool you, it turns out she loves to deep throat dick and loves cum. So she's just Jay's type. This is probably why he takes such a shine to her.\n\nAs Angela tells Jay about her sex life for the interview, we find that it's surprisingly kinky for a girl who looks like she giggles at the word &quot;vagina&quot;. But she doesn't. In fact, she shows us hers and encourages Jay to get closer and touch it. The touching seems to work because by the time Jay gets her seated on the bed she's wet and doesn't want to waste any time getting to the main event. Jay takes the cue, and since he really seems to like Angela, he doesn't make her wait. Between his fingers and vibrator he gets her off to her first orgasm in a few minutes.\n\nAngela doesn't hesitate when she's asked to return the favor and jumps to her knees to swallow Jay's cock to the base in one sexy gulp. However, as much as she seems to enjoy performing oral, she's even more enthusiastic when Jay guides her to the bed. It's clear by now Jay is enjoying this as much as Angela when he teases her before finally sticking his cock in her, much to her pleasure. After starting with her on her back, Jay moves her into cowgirl and then changes up the angle again in sideshow, where he drills her to another intense orgasm on his way to a fantastic facial finish.\n\nSo, if there's no update next week you know why. Ace cameraman and stunt cock Jay has fallen in love and moved into a little sea side bungalow with Angela. Right this moment she's either baking cookies while her pussy rests or getting a mouthful of Jay-jizz","torrent":{"xt":"urn:btih:af8ea60016ae7d6a0e0944e87a4b246fc67f6312","amp;dn":"EXPLOITED+COLLEGE+GIRLS+-+Angela+-+Hot+Young+Blonde+720p+%2ANEW%2A","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"af8ea60016ae7d6a0e0944e87a4b246fc67f6312","infoHashBuffer":{"type":"Buffer","data":[175,142,166,0,22,174,125,106,14,9,68,232,122,75,36,111,198,127,99,18]},"announce":[],"urlList":[]}}