{"title":"CAMP FEMA - U Want CHANGE - HOPE U  Like IT - American Terrorist","uid":5238290,"size":993798311,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:afbda6c69ac1b14996802d836fbe5884a304c35f&amp;dn=CAMP+FEMA+-+U+Want+CHANGE+-+HOPE+U++Like+IT+-+American+Terrorist&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"awaken888","files":35,"time":1261634343,"description":"Well I suppose  most of you are starting to figure something is wrong. Government says the recession is over while the Depression Moves on. \n\nObama gets the Nobel Peace for not getting out of Iraq like he said he would. In fact he sent more than 30,000 more Soldiers to Afghanistan when the CIA says the are only 100 Taliban in the whole damn country. Lets see War, is Peace and Peace is War. Screw NOBEL, they are frauds.Obaaamas wife nominated him 10 days after he took office. \n\nPandemic, where the Hell did that GOT GETTA A SHOT OR DIE STORY disappear too. \n\nThe Carbon Tax the NWO wants to TAX US TO DEATH WITH, TO stop GLOBAL WARMING THAT ISN'T HAPPENING. In fact the Planet has been cooling for the last 10 years.\n\nThere is NO LAW THAT SAYS YOU GOTTA PAY TAXES AND WE STILL PAY THE federal RESERVE bank interest to loan us our own money.\n\nSO HERE ARE THE PRISON CAMPS THAT THEY BUILT FOR YOU AND ME AND YOUR MOM AND DAD TOO. Wake up America, the British are coming, the British are coming.\n\n\n\nPlease seed long!! I have ask our Father to bless all those that seed long.\n\nOther torrents in this series can be found at http://thepiratebay.se/user/awaken888/ Seed Long for Blessings from the Father \n\n","torrent":{"xt":"urn:btih:afbda6c69ac1b14996802d836fbe5884a304c35f","amp;dn":"CAMP+FEMA+-+U+Want+CHANGE+-+HOPE+U++Like+IT+-+American+Terrorist","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"afbda6c69ac1b14996802d836fbe5884a304c35f","infoHashBuffer":{"type":"Buffer","data":[175,189,166,198,154,193,177,73,150,128,45,131,111,190,88,132,163,4,195,95]},"announce":[],"urlList":[]}}