{"title":"Gwar - Sick of You   (2nafish)","uid":5180436,"size":111724548,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:b079715d0c6617c34fb1b2a7bb7fbdb1817cf710&amp;dn=Gwar+-+Sick+of+You+++%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":-1,"time":1259212103,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\nSick of You is the third track in heavy metal band GWAR's second album, Scumdogs of the Universe and is one of the most well known songs by the band.\n\nSick of You is, lyrically, a simple song, dealing with feelings of utter distaste for a despised one in a somewhat comical fashion:\nYour face is gross\nYou eat white toast\nYou don't know what to do\nIt's just your luck\nYou really suck\nThat's all I'm sick of you\n\nDespite the constant repetition of the word &quot;sick&quot; and the somewhat simple song structure, the song is a fan favorite, perhaps due to its more radio-friendly lyrics and sound than the rest of the album. Dave Brockie has stated it to be his favorite GWAR song (usually because it means the concert is over) and its the the song played the most often in the band's live shows. Many people believe that Sick Of You is the first song by the band with its own music video. This is not correct because a music video was made for the Hell-o! version of Black and Huge.\n\nAnother notable part of the song is the interlude of clean singing that starts around 1:25, clean singing is generally a rare thing for the band, making this song notable for being one of the few in which it is used extensively.\n\nScumdogs of the Universe is the second album by heavy metal band Gwar. The album is their first album on Metal Blade Records and was released in 1990. It is to this day the band's best selling album and greatly expanded the band's horizons.\n\nGwar (usually typeset as GWAR) is a Grammy Award-nominated thrash metal band formed in Richmond, Virginia in 1985. The band is best known for their elaborate sci-fi/horror film inspired costumes; raunchy, obscene lyrics; and graphic stage performances, which consist of humorous re-enactments of political and moral taboo themes.\n\n\nMy Videos:\n  &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:b079715d0c6617c34fb1b2a7bb7fbdb1817cf710","amp;dn":"Gwar+-+Sick+of+You+++%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b079715d0c6617c34fb1b2a7bb7fbdb1817cf710","infoHashBuffer":{"type":"Buffer","data":[176,121,113,93,12,102,23,195,79,177,178,167,187,127,189,177,129,124,247,16]},"announce":[],"urlList":[]}}