{"title":"Velvet_Assassin-Razor1911","uid":4875794,"size":4884580733,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:b0a18cabb4926fc10df043ecf341ab1133672f91&amp;dn=Velvet_Assassin-Razor1911&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"RawSnake","files":52,"time":1241120307,"description":"Velvet assassin PC - Razor 1911\n\nPlayers take control of Violette Summer, a beautiful but deadly spy deep behind enemy lines with no support or official backing from the British Government. Gameplay employs techniques similar to Ubisoft's Splinter Cell range of games. Players have to hide in the shadows in order to avoid being detected. Violette will have a purple aura surrounding her when she is completely invisible to the enemy. This aura will fade as she moves into light and hence visibility. If she is detected, she will either have to fight off the guard or escape. The game employs a special lifeline if detected called &quot;Morphine Mode&quot;. If triggered, a cutscene will play out where the hospitalized Violette convulses and is administered a dose of morphine by a military nurse. Once returning to the game, the game world will temporarily freeze, giving the player the opportunity to execute any remaining enemies. Players will have limited use of the Morphine lifeline. Furthermore as the game progresses, players will be afforded the opportunity to select the type of upgrades they would like - depending on gameplay style.","torrent":{"xt":"urn:btih:b0a18cabb4926fc10df043ecf341ab1133672f91","amp;dn":"Velvet_Assassin-Razor1911","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b0a18cabb4926fc10df043ecf341ab1133672f91","infoHashBuffer":{"type":"Buffer","data":[176,161,140,171,180,146,111,193,13,240,67,236,243,65,171,17,51,103,47,145]},"announce":[],"urlList":[]}}