{"title":"Delores Cannon-Moving into a New Earth.2007.avi","uid":4843795,"size":1205601606,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:b1ce15369ad4fabac7708dad2a624e068701808e&amp;dn=Delores+Cannon-Moving+into+a+New+Earth.2007.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"zip2009","files":1,"time":1239603539,"description":"16th Annual UFO Congress (2007)\n\nDolores Cannon is experiencing an evolution in her work as a hypnotherapist. Her clients (who are coming from all over the world) are no longer experiencing regressions into past lives. They are returning to the Source (God) to explain why they are living here in the world now. They are also supplying more detailed information about the shift in vibrations and frequencies as we move into the New Earth. This is where the focus should be at the present time. Many are experiencing their first life on Earth, and thus have no karma. They are here specifically to help with the shift into this new dimension. Who will make the transition into the new world, and who will be &quot;left behind&quot;? What are the effects being experienced by the human body as it makes the adjustment? Will we take our physical bodies with us? Why the influx of ET visitations have stopped with the closing of the portal, and the opening of the new one.\n\nDolores considers herself a regressionist and psychic researcher who specializes in the recovery and cataloging of &quot;lost&quot; knowledge. She has become, perhaps, the world's most unlikely expert on the prophecies of Nostradamus. A retired Navy wife from Arkansas, she was nearly 50 years old when she began experimenting with hypnosis and past-life regression. The results were, to say the least, quite spectacular. Working through several different vehicles (subjects), Dolores was able to establish communication with the living Michel De Notredame, better known as the prophet, Nostradamus. His revelations and their impact on our time are both fascinating and, at times, frightening.\nPermalink\n","torrent":{"xt":"urn:btih:b1ce15369ad4fabac7708dad2a624e068701808e","amp;dn":"Delores+Cannon-Moving+into+a+New+Earth.2007.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b1ce15369ad4fabac7708dad2a624e068701808e","infoHashBuffer":{"type":"Buffer","data":[177,206,21,54,154,212,250,186,199,112,141,173,42,98,78,6,135,1,128,142]},"announce":[],"urlList":[]}}