{"title":"Apologetix - 2005 - Isnt Wasnt Aint","uid":4859665,"size":70627328,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:b28c90fbf4141ce34d0613301cf364543a56dae9&amp;dn=Apologetix+-+2005+-+Isnt+Wasnt+Aint&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"TorrentTracts","files":20,"time":1240210688,"description":"Apologetix - 2005 - Isn't Wasn't Ain't\n\n\nTRACK LISTING:\n\n01 - Isn't Wasn't Ain't - In The Bible\n02 - David &amp; Goliath\n03 - Lions\n04 - Patients\n05 - Help Me, Rhoda\n06 - That Daughter\n07 - Little Esther\n08 - Don't Try - To Hide\n09 - I Found the Answer There\n10 - Be Like David Was\n11 - Ain't That a Miracle\n12 - God I Like About You\n13 - Faith Pt - 2\n14 - Christians Doin' Music\n15 - What Is and Will Forever Be\n16 - In Matthew 9\n17 - Mrs - Protestant\n18 - He Really Got Mad\n19 - Love - Ain't Nothin'\n20 - Verynice City\n\n\nPARODY OF:\n\n01 - &quot;Livin' Lovin' Maid - She's Just a Woman&quot; by Led Zeppelin \n02 - &quot;Paperback Writer&quot; by The Beatles \n03 - &quot;Signs&quot; by Five Man Electrical Band \n04 - &quot;Patience&quot; by Guns N' Roses 05 - Help Me, Rhoda\n05 - &quot;Help Me, Rhonda&quot; by The Beach Boys \n06 - &quot;Black Water&quot; by The Doobie Brothers \n07 - &quot;Little Sister&quot; by Elivs Presley \n08 - &quot;Don't Cry&quot; by Guns N' Roses \n09 - &quot;I Saw Her Standing There&quot; by The Beatles \n10 - &quot;Feel Like Makin' Love&quot; by Bad Company \n11 - &quot;Pink Houses&quot; by John Cougar Mellencamp \n12 - &quot;What I Like About You&quot; by The Romantics \n13 - &quot;Faith&quot; by George Michael \n14 - &quot;Listen to the Music&quot; by The Doobie Brothers \n15 - &quot;What is and What Should Never Be&quot; by Led Zeppelin \n16 - &quot;I Feel Fine&quot; by The Beatles \n17 - &quot;Mrs - Robinson&quot; by Simon &amp; Garfunkel \n18 - &quot;You Really Got Me&quot; by The Kinks \n19 - &quot;Long Train Runnin'&quot; by The Doobie Brothers \n20 - &quot;Paradise City&quot; by Guns N' Roses \n\n\nEXTRA INFORMATION:\n\nIn March 1999, we finally gave in to years of fan requests and re-released our out-of-print cassette, &quot;Radical History Tour,&quot; on CD. Actually, we'd produced a series of four studio cassettes in the old days (not counting numerous &quot;live&quot; cassettes), and &quot;Radical History Tour&quot; was the last and best in the series, although it still has its share of warts. We held off on re-releasing any more old material until 2003, the tenth anniversary of the release of &quot;Isn't Wasn't Ain't (in the Bible),&quot; the last cassette we released before &quot;Radical History Tour&quot; and our first professionally mass-produced cassette.\n\n&quot;Isn't Wasn't Ain't&quot; was significantly better than the cassettes we'd released before it, but not even as good as &quot;Radical History Tour,&quot; which came out a year later. Consequently, we were hesitant to re-release it on CD, because we didn't want it to be the first taste of ApologetiX for a new listener. ?However, many fans already had everything else we'd released and were eager for more.\n\nFor Christmas 2003, we remastered a limited-edition 10th-anniversary &quot;Isn't Wasn't Ain't&quot; CD for the fan club. The response was overwhelming, but we later discontinued that CD. However, by early 2005, we'd added many new fans to the fold who wanted &quot;Isn't Wasn't Ain't&quot; for their collections. Consequently, we released &quot;Isn't Wasn't Ain't: The Director's Cut,&quot; which included two bonus tracks which were on the original cassette in 1993, but not on the 10th-anniversary CD --&quot;Mrs. Protestant&quot; and &quot;God I Like About You.&quot; We also included two songs that were originally on our &quot;Radical History Tour&quot; cassette but didn't fit on that CD, &quot;Love (Ain't Nothin')&quot; and &quot;Verynice City.&quot;\n\nIf you're looking for stellar performances, &quot;Isn't Wasn't Ain't: The Director's Cut&quot; isn't, wasn't, ain't the CD for you. There's a reason we don't sell this CD in stores; it's only for our close friends and devoted fans. It's a good time capsule from 1993 (recorded June 3 and released July 17 that year) that will let you see how we sounded in our formative years, and it contains some great parody lyrics, but we had a lot to learn. It's a scary thing for us ... like digging out photos of yourself from those awkward years and sharing them with somebody you're dating.\n\nIn addition to lead singer/lyricist J. Jackson and lead guitarist/producer Karl Messner (who also sings lead vocals on &quot;I Found the Answer There&quot;), the musicians on &quot;Isn't Wasn't Ain't&quot; were Andy Sparks, rhythm guitar; Steve Kayner, bass; and Keith Harrold, drums. Background vocalists included J., Karl, Andy, original ApologetiX drummer Jeff Pakula, Jo Ann Herdt and Dana &quot;Anad&quot; Spallinger. Yes, we did deliberately go a little bit over the top with background vocals for comedic effect on a number of the songs. Special thanks also to our original bass player, Jerry Hayostek, who set us up with the recording equipment back in 1993, although he had already left the band by this time.\n\n\nTORRENTED BY:\n\nTorrent Tracts, April 2009\n","torrent":{"xt":"urn:btih:b28c90fbf4141ce34d0613301cf364543a56dae9","amp;dn":"Apologetix+-+2005+-+Isnt+Wasnt+Aint","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b28c90fbf4141ce34d0613301cf364543a56dae9","infoHashBuffer":{"type":"Buffer","data":[178,140,144,251,244,20,28,227,77,6,19,48,28,243,100,84,58,86,218,233]},"announce":[],"urlList":[]}}