{"title":"Ninja Assassin italian [ www.bt-italiatorrent.org ]","uid":5213712,"size":723400704,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:b3a705198bf4dbe464b2d95a8f6558a5294cabd2&amp;dn=Ninja+Assassin+italian+%5B+www.bt-italiatorrent.org+%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"italiatraker","files":1,"time":1260701402,"description":"registratevi su  www.bt-italiatorrent.org  scaricate a velocita massima e in piu trovate dvd dvdrip. giochi pc xbox e molto altro ancora\n\n\n\n\n\n\nTitolo originale:Ninja Assassin\n\nNazione:USA, Germania\nAnno: 2009\nGenere:Azione\nDurata:99'\nRegia:James McTeigue\nCast:Rain, Naomie Harris, Ben Miles, Rick Yune, Stephen Marcus, Sho Kosugi, Togo Igawa, Randall Duk Kim, Sung Kang, Thorston Manderlay\nProduzione:Warner Bros. Pictures, Dark Castle Entertainment, Legendary Pictures\nData di uscita: venerdÃƒÂ¬ 4 dicembre 2009 (cinema)\n\n\nEducato e addestrato fin da piccolo all'arte del combattimento ninja dallo spietato clan Ozunu in uno scenario da Tana delle Tigri Raizu ha deciso, una volta raggiunta la maturitÃƒÂ , di ribellarsi al destino di killer a pagamento per conto dei governi internazionali scritto per lui dal clan. Braccato dal resto del mondo ninja e condannato come loro a vivere nell'anonimato e nell'oscuritÃƒÂ  decide di aiutare Mika, poliziotta dell'Europol stanziata a Berlino che indaga sui legami tra questi ninja che nessuno ha mai visto e alcuni misteriosi omicidi. Con lei cercherÃƒÂ  la sua vendetta legale e morale.\nSe in questi anni qualcosa ÃƒÂ¨ cambiato nel modo in cui percepiamo il cinema di genere, di nicchia, di settore, di serie B o semplicemente di arti marziali lo si capisce da Ninja assassin titolo che non si vergogna di essere chiaro e diretto (viva la faccia!) e di riproporre con estetica e idee moderne un classico intramontabile: il percorso di vendetta di una macchina di morte dal cuore tenero dietro l'espressione immutabile addestrata da un maestro inflessibile e ribellatosi dopo la morte del suo unico amore.\nSiamo nel post-tarantiniano, un cinema di arti marziali che cerca una dimensione estetica, punta alla coolness dei suoi personaggi maledetti e ruba soluzioni visive a Kill Bill ma con classe e rispetto, che giustamente abusa di violenza sangue e iperboli d'azione, e che in sostanza non si vergogna di essere quello che ÃƒÂ¨. Ma se il film di Tarantino tentava una riflessione complessa, metacinematografica e anche ironica sul ruolo e il significato di quel genere Ninja assassin ÃƒÂ¨ quel genere, differenza sottile ma fondamentale tra serie A e serie B.\nDivertente in molti sensi diversi il film rivela nel finale la sua essenza statunitense nel modo in cui trasporta la natura e la filosofia orientale (alla buona) in un contesto occidentale per far trovare al proprio protagonista quella soddisfazione e quella giustizia che in patria (tra fustigate sulle piante dei piedi e baci rubati sotto piogge torrenziali) non riusciva a trovare. Soprattutto fa sorridere (ma con benevolenza) come dopo aver costruito lungo tutta la pellicola l'invincibile abilitÃƒÂ  dei ninja Ozunu conquistata grazie a decenni di addestramento spietato poi questi vengano messi a durissima prova dai potenti mezzi (??) molto poco raffinati dell'Europol. Se si dovesse trarre una morale sembrerebbe che uzi, hummer, bombe e fucili battono spade e stellette anche senza addestramento e giocando fuori casa.\n","torrent":{"xt":"urn:btih:b3a705198bf4dbe464b2d95a8f6558a5294cabd2","amp;dn":"Ninja+Assassin+italian+%5B+www.bt-italiatorrent.org+%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b3a705198bf4dbe464b2d95a8f6558a5294cabd2","infoHashBuffer":{"type":"Buffer","data":[179,167,5,25,139,244,219,228,100,178,217,90,143,101,88,165,41,76,171,210]},"announce":[],"urlList":[]}}