{"title":"Simply Red - Holding Back The Years","uid":4919315,"size":150564868,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:b43c28fa3af56f231a067e5ff5c1f7fbdf3a7011&amp;dn=Simply+Red+-+Holding+Back+The+Years&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"2nafish","files":-1,"time":1243585966,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 256 kbps\n\n\n&quot;Holding Back the Years&quot; is the 7th track of Simply Red's debut studio album Picture Book. The song was a smash success for the group and quickly rose to the top of charts across the world. It remains their most successful single. The single is one of two Simply Red songs (the other being their cover of &quot;If You Don't Know Me by Now&quot;) to reach number one on the Billboard Hot 100, for the week ending July 12, 1986. It also reached #2 in the UK and was a worldwide hit. It had initially been released in the UK the year before, but only reached #51.\n\nThe video for this song was filmed in the English coastal town of Whitby and the famous scene where Hucknall watches the coastal view from his window can be seen on the cover of the single, in its music video and, for a brief time, in the music video of &quot;If You Don't Know Me by Now&quot;. The other band members play the role of the local cricket team who see Hucknall off on his journey.\n\nEastEnders &amp; Shameless actress Maggie O'Neill made her acting debut as the schoolteacher in the video.\n\nFrontman of the group, Mick Hucknall, wrote the song when he was seventeen, while living at his father's house. The chorus did not come to him until many years later. His mother left him when he was three; the upheaval caused by this event inspired him to write the song.\n\nHe recorded a version of the song with his first group &quot;The Frantic Elevators&quot; in 1982 but the real success came when the Simply Red version was released in 1985. In 2005, a brand-new stripped down acoustic version of the song was released on the album Simplified, and this version received heavy airplay on smooth jazz radio stations.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:b43c28fa3af56f231a067e5ff5c1f7fbdf3a7011","amp;dn":"Simply+Red+-+Holding+Back+The+Years","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b43c28fa3af56f231a067e5ff5c1f7fbdf3a7011","infoHashBuffer":{"type":"Buffer","data":[180,60,40,250,58,245,111,35,26,6,126,95,245,193,247,251,223,58,112,17]},"announce":[],"urlList":[]}}