{"title":"MeatMyAss.com - Samantha Sinn","uid":5494288,"size":530850026,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:b72f40e74d95baf03d88bd44bd8d22919b052add&amp;dn=MeatMyAss.com+-+Samantha+Sinn&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"gnice06","files":-1,"time":1271173373,"description":"MeatMyAss.com - Samantha Sinn\n\n\nSpending your Saturday out by the pool in a luxurious cabana is a nice way to start off any weekend. Having blonde beauty Samantha Sinn drop by to inspect your swimming pool ... and your cock, turns a good weekend into one that you will never forget!! After a gentle suck, of course she wants to see the inside of your million dollar home. Let her get comfortable and offer her a drink because this cocksucker is bound to become plenty thirsty with your shlong parked in her throat! Back down on her knees with her sweet pink pussy peeking out from deep inside her tight denim mini-skirt, Samantha shows she is all about sucking cock with a full-power face fuck.When she stands up and starts swallowing her man's rod from above, you can tell he gets tired of her having a gag reflex - so he starts powering his way down her throat even deeper. Samantha climbs aboard with her shoes still on and gets fucked hard from below but it's not until he pins both her wrists behind her back that the boning really begins. On her side with her man spooning her from behind it finally happens' she takes a dick balls-deep in her sexy dumper! When her asshole runs dry it's time for some deepthroat ATM and she knows it. There is only so much cock that this chick can take, so as soon as her hole is ready to burst, she gapes it full diameter and smiles as her man explodes his splooge all the rim of her puckering rectum!\n\nSamantha's asshole is as wet as the swimming pools she inspects, \n- Relentless\n\n\nScreens:\n &lt;a href=&quot;\nhttp://pic.imagefap.com/images/full/43/433/433206384.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://pic.imagefap.com/images/full/43/433/433206384.jpg&lt;/a&gt;\n\n\n\nMore Downloads Here: \n                                                                                  &lt;a href=&quot; http://thepiratebay.se/user/gnice06&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://thepiratebay.se/user/gnice06&lt;/a&gt;","torrent":{"xt":"urn:btih:b72f40e74d95baf03d88bd44bd8d22919b052add","amp;dn":"MeatMyAss.com+-+Samantha+Sinn","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b72f40e74d95baf03d88bd44bd8d22919b052add","infoHashBuffer":{"type":"Buffer","data":[183,47,64,231,77,149,186,240,61,136,189,68,189,141,34,145,155,5,42,221]},"announce":[],"urlList":[]}}