{"title":"Bring It On - Again - 2004","uid":4886031,"size":4681467497,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:b8cb0d2cdd206afa57c161bf6ad1fb790797a826&amp;dn=Bring+It+On+-+Again+-+2004&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"EvilTSAngel","files":-1,"time":1241727103,"description":"Whittier (Anne Judson-Yager) arrives at the fictional California State College hoping to join the national champion varsity cheerleading team. She meets up with her friend from cheerleading camp, Monica (Faune Chambers), and they're both impressive at the tryouts. Head cheerleader Tina (Bree Turner) is ready to ask them to join the team, but Dean Sebastian (Kevin Cooney) goes a step further, telling Tina that Whittier will be the next head cheerleader. This angers Tina's pal Marni (Joie Lenz), who had the position staked out, but Tina goes along with the plan, taking Whittier under her wing. Whittier meets Derek (Richard Lee Jackson), a campus deejay who immediately takes a shine to her. But Tina is very demanding and controlling. She warns Whittier that Derek is not the type of boy she should be dating. Monica is bothered by Tina's meddling, but Whittier momentarily lets her cheerleading ambition get the better of her, and breaks it off with Derek. Then Tina, upset with Monica's sassy attitude, forces Whittier to choose between her friendship and the squad. Whittier and Monica get fed up and quit the team, but Whittier's school spirit cannot be suppressed. With Monica's help, she gathers up the outcasts from the drama club, the dance club, and other groups that have lost their funding and forms a ragtag squad of her own, determined to battle the varsity squad for a spot at the national championship. Directed by Damon Santostefano (Three to Tango), Bring It On Again was released straight-to-video; aside from its subject matter, it has no direct connection to the original Bring It On. ~ Josh Ralske, All Movie Guide\n\n\n\nTheatrical Feature Running Time: 90 mins \nComplete Cast:\nAnne Judson-Yager - Whittier\nFaune Chambers - Monica\nKevin Cooney - Dean Sebastian\nBryce Johnson - Greg\nBree Turner - Tina\nRichard Lee Jackson - Derek\nJoie Lenz - Marni\n\n\nDirector(s):Damon Santostefano\nWriter(s):Claudia Grazioso, Brian Gunn, Mark Gunn\nProducer(s):Thomas A. Bliss, Marc Abraham, Kelli Konop\nTheatrical MPAA Rating: PG13(Adult Language, Adult Situations)\nCategories:Comedy\n\nFormat: DVD\nRelease Date: 01/13/2004\nMPAA Rating: PG13\nRunning Time: 90 min\nNumber of Discs: 1\nLanguage: Eng/Fre/Spa\nSubTitles: Fre/Spa\n  Closed Caption \nView special edition featuresView special edition featuresLimited Edition Features:\ncc\nAlternate opening\nDeleted and alternate scenes\n&quot;Tony G's Cheer Do's and Don'ts&quot; featurette\nFun facts: &quot;Hit Me With Your Best Shot!&quot;\n&quot;You're on the Set of Bring It on Again&quot; featurette\nCheer-along from Bring It On\n\n","torrent":{"xt":"urn:btih:b8cb0d2cdd206afa57c161bf6ad1fb790797a826","amp;dn":"Bring+It+On+-+Again+-+2004","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b8cb0d2cdd206afa57c161bf6ad1fb790797a826","infoHashBuffer":{"type":"Buffer","data":[184,203,13,44,221,32,106,250,87,193,97,191,106,209,251,121,7,151,168,38]},"announce":[],"urlList":[]}}