{"title":"Doomsday Gun-90`s","uid":4318481,"size":757980781,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:b8fcfac5894160f247139804c75a6ad3348f6280&amp;dn=Doomsday+Gun-90%60s&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"jazz3","files":2,"time":1217256576,"description":" Movie Description\nA brilliant arms specialist is driven to create the world&amp;#039;s most powerful weapon, a &quot;Supergun,&quot; to sell to Saddam Hussein. Both the CIA and the British Secret Service are out to foil the scientist&amp;#039;s attempt, but a lone Israeli spy may be the only one able to stop it in time. Based on a true story.\n\nCredits \nCast: Frank Langella \nDirector: Robert M. Young \n\nSynopsis\nBased on the life of Dr. Gerald V. Bull, a weapons manufacturer and arms smuggler who fell victim to an assassin&amp;#039;s bullet. Set just prior to Desert Storm, when Iraq was in the midst of a war with Iran, &quot;Doomsday Gun&quot; relates Bull&amp;#039;s quest to produce the ultimate long-range missile for Saddam Hussein -- despite the attempts of both the American and Israeli Secret Service to stop him.\n\nFilm Notes\nThe film was produced for HBO Showcase, and first aired on July 23, 1994.\n\nAdditional production company: Griffin Productions.\n\nDr. Gerald Bull, the arms manufacturer on whose life this teleplay was based, was fatally shot in his apartment in Brussels, Belgium on March 22, 1990. The killer remains at large. Bull was the inventor of the HARP missile, an extremely long-range cannon capable of hitting a target over 100 miles away, and developed arms for countries such as Chile (under Pinochet&amp;#039;s military government) and South Africa (prior to the lifting of the UN embargo).\n\nCopyright 1994 Home Box Office.\n\nIndustry Reviews\nA winner from HBO&amp;#039;s in-house production unit, &quot;Doomsday Gun&quot; is an able spy thriller made all the more intriguing because it actually happened. An arms specialist becomes obsessed with building the world&amp;#039;s most powerful cannon. He has both the ability and a willing customer - Saddam Hussein. The CIA and the British Secret Service join a lone Israeli Mossad agent in a tense, highly politicized effort to stop &quot;Babylon&quot; from being built. A well-acted, true-life thriller.\nVideoLog by Muze - Robert Nussbaum \n\nQuotations\n&quot;One man built the world&amp;#039;s most diabolical weapon.\n\nNow he&amp;#039;s selling it to America&amp;#039;s most dangerous enemy.&quot; -- marketing line for the film\n\n \n \n \nDid you find errors in this product information? Submit a catalog update request now.  \n \n","torrent":{"xt":"urn:btih:b8fcfac5894160f247139804c75a6ad3348f6280","amp;dn":"Doomsday+Gun-90%60s","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b8fcfac5894160f247139804c75a6ad3348f6280","infoHashBuffer":{"type":"Buffer","data":[184,252,250,197,137,65,96,242,71,19,152,4,199,90,106,211,52,143,98,128]},"announce":[],"urlList":[]}}