{"title":"Big Meat Hammer Please Keep Portland clean LP","uid":6419727,"size":184756147,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:ba8ec0da17efe1827e6ad512a144a125bf6592a3&amp;dn=Big+Meat+Hammer+Please+Keep+Portland+clean+LP&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"gorehound","files":86,"time":1306275076,"description":"Big Meat Hammer are the oldest punk rockers in Maine.The band has been going for the last 21 years.We play old school type punk rock with many influences from the past.We love Iggy,The Deadboys,60's Garage,70's - 80's punk and a ton more bands and music.Most of us are now in our 50's and still playing punk music.This is our second LP with some additional unreleased stuff.Also included are a bunch of images from the famed Fudafest Party.Each year there is a 3 day party in Maine called Fudafest and we have included our fave old Fudafest photo gallery.\n\n\nJordan:Vocals             Jim Rand:Rhythm Guitar\n\nSkummy:Lead and Rhythym Guitar   Tony Frances:Drums\n\nLenny Smith:Bass Guitar is on hiatus\n\nMack:current  Bass  Guitar\n\nWe play old school Punk Rock.Jordan and Skummy have been playing for over 30 years now and are the main song writers in the band.Jim Rand is the Station Manager for WMPG and has supported Punk Rock on the Radio for over 20 years.Bands are welcome to get in touch .Lenny Smith is our bass guitarist who is currnetly in a hospital for treatment and is on hiatus.Mack has been a fan of ours for years and now he has taken over Lenny's bass playing.Mack is also an original Punk rocker.Greg has drummed for us on and of for at least 6 years worth.\n\nIt was Jordan who formed BMH back in 1989.He had played in a Punk Band from Boston which first formed in 1977 called The Transplants.Lenny played in one of Portland's First Punk Bands The Technicians.Skummy had played in Skull 69 and he started playing in bands back in the late 60's.A Punk Band needed to be formed up here that would keep the spirit of free speech alive in a sea of Conformity.Yes Portland is a small city but rest assured BMH does what it can to shake up the community and keep Punk alive.       Punks Not Dead !!!   We have done    Public TV Shows  with Bands playing.............. Underground Home Made Films and lots of Beer Parties.","torrent":{"xt":"urn:btih:ba8ec0da17efe1827e6ad512a144a125bf6592a3","amp;dn":"Big+Meat+Hammer+Please+Keep+Portland+clean+LP","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ba8ec0da17efe1827e6ad512a144a125bf6592a3","infoHashBuffer":{"type":"Buffer","data":[186,142,192,218,23,239,225,130,126,106,213,18,161,68,161,37,191,101,146,163]},"announce":[],"urlList":[]}}