{"title":"Democracy Now - 16 feb 2011","uid":6178833,"size":438777898,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:bb1783108b274f981318c4eb57f71f4996cf9abf&amp;dn=Democracy+Now+-+16+feb+2011&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":null,"files":1,"time":1297873385,"description":"An alternative daily newschannel. One hour with news as you do not see it elsewhere.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n\nHeadlines for Feb 16, 2011\n\n- Pro-Democracy Protests Erupt in Libya; Unrest Continues in Bahrain, Iran, Yemen\n- Obama Suggests Mubarak Regime Didn't &quot;Shoot, Beat, Arrest&quot; Protesters\n- Egyptian Military Vows Democratic Transition in 6 Months\n- Obama Admin Touts Internet Freedom While Targeting Twitter, WikiLeaks\n- Rep. King Introduces Anti-WikiLeaks Espionage Bill\n- Boehner: &quot;So Be It&quot; if Federal Workers Lose Jobs Under Cuts\n- Argentina: U.S. Warplane Carried Unauthorized Weapons\n- Key Bush Admin &quot;Source&quot; Admits to Lying About Iraqi WMD\n- Veterans File Class-Action Suit over Sexual Abuse in Military\n- CBS News Correspondent Hospitalized After Cairo Attack\n- World Bank: Rising Food Prices Push 44 Million into Poverty\n- U.S. Customs Agent Slain in Mexico Attack\n- 15 Recipients Awarded Medal of Freedom\n- Thousands Protest Anti-Public Worker Bill in Wisconsin\n\n\nSpecial reports\n\n- &quot;A War on Women&quot;: GOP Bills Target Abortion, Family Planning, Sexual and Reproductive Health Services\n\nSince taking control of the House last month, Republicans have introduced several major anti-abortion bills that women's rights activists say could place severe limitations on access not only to abortion, but complete reproductive health and family planning services. We speak to Cecile Richards, president of the Planned Parenthood Federation of America, which provides family planning, contraception and abortion services at more than 800 clinics and health centers across the U.S. serving more than 3 million patients a year. No federal dollars are used to fund its abortion services. &quot;The most ridiculous part, for those proposing these bills, is that Planned Parenthood does more to prevent unintended pregnancy and the need for abortion than any other organization in America,&quot; Richards says. &quot;This is not what the American people voted for.&quot;\n\n\n- As Mideast &quot;Rolling Revolution&quot; Grows, U.S. Denounces Iranian Crackdown - But Stays Silent on Key Ally Bahrain\n\n2011 is shaping up to be a historic year in the Middle East and North Africa with the populist uprisings in Tunisia and Egypt and the massive street protests across the region. Libya, Bahrain and Iran are the latest countries to be hit by a wave of popular protests. While President Obama has openly criticized Iran's crackdown on protesters, he has said nothing critical about Bahrain, a close U.S. ally, where two protesters have been killed since Monday. We speak with Human Rights Watch researcher Faraz Sanei.\n\n\n- &quot;The Regime is Running Scared&quot;: Algerian Forces Crack Down on Pro-Democracy Protests\n\nAlgeria has also seen a recent wave of protests. Witnesses say riot police have blocked a planned march in the capital Algiers and arrested hundreds of demonstrators. &quot;The regime is running scared,&quot; says Algerian blogger and activist Elias Filali. &quot;I have never seen a heavier police presence in my entire life.&quot;\n\n\n- Defying Gov't Repression, Yemeni Protests Continue for 6th Day\n\nAnti-government demonstrations in Yemen have entered their sixth day as student demonstrators were beaten by pro-government supporters armed with batons, stones and daggers. The protesters are calling for the immediate resignation of President Ali Abdullah Saleh, who has ruled the country for three decades. The protests have forced President Saleh to cancel a trip to Washington, D.C., scheduled for next month. Yemen is a key ally of the United States in the region and President Obama is proposing to bolster strategic ties. We speak with Iona Craig, a journalist based in the Yemeni capital Sana'a.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;","torrent":{"xt":"urn:btih:bb1783108b274f981318c4eb57f71f4996cf9abf","amp;dn":"Democracy+Now+-+16+feb+2011","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bb1783108b274f981318c4eb57f71f4996cf9abf","infoHashBuffer":{"type":"Buffer","data":[187,23,131,16,139,39,79,152,19,24,196,235,87,247,31,73,150,207,154,191]},"announce":[],"urlList":[]}}