{"title":"Super Mario Bros. Movie","uid":4803600,"size":4508516352,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:bc88fc69cc09cddbb1168b2b22036f6ad8d77f45&amp;dn=Super+Mario+Bros.+Movie&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Brianinmd","files":-1,"time":1238121250,"description":"This is a DVDR version of the movie just burn it to dvd using any computer ISO burner program. If you are interested in just download the file version. Click on the link below.\n &lt;a href=&quot;\nhttp://thepiratebay.se/torrent/4342693/Super.Mario.Bros.Movie.DVDRip.Divx&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/torrent/4342693/Super.Mario.Bros.Movie.DVDRip.Divx&lt;/a&gt;\n\n\n\n Super Mario Bros. is a 1993 film based loosely on the popular video game of the same name. The film follows the exploits of Mario Mario (Bob Hoskins) and his brother Luigi Mario (John Leguizamo) in a comical dystopia ruled by King Koopa (Dennis Hopper). It was the first major motion picture to be based on a video game.\n\nThe story concerns Mario and Luigi, two Italian American brothers living in Brooklyn, New York who are being driven out of business by the gangster-like Scapelli Construction Company. Luigi falls in love with an orphaned college student, Daisy, who is digging under the Brooklyn Bridge for dinosaur bones. After a date, she takes Luigi to the dig and witnesses Scapelli's men sabotage it by leaving the water-pipes open. Mario and Luigi stop the flooding but are knocked out by two strange characters, Iggy and Spike.\n\nMario and Luigi head deeper into the caves following Daisy's screaming and discover an interdimensional portal through which Mario and Luigi follow Daisy. They find themselves in a strange dystopian parallel world where a human-like race evolved from Dinosaurs rather than our own mammalian ancestry. 65 million years ago a meteorite crashed into the Earth and in doing so ripped our universe into 2 parallel dimensions. All the living dinosaurs of the time crossed over into this new realm before being sealed there forever. Iggy and Spike turn out to be lackeys (and cousins) of the other world's evil and feared dictator, King Koopa, descended from the T-Rex. However, the two have failed to also bring Daisy's &quot;rock,&quot; a meteorite fragment which Koopa is trying to get in order to merge his world with the real world that separated from Koopa's world during the meteor strike. It turns out that Daisy is the princess of the other dimension but when Koopa overthrew Daisy's father (and turned him into fungus), Daisy's mom took her to New York using the interdimensional portal. The portal was then destroyed but when Scapelli was blasting at the cave, the portal was reopened. When Koopa hears about the re-opening of the portal, he sends Spike and Iggy to find Daisy and the rock in order to merge the dimensions and make Koopa dictator of both worlds. Koopa thinks only Daisy could merge the worlds. It turns out Mario and Luigi were just in the wrong place at the wrong time. Lucky for Daisy, the plumbers were persistent in finding her.\n\nDuring the big finale, the worlds merge, during which Scapelli gets his comeuppance when Koopa turns him into a primate, but Luigi takes back the rock and the worlds separate. Mario fights Koopa and eventually wins when he and Luigi devolve him, making him a Tyrannosaurus, and then primeval slime. The brothers save the two worlds from a cruel dictator and Daisy's father reclaims control over the kingdom. As the Bros. return home, Luigi and Daisy admit their love for one another but Daisy is not allowed to return to New York with them. Mario re-phrases Daisy's words to Luigi but he isn't buying it. Luigi passionately kisses her goodbye and the two Mario Bros. go back to New York. About 3 Weeks Later, Daisy returns for Mario and Luigi's help in fighting more villians. Meanwhile, we see Mario &amp; Luigi's story on a TV show and they get the name &quot;Super Mario Bros.&quot; just like the video game title.\n\n\nComing soon The Super Mario Brothers Super Show.","torrent":{"xt":"urn:btih:bc88fc69cc09cddbb1168b2b22036f6ad8d77f45","amp;dn":"Super+Mario+Bros.+Movie","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bc88fc69cc09cddbb1168b2b22036f6ad8d77f45","infoHashBuffer":{"type":"Buffer","data":[188,136,252,105,204,9,205,219,177,22,139,43,34,3,111,106,216,215,127,69]},"announce":[],"urlList":[]}}