{"title":"San.Valentino.Di.Sangue.2009.iTALiAN.DVDRip.XviD.LD-SiLENT[volpe","uid":4890899,"size":729196544,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:bca8af08a820be5c5e55ab05ac26c1df76cb285e&amp;dn=San.Valentino.Di.Sangue.2009.iTALiAN.DVDRip.XviD.LD-SiLENT%5Bvolpe&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Volpebianca","files":1,"time":1241983749,"description":":::Scheda del film:::\nSan Valentino di sangue in 3D\n\nTitolo originale:   My Bloody Valentine 3-D\nNazione:   U.S.A.\nAnno:   2009\nGenere:   Horror, Thriller\nDurata:   101'\nRegia:   Patrick Lussier\nSito ufficiale:   www.mybloodyvalentinein3d.com\n\nCast:   Jensen Ackles, Jaime King, Kerr Smith, Betsy Rue, Kevin Tighe, Tom Atkins, Kevin Tighe, Megan Boone, Marc Macaulay, Annie Kitral, Andrew Larson, Brandi Engel\nProduzione:   Lionsgate\nDistribuzione:   Medusa\nData di uscita:   08 Maggio 2009 (cinema)\n\n:::Trama:::\n\nUn incubo sepolto da tempo torna a perseguitare una piccola cittadina manifestandosi in una maniera assolutamente inedita e piÃƒÂ¹ terrificante che mai. Rivisitazione del film originale del 1981 definito da Quentin Tarantino &quot;il miglior splatter di tutti i tempi&quot;, &quot;San Valentino di sangue in 3D&quot; utilizza le recenti tecnologie per mettere gli spettatori al centro di un terrificante incubo senza precedenti. Siamo a Harmony: dieci anni fa una tragedia ha cambiato per sempre la cittÃƒÂ . Tom Hanniger, un minatore senza esperienza, ha causato un incidente all'interno di una galleria sotterranea nel quale sono morti cinque uomini rimasti intrappolati per sempre sotto terra mentre Harry Warden, l'unico sopravvissuto al terribile incidente, ÃƒÂ¨ entrato in coma permanente. Esattamente un anno dopo il terribile incidente, nel giorno di San Valentino, Harry Warden si ÃƒÂ¨ svegliato dal coma e ha ucciso brutalmente 22 persone massacrandole con un piccone. Dieci anni dopo, Tom Hanniger torna ad Harmony proprio nel giorno di San Valentino, ancora ossessionato dai ricordi di quegli uomini morti a causa sua. Tentando di accettare il proprio passato e di superarlo, deve anche fare i conti con i sentimenti contrastanti che ancora prova per la sua ex fidanzata, Sarah, oggi sposata al suo migliore amico Axel, sceriffo della cittÃƒÂ . Ma questa notte, dopo dieci anni di pace, qualcosa emerge dall'oscuro passato di Harmony. Coperto da una maschera da minatore e armato di un piccone, un killer inarrestabile vaga indisturbato e mentre si avvicina sempre di piÃƒÂ¹ alla cittadina, Tom, Sarah e Axel realizzano con immenso terrore che potrebbe essere Harry Warden che ÃƒÂ¨ tornato per uccidere anche loro.\n\nQualitÃƒÂ  audio 8 video 8.5.\n\n","torrent":{"xt":"urn:btih:bca8af08a820be5c5e55ab05ac26c1df76cb285e","amp;dn":"San.Valentino.Di.Sangue.2009.iTALiAN.DVDRip.XviD.LD-SiLENT%5Bvolpe","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bca8af08a820be5c5e55ab05ac26c1df76cb285e","infoHashBuffer":{"type":"Buffer","data":[188,168,175,8,168,32,190,92,94,85,171,5,172,38,193,223,118,203,40,94]},"announce":[],"urlList":[]}}