{"title":"Def Jef - Just A Poet With Soul (1989) &amp; Soul Food (1991)","uid":4910862,"size":174640586,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:be05821b74883fbd3c5d083e77c2856681c1b0f3&amp;dn=Def+Jef+-+Just+A+Poet+With+Soul+%281989%29+%26+Soul+Food+%281991%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"dankencity","files":25,"time":1243161746,"description":"One of the better sociopolitical rappers of the late '80s and early '90s, Def Jef (born Jeffrey Forston) released an excellent debut (1989's Just a Poet With Soul) and a mildly disappointing follow-up (1991's Soul Food) before going into production. When he left the MC spotlight, he worked on records by a number of artists -- as a producer and remixer -- including Nas, 2Pac, Snoop Dogg, Nadanuf, Boss, Bone, and Shaquille O'Neal. He made short appearances in the films Downtown (1990) and Deep Cover (1992), and he also remained active as the music supervisor for MTV's Lyricist Lounge program. In 2002, he and his Kontrol Freaks production unit put together Kontrol Ya'self, a piece of audio software with beats, samples, and tracks. ~ Andy Kellman, All Music Guide\n\nJust A Poet With Soul (1989)\n\n1.Ã‚Â Droppin' Rhymes on Drums - (with Etta James)\n2.Ã‚Â Givin' 'Em Rhythm\n3.Ã‚Â On the Real Tip\n4.Ã‚Â Poet With Soul\n5.Ã‚Â Give It Here\n6.Ã‚Â Do You Wanna Get Housed\n7.Ã‚Â Black to the Future\n8.Ã‚Â Do It Baby - (with N'Dea Davenport)\n9.Ã‚Â God Made Me Funky\n10.Ã‚Â Downtown\n11.Ã‚Â Just a Poet\n\nRaised in Harlem and the Bronx, Def Jef is a talented rapper who hung out in the same neighborhoods that gave us Grandmaster Flash &amp; the Furious Five, Kurtis Blow and the Treacherous Three and was exposed to their music at an early age. When he moved to Los Angeles and signed with Delicious Vinyl in the late 1980s, the influence of hip-hop's old school remained. Jef's debut album, Just a Poet With Soul, wasn't as big a seller as the albums Young MC and Tone Loc had recorded for Delicious, but jams like &quot;Droppin' Rhymes on Drums&quot; (which employs Etta James as a background singer), &quot;God Made Me Funky&quot; and &quot;Give It Here&quot; made it clear that his rapping skills were first-rate. Jef is at his most interesting on the excellent sociopolitical offerings &quot;Black to the Future&quot; and &quot;Downtown,&quot; both of which make us wish he devoted more time to message songs and less time to boasting lyrics. But even so, Poet With Soul is exhilarating and relentlessly funky. ~ Alex Henderson, All Music Guide\n\nSoul Food (1991)\n\n1. Poet's Prelude\n2. Get Up 4 the Get Down\n3. Soul Provider\n4. Here We Go Again\n5. Cali's All That\n6. Brand New Heavy Freestyle\n7. Soul Is Back\n8. Shadow of Def\n9. Fa Sho Shot\n10. Don't Sleep (Open Your Eyes)\n11. Soul Food (A Hip Hop Duet)\n12. Voice of a New Generation\n13. God Complex\n\nDef Jef followed up Just a Poet With Soul with the equally likable Soul Food, which regrettably didn't bring the underexposed L.A.-based rapper the commercial success he deserved. The CD's more sociopolitical songs are also its best, including &quot;Get Up 4 the Get Down,&quot; &quot;Don't Sleep (Open Your Eyes)&quot; and the reggae-Influenced &quot;Voice of a New Generation.&quot; But Jef is also quite enjoyable on more escapist tunes like &quot;Cali's All That&quot; (a duet with Tone Loc), &quot;Fa Sho Shot&quot; (which samples L.T.D.'s 1977 hit &quot;Back In Love Again&quot;), and the single &quot;Here We Go Again.&quot; Jef may have been &quot;coolin' in Cali,&quot; but Soul Food is a very East Coast-sounding disc illustrating the fact that the MC never forgot his New York upbringing. ~ Alex Henderson, All Music Guide\n\n","torrent":{"xt":"urn:btih:be05821b74883fbd3c5d083e77c2856681c1b0f3","amp;dn":"Def+Jef+-+Just+A+Poet+With+Soul+%281989%29+%26+Soul+Food+%281991%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"be05821b74883fbd3c5d083e77c2856681c1b0f3","infoHashBuffer":{"type":"Buffer","data":[190,5,130,27,116,136,63,189,60,93,8,62,119,194,133,102,129,193,176,243]},"announce":[],"urlList":[]}}