{"title":"VA-Beach.Lounge.Hot.Summer.Edition.2cd.(2008)","uid":4413457,"size":222690783,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:bede84525ca32bff8227ff20c2a4aed1f6abe760&amp;dn=VA-Beach.Lounge.Hot.Summer.Edition.2cd.%282008%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Bajandoestrenos","files":1,"time":1222382163,"description":"House\n\nCD1\n01. Tdj feat. Romy - With You (Intrigue dub Extended)\n02. Fibonacci - La Puerta Del Sol (Privilege mix)\n03. Kandi Kids - Hed Fantasy (Soulshifters remix)\n04. Dub Armada and Mireya - Esperando (Joey Flores Groove dub)\n05. Rike Boomgaarden - Let Love Shine (Smoove Full vocal mix)\n06. Endless Summer feat. Nikki - On the Beach (Delanos Envy mix)\n07. Tomtempl feat. Pat Appleton - Fly to Sunshine (Original mix)\n08. Calabria Inc feat. Celina Cruz - Cheo (from Dusk Til Dawn mix)\n09. Son of A Beach - Sex and the City (10 Things not to Say to A Woman)\n10. Le Foxx - Spanish Kiss (Brothers of Bliss French House mix)\n11. X- Files of House - I Dont Care (Mike Kamins Smooth Beat mix)\n12. Burnin House feat. Carly - Rehab Miami (WMC Rooftop dub)\n13. The Chronicles of Ibiza - Vaya Con Dios (Martinez remix)\n14. La Marina - Al Puerto (Ibiza Chillhouse version)\n15. Es Canar - La Ducha Que Canta (Pacha bootleg mix)\n16. Livehou5 feat. Iman - To Your Mind (Vinzent Schwarz remix)\n17. Drama Baby - Deeper (Next Topmodel remix)\n........\n\nCD2\n01. Groove Police - Groove Control (Lounge House dub)\n02. Island Affairs - The Beach Club (Dubfather Balearic mix)\n03. Michel Nieppenberg - London Cab (Calling Ibiza version)\n04. Matthew Kramer - Mainhattan Memories (Extended album mix)\n05. Robie - Footsteps in the Sand (No Coldplay on the Beach dub)\n06. Chanel Luv feat. Eshantelle - Freemasons (Perception remix)\n07. Maestro and Cabal - Escuchame Mi Amore (Viva la Vida Tribal dub mix)\n08. Hainbook - Cold Days (Bring Back da Sun)\n09. Nu Porn Addicts - If it would Be that Easy (the Penthouse Sessions mix)\n10. Tom and Flow - Deep Play (190 East mix)\n11. Climatic - Everything (Winehouse Project mix)\n12. Vara Del Rey - Los Cumpleanos de Las Balenas (Bar Celona edit)\n13. Alvaro Caldera - La Dije A Bailar (Playa Ibiza dub mix)\n14. Cielo E Terra Project - Have You Ever (Tony Rivera remix)\n15. Dibujo Blanco - Que Buene Otra Vez (Estudio Paradiso mix)\n16. Steve Osaka - Dans la Nuit (Les Baines Douches remix)\n17. Fudge X - Shake Ya (at the Playboy Mansion)\n","torrent":{"xt":"urn:btih:bede84525ca32bff8227ff20c2a4aed1f6abe760","amp;dn":"VA-Beach.Lounge.Hot.Summer.Edition.2cd.%282008%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bede84525ca32bff8227ff20c2a4aed1f6abe760","infoHashBuffer":{"type":"Buffer","data":[190,222,132,82,92,163,43,255,130,39,255,32,194,164,174,209,246,171,231,96]},"announce":[],"urlList":[]}}