{"title":"Charles Hawtrey - Audio Documentary - MP3 - Slimoo","uid":5520655,"size":26598967,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:c331c15222c5a5c7656af2a582273a4dd7cc9d09&amp;dn=Charles+Hawtrey+-+Audio+Documentary+-+MP3+-+Slimoo&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"_Slimoo_","files":1,"time":1272618987,"description":"Charles Hawtrey - That Funny Fella With The Glasses - Audio Documentary - BBC Radio 4 \n1 x 30 minute episodes - 128Kbps - Mp3 - Slimoo\n\nIn their first ever interviews Charles Hawtrey's inner-circle share with us compelling anecdotes and memories of the Carry On star, presenting a unique insight into one of Britain's most memorable comedy actors.\n\nCharles Hawtrey is one the most recognisable characters from the Carry On film series, but it is his hidden talents and tragic decline that this programme reveals.\n\nHawtrey was a man destined for stardom: a silent film actor by five, England's leading boy soprano by twelve, a self-taught classical pianist, theatrical producer, film director and prolific radio star. He eventually moved into television and found a &quot;worldwide identity&quot; through his twenty four Carry On roles.\n\nHowever during the latter part of his career he ended up an alcoholic appearing in low-rate stage shows.\n\nHis sad decline and life before the Carry Ons is revealed by writer and broadcaster Wes Butters, who after several years of research has collected recordings with the people closest to Hawtrey and has access to unseen private papers which uncover a remarkable story.\n\n\nCharles Hawtrey - That Funny Fella With The Glasses\n\n\n\nAudio Format : MP3\nDuration : 28mn 1s\nBit rate mode : Constant\nBit rate : 128 Kbps\nChannel(s) : 2 channels\nSampling rate : 44.1 KHz\nResolution : 16 bits\n\n\n\n\n[b]\nA number of people are posting my torrents on other trackers.\nI have no problem with that - (Not much need as I already do this) - But a name check would be nice\nI was the one who spent weeks,months,years recording them.\n\nThere is little point in downloading a &quot;Torrent&quot; and then recreating a &quot;Torrent&quot; using the same files.\n\nThe fact there was a torrent for you to download is clear you don't need to use the files to make another exactly the same version,\n\nAll you will do is split seeders over 2 torrents with the &quot;same&quot; files and make both have less seeders.\n\n\n\n[/b]\n","torrent":{"xt":"urn:btih:c331c15222c5a5c7656af2a582273a4dd7cc9d09","amp;dn":"Charles+Hawtrey+-+Audio+Documentary+-+MP3+-+Slimoo","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c331c15222c5a5c7656af2a582273a4dd7cc9d09","infoHashBuffer":{"type":"Buffer","data":[195,49,193,82,34,197,165,199,101,106,242,165,130,39,58,77,215,204,157,9]},"announce":[],"urlList":[]}}