{"title":"Living In A Box - Living In A Box  (2nafish)","uid":5424401,"size":112769028,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:c415123370ecc38e649cf95ef0cdd951bc36574a&amp;dn=Living+In+A+Box+-+Living+In+A+Box++%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":-1,"time":1268197492,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\n&quot;Living in a Box&quot; is a song by alternative rock band Living in a Box in 1987 as their debut single and the first single from their self-titled debut album of the same name, Living in a Box.\n\nThe song has many features of 1980s song, including a synthesizer-led beat, with Richard Darbyshire's soulful vocal delivery over it.\n\nIt was the group's biggest hit single on either side of the Atlantic, reaching #5 in the UK Singles Chart and becoming the group's only Top 40 hit in the United States, peaking at #17 on the Billboard Hot 100.\n\nThe song was covered by Bobby Womack, who had worked with Living in a Box on their debut album: his version reached No. 70 in the UK and was a minor US hit.\n\nLiving in a Box were a British pop band from the 1980s and early 1990s. They are best known for their eponymous debut single, produced by Richard James Burgess.\n\nLiving in a Box were formed in 1985 in Sheffield, rising from the ashes of Typhoon Saturday (who also featured Nick Robinson). Their most commercially successful single, &quot;Living in a Box&quot;, peaked at number 5 on the UK Singles Chart, and was the band's only single to chart in the Top 40 of the Billboard Hot 100 in the U.S.. They enjoyed more success in their home country, releasing their self-titled debut album in 1987 and a follow-up album, Gatecrashing, in 1989, which went on to generate two further UK Top Ten hits, &quot;Blow The House Down&quot; (#10) and &quot;Room In Your Heart&quot; (#5). Artistic differences, as well as changes to their record label Chrysalis, caused the band to break up in 1990 before their third LP could be released.\n\nLead vocalist Richard Darbyshire continued his long-standing music career, and went on to enjoy modest success as a solo artist, writing songs for artists such as Lisa Stansfield, as well as releasing two solo albums. These were How Many Angels (1994) and Love Will Provide (1999), which came as a reissue of How Many Angels, and included several new and unreleased tracks.\n\nThe song &quot;Living in a Box&quot; was later covered by Bobby Womack, who had also worked with Living in a Box on their debut album.\n\nThe band's drummer, Anthony 'Tich' Critchlow, retired from the music industry after the band split, and he now runs his own company providing bespoke illumination and lighting installations.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:c415123370ecc38e649cf95ef0cdd951bc36574a","amp;dn":"Living+In+A+Box+-+Living+In+A+Box++%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c415123370ecc38e649cf95ef0cdd951bc36574a","infoHashBuffer":{"type":"Buffer","data":[196,21,18,51,112,236,195,142,100,156,249,94,240,205,217,81,188,54,87,74]},"announce":[],"urlList":[]}}