{"title":"Operation Pacific-1951-","uid":3627284,"size":4227713453,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:c5f47aa3acd2cdcceac03bd6a6083c0ebc1c09f7&amp;dn=Operation+Pacific-1951-&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"ALICANTI","files":13,"time":1172512000,"description":"Operation Pacific\n\nYear:1951\n\nDirector:George Waggner\n\nCast:John Wayne, Patricia Neal, Ward Bond, Scott Forbes, Philip Carey, Paul Picerni, Martin Milner, Jack Pennick, William Campbell\n\nLength:111 min.\n\nVideo PAL\n\nAspect Ratio: 1.37:1 , 4:3\n\nLanguages:English,Spanish Dolby Digital \n\nSubtitles:English,Italian,Spanish,Portuguese,Dutch,French,Danish,Finnish,Icelandic,Swedish,Croatian,Czech,Hungarian,Polish,Turkish,Slovenian\n\nReauthoring: DVDREMAKE warnings removed \n\nSynopsis:It&amp;#039;s hard to decide which genre provided John Wayne the greater opportunity to showcase his talents - the &quot;Western&quot; or the &quot;War Movie&quot;. Clearly, he excelled at both (and had more than a few opportunities to demonstrate it). Personally, I&amp;#039;ve always been a greater fan of his westerns, but when this film appeared on one of my favorite cable channels this afternoon, I found myself willingly drawn in. Although a lot of its elements are standard WWII fare, Operation Pacific still demonstrates why the genre has proven so successful to Hollywood.\n\nThis one includes all the cliches - the tragedy of lives lost for a just cause (in this case, the war in the Pacific), the heroism of the men who gave up their lives for that cause (here it&amp;#039;s a submarine crew based out of &quot;Pearl&quot;), and the women forced to wait patiently while the men they loved went into harm&amp;#039;s way.\n\nAlthough a lot of this seems outdated and stereotyped some 50 years later, the movies that were made during and immediately following WWII nevertheless reflect the ideals and values that drove an entire nation (and generation) to act and feel as it did. My own father, who was a Navy man during the war, was a big fan of John Wayne. I have to believe that Wayne personified some of the very same values my father had come to embrace as a youth and during his time in the military. For me, this adds some validity and perspective.\n\nI know this is not considered to be Wayne&amp;#039;s best war film (and admit to not being an enthusiastic student of the genre), but I&amp;#039;m confident that it&amp;#039;s a good example of why these films were (and remain) so popular......Author: JohnSol","torrent":{"xt":"urn:btih:c5f47aa3acd2cdcceac03bd6a6083c0ebc1c09f7","amp;dn":"Operation+Pacific-1951-","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c5f47aa3acd2cdcceac03bd6a6083c0ebc1c09f7","infoHashBuffer":{"type":"Buffer","data":[197,244,122,163,172,210,205,204,234,192,59,214,166,8,60,14,188,28,9,247]},"announce":[],"urlList":[]}}