{"title":"Jade dynasty","uid":4970001,"size":1552547054,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:c708feb420c6836b1250b0388aa9778e7f581267&amp;dn=Jade+dynasty&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"dog10dog","files":1,"time":1245722242,"description":" &lt;a href=&quot;http://jd.perfectworld.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://jd.perfectworld.com/&lt;/a&gt;\n\n\nIt has always been man's greatest goal to uncover the secret of immortality.\n\nThe quest to eternal life has always and will always begin with knowledge. But is there a single, unified truth?\n\nCenturies ago, five factions arose teaching with what each felt was the true path to enlightenment. Two walked the path of good, while three walked the path of evil. These five factions, through many years of research and studying, have cultivated the ability to channel their chi and control magic.\n\nHistory is always fated to repeat itself. Not much has changed; the five factions remain, each promising knowledge, training and the ultimate goal of immortality to every recruit.\n\nNow, in the realm of Jade Dynasty, you find yourself torn between the siren call of each Faction. Each will grant a different power to pave your path to immortality.\n\nWill you follow the path of good, and choose Jadeon, named for their leader who uncovered the magic sword Regenesis; or Skysong, the Buddhist order that harnesses the power of holy mantras for healing?\n\nOr will you choose the path of Evil, joining the single-minded Vim, the secretive, vampire-like Modo or perhaps Lupin, who trains to their followers to move and think like assassins.\n\nThe time has come for you to join history's ranks.\n\nChoose a side, choose a faction and unlock your own story of immortalit","torrent":{"xt":"urn:btih:c708feb420c6836b1250b0388aa9778e7f581267","amp;dn":"Jade+dynasty","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c708feb420c6836b1250b0388aa9778e7f581267","infoHashBuffer":{"type":"Buffer","data":[199,8,254,180,32,198,131,107,18,80,176,56,138,169,119,142,127,88,18,103]},"announce":[],"urlList":[]}}