{"title":"Monty.Pythons..LiFe.Of.BriaN..DVDrip.(vice)","uid":4956179,"size":347054351,"categoryP":"video","categoryS":"handheld","magnet":"?xt=urn:btih:c899dc546506f3cba467006506991bdf9486dd0c&amp;dn=Monty.Pythons..LiFe.Of.BriaN..DVDrip.%28vice%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"vicerock","files":-1,"time":1245112824,"description":"COMEDY\nAUDIO ENGLISH\n\nMONTY PYTHON LIFE OF BRIAN...PSP...IPOD...MP4\n\nBrian Cohen is born in a stable a few doors from the one in which Jesus is born, a fact which initially confuses the three wise men who come to praise the future King of the Jews. They manage to put up with Brian's boorish mother Mandy until they realise their mistake. Brian grows up an idealistic young man who resents the continuing Roman occupation of Judea, even after learning his father was a Roman Centurion - Naughtius Maximus - who raped Brian's mother (&quot;You mean; you were raped?&quot;, &quot;Well, at first, yes&quot;). While attending Jesus' Sermon on the Mount, he becomes infatuated with an attractive young female rebel, Judith. His desire for her and hatred for the Romans lead him to join the People's Front of Judea (PFJ), one of many factious and bickering separatist movements who spend more time fighting each other than the Romans (see Political satire below). The group's cynical leader Reg gives Brian his first assignment: He must scrawl some graffiti on the wall of the governor's palace. Just as he finishes doing this, he is confronted by a passing centurion who, in disgust at Brian's faulty Latin grammar (&quot;Romanes eunt domus&quot;, or &quot;the people called 'Romanes' they go the house&quot;), forces him to write the grammatically correct message (&quot;Romani ite domum&quot; or &quot;Romans, go home&quot;) 100 times. By dawn, the walls of the fortress are covered in text. When the Roman guards change shift at daybreak, the new guards try to arrest Brian, but he manages to slip away with the help of Judith.\n\nBrian then agrees to participate in a kidnapping plot by the resistance, which fails miserably (due to a clash with an &quot;enemy&quot; separatist faction intent on the same mission) and forces him to go on the run again. This time, he doesn't evade capture and is summoned before Pontius Pilate. He tries to get away with it by claiming his Roman heritage, as the son of Naughtius Maximus. The captain of the guards refuses to believe the authenticity of the name. Pilate does not understand his doubt, to which the captain remarks that it would be like someone being named &quot;Sillius Soddus or Biggus Dickus.&quot; Fortunately for Brian, the guards collapse into a giggling fit after an irate Pilate reveals that one of his best friends is a high-ranking centurion genuinely named Biggus Dickus (with a wife, Incontinentia Buttocks) and he makes his escape.\n\nPLEASE...SEED...AND...ENJOY...THANKS","torrent":{"xt":"urn:btih:c899dc546506f3cba467006506991bdf9486dd0c","amp;dn":"Monty.Pythons..LiFe.Of.BriaN..DVDrip.%28vice%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c899dc546506f3cba467006506991bdf9486dd0c","infoHashBuffer":{"type":"Buffer","data":[200,153,220,84,101,6,243,203,164,103,0,101,6,153,27,223,148,134,221,12]},"announce":[],"urlList":[]}}