{"title":"The Complete Genealogy Reporter v2008.1.80821","uid":4394513,"size":3926766,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:c935dc6e5b99b62b5af1ac9d8378a70a505d127d&amp;dn=The+Complete+Genealogy+Reporter+v2008.1.80821&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Jodyanne","files":3,"time":1221354977,"description":"Screenshot: &lt;a href=&quot;\nhttp://jody.hopto.org/imagehost/images/jody/thecompletegenealogyreporterv2008.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://jody.hopto.org/imagehost/images/jody/thecompletegenealogyreporterv2008.jpg&lt;/a&gt;\n\nInfo:\nThe Complete Genealogy Reporter enables users of genealogy software and websites to create comprehensive narrative reports and hyperlinked web folders from the contents of a standard GEDCOM file. The output may be configured to incorporate some or all of the people and families recorded in the GEDCOM file.\n\nThe Complete Genealogy Reporter was created primarily to create full and comprehensive printed reports, both for personal reference and to give to family members who may not be adept with computer and genealogy tools.  It is also a powerful tool for proof-reading the key content of a GEDCOM file.\n\nThe Complete Genealogy Reporter differs from standard Ahnentafel (ancestor) and Modified Register (descendant) reports, and almost all other types of narrative report, in the following ways:\n\nNarratives\n\n    * Full details of all aunts, uncles, and cousins, plus their descendants may be included.\n    * Thumbnail pictures of individuals may be included in the narrative.\n    * Indirect branches may be included in the report. (Indirect branches are the relations of people who married into the subject&amp;#039;s family.)\n    * Unconnected individuals may be included in the report.\n    * The relationship to the subject of each reported individual may be fully described. (e.g., &quot;Second cousin by marriage, once removed&quot;).\n    * Children birthdates and occupation/residence events may be sorted by year (irrespective of the order recorded in the GEDCOM file).\n    * Unknown names may be rationalized into a standard form. (When this option is selected, unknown first names are reported as Mr. or Ms., and unknown last names are reported as &quot;Unknown&quot;.)\n    * The upper/lower cases of names may be reported in a standard form of &quot;Jane McKie&quot;, irrespective of the cases of the names in the GEDCOM file.\n    * Ages of individuals at the times of events may be included.\n    * Dates (however expressed in the GEDCOM file) are processed and reported in a standard format of either &quot;1 May 1888&quot; or &quot;May 1, 1888&quot;\n\nIntroduction and Appendices\n\n    * Customizable sections which permit the inclusion of user-defined texts in the report.\n\nTree Charts\n\n    * Ancestry trees of each of the subject&amp;#039;s parents may be included.\n    * Family Tree charts may be included as a section of the report. These are shown as four-generation segments which are fully cross-referenced between themselves and with the narrative sections. \n\nMedia\n\n    * In addition to narrative thumbnails, picture media may be included as a section of  the report.  The supported file types are BMP, CUT, GIF, IFF, JPG, LBM, PBM, PCT, PCX, PGM, PNG, PPM, PSD, SGI, TGA, TIF, WMF, XBM, and XPM.  These are shown six per page and are fully cross-referenced to and from the narrative sections.\n    * A picture of the subject may be included on the Front Page.\n    * Media associated with burials (BURI tags) are reported as a separate &quot;Places of Rest&quot; Section.\n    * Media tagged as documents (&quot;_SCAN Y&quot; or &quot;_TYPE DOCUMENT&quot; tag) are reported as a separate &quot;Documents&quot; Section.  These may be shown as one, two, or six images per page.  Also, an identification string may be included in a media NOTE (&quot;Picture Description in Legacy&quot;) to identify a media item as a document.\n    * Cutout images (&quot;Marked Faces&quot; in Family Tree Builder and &quot;Frame Links&quot; in Family Historian) are fully supported.\n\nNotes\n\n    * Notes may be reported within the narrative or within a separate section which is fully cross-referenced to and from the narrative sections.\n    * Notes may be attached to sources, or have sources attached.\n    * Notes may be attached to media items.\n\nReference Sources\n\n    * Sources may be reported within the narrative or within a separate section which is fully cross-referenced to and from the narrative sections.\n    * Sources may be attached to notes, or have notes attached.\n    * Sources may be attached to media items.\n    * Page, Quality, and Repository data is reported (if present).\n\nCross-Referencing, Indexing and Formatting\n\n    * All content is fully cross-referenced.\n    * An Index of Occupations may be included in the report.\n    * An Index of Places may be included in the report.\n    * An Index of Causes of Death may be included in the report.\n    * An Index of Dates (by year) may be included in the report.\n    * An Index of Anniversaries (by month and day) may be included in the report.\n    * A full alphabetical index of names may be included in the report.\n    * Book formatting options are available, for single-sided or two-sided printing, with adjustable margin offsets.\n\nOutput Options\n\n    * Arial (sans serif) or Times New Roman (serif) font.\n    * Selection of font sizes.\n    * To a printer\n    * To an Adobe Acrobat compatible PDF file\n    * To an Adobe Acrobat compatible PDF file including hyperlinked cross-references\n    * As a series of fully formatted web pages in a local web folder (with or without frames).  These may be transferred to an online website.\n    * To a text file (unformatted, no media)\n\nThe unformatted text file is intended to provide a method of proof reading the contents of your GEDCOM file in a concise and easy-to-read form in order to swiftly review the content and to isolate omissions, errors, and inconsistencies. The content (except media) is identical to the fully formatted report.","torrent":{"xt":"urn:btih:c935dc6e5b99b62b5af1ac9d8378a70a505d127d","amp;dn":"The+Complete+Genealogy+Reporter+v2008.1.80821","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c935dc6e5b99b62b5af1ac9d8378a70a505d127d","infoHashBuffer":{"type":"Buffer","data":[201,53,220,110,91,153,182,43,90,241,172,157,131,120,167,10,80,93,18,125]},"announce":[],"urlList":[]}}