{"title":"Mickey Avalon - Mickey Avalon","uid":3805716,"size":76108900,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:ca19a019352a845977d91706a5f2994df595f5d0&amp;dn=Mickey+Avalon+-+Mickey+Avalon&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"dtuma1980","files":12,"time":1189724440,"description":"MICKEY AVALON - MICKEY AVALON\n\n01-Waiting to Die.mp3\n02-So Rich, So Pretty.mp3\n03-Jane Fonda.mp3\n04-Roll The Dice.mp3\n05-Mr. Right.mp3\n06-Hustler Hall Of Fame.mp3\n07-Roll Up Your Sleeves.mp3\n08-Friends And Lovers.mp3\n09-Dipped In Vaseline.mp3\n10-Romeo &amp; Juliet.mp3\n11-Mifesto.mp3\n12-My Dick.mp3\n\nAs sad as the story of glam-rapper Mickey Avalon\\\\\\\\\\\\\\&amp;#039;s life is (or is supposed to be) -- full of various drug addictions, prostitution, deaths, and other rather life-altering experiences -- he sure knows how to write a catchy hook. \\\\\\\\\\\\\\&quot;Jane Fonda,\\\\\\\\\\\\\\&quot; a poppy trash-rap song about some of the various women he\\\\\\\\\\\\\\&amp;#039;s been with, which became a favorite among the MySpace crowd (unsurprisingly, Mickey Avalon is the first release off the music networking site\\\\\\\\\\\\\\&amp;#039;s label) is in itself representative of all that the performer is: a quick fix. There\\\\\\\\\\\\\\&amp;#039;s nothing about Avalon\\\\\\\\\\\\\\&amp;#039;s music that\\\\\\\\\\\\\\&amp;#039;s particularly innovative or good (even the irreverent candidness that is his most interesting attribute has been done before), but for those moments it\\\\\\\\\\\\\\&amp;#039;s on, there\\\\\\\\\\\\\\&amp;#039;s something oddly satisfying about it, engaging in that way that hedonists and drug abusers are to those around them, attractive to that voyeuristic side of us that views everything with an expression of half-horror and half-envy. Avalon seems so desperate in his need to be liked (as he brags about his prowess in the bedroom and rhyming skills) that even though he\\\\\\\\\\\\\\&amp;#039;s aware of his and his peers\\\\\\\\\\\\\\&amp;#039; hypocrisy, he doesn\\\\\\\\\\\\\\&amp;#039;t quite understand how far it goes, or how sad and weak it makes him seem. Fans love him because not only does he ooze sexuality, but because he\\\\\\\\\\\\\\&amp;#039;s practically begging them to love him, he\\\\\\\\\\\\\\&amp;#039;s needy and wants attention, and pouring liquor down their throats and baring his ass (two things he often does at concerts) are the only ways he knows to show this.\n \nAll of this helps to partially obscure the fact that the music itself is terrible -- rhymes don\\\\\\\\\\\\\\&amp;#039;t get much worse than \\\\\\\\\\\\\\&quot;Jen was a hurdy gurdy dirty little girly/I heard from a birdie she could cook a mean turkey/With gravy, baby baby baby\\\\\\\\\\\\\\&quot; -- because somehow the whole reincarnation of Bowie and T-Rex in hip-hop works, sucking you guiltily into its sleazy existence with a gusto that\\\\\\\\\\\\\\&amp;#039;s hard to refuse. This isn\\\\\\\\\\\\\\&amp;#039;t anything new for the music world, but it fits with Avalon, which means it\\\\\\\\\\\\\\&amp;#039;s when he moves away from his androgynous party boy image into something more serious that things start to go badly. Because his whole shtick is based on the tongue-in-cheek \\\\\\\\\\\\\\&quot;I\\\\\\\\\\\\\\&amp;#039;m making fun of you but also of myself\\\\\\\\\\\\\\&quot; meets \\\\\\\\\\\\\\&quot;I just want to be loved\\\\\\\\\\\\\\&quot; meets \\\\\\\\\\\\\\&quot;let\\\\\\\\\\\\\\&amp;#039;s get obliterated,\\\\\\\\\\\\\\&quot; making for a pathetic image that\\\\\\\\\\\\\\&amp;#039;s strangely appealing, either, depending on where you stand, because of Avalon\\\\\\\\\\\\\\&amp;#039;s near oblivion to it or because of its disarming similarity to your own life. And so when he addresses heavier subjects without some of the lightness he\\\\\\\\\\\\\\&amp;#039;s often able to bring (as he successfully does in \\\\\\\\\\\\\\&quot;So Rich, So Pretty,\\\\\\\\\\\\\\&quot; where he rhymes \\\\\\\\\\\\\\&quot;she\\\\\\\\\\\\\\&amp;#039;s gotta dress with class/won\\\\\\\\\\\\\\&amp;#039;t say sorry when she offends\\\\\\\\\\\\\\&quot; about a girl who \\\\\\\\\\\\\\&quot;eats and brings it up/A sassy little frassy with bulimia,\\\\\\\\\\\\\\&quot; among other things), his actual lack of musical talent -- as opposed to performance talent -- shines through brightly. Both \\\\\\\\\\\\\\&quot;Hustler Hall of Fame\\\\\\\\\\\\\\&quot; and \\\\\\\\\\\\\\&quot;Roll Up Your Sleeves,\\\\\\\\\\\\\\&quot; on which he tries to rhyme over tired gangsta beats, miss the mark completely, and even the macabre \\\\\\\\\\\\\\&quot;Roll the Dice\\\\\\\\\\\\\\&quot; comes across as preachy and boring. His lines are always bad but when they\\\\\\\\\\\\\\&amp;#039;re coupled with stale beats they become almost unbearable. Still, there\\\\\\\\\\\\\\&amp;#039;s something almost touching about him (which was surely not the result he was going for). He\\\\\\\\\\\\\\&amp;#039;s prostituting himself to the music industry for the same reasons he (said he) prostituted his actual body: as a mean to satisfy a craving, an addiction; before it was sex for drugs and now it\\\\\\\\\\\\\\&amp;#039;s Mickey Avalon for whatever love and fame he\\\\\\\\\\\\\\&amp;#039;ll receive from it.","torrent":{"xt":"urn:btih:ca19a019352a845977d91706a5f2994df595f5d0","amp;dn":"Mickey+Avalon+-+Mickey+Avalon","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ca19a019352a845977d91706a5f2994df595f5d0","infoHashBuffer":{"type":"Buffer","data":[202,25,160,25,53,42,132,89,119,217,23,6,165,242,153,77,245,149,245,208]},"announce":[],"urlList":[]}}