{"title":"Tom Clancys EndWar PC-DVD Spanish EN GE FR IT","uid":4740883,"size":7249756623,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:cc14dba151d59f28dede9c6724b75e4677ceea1a&amp;dn=Tom+Clancys+EndWar+PC-DVD+Spanish+EN+GE+FR+IT&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Mois20","files":5,"time":1235554307,"description":"La mente creativa de Tom Clancy parece no tener fin. El autor, responsable de algunas de las obras literarias militares mÃƒÂ¡s importantes, sigue colaborando con Ubisoft en la creaciÃƒÂ³n de nuevas licencias y entregas de tÃƒÂ­tulos que adapten a un mando de control su narrativa. El nuevo miembro de la familia Tom Clancy responde al nombre de EndWar, y es obra de la filial de la compaÃƒÂ±ÃƒÂ­a gala en Shanghai. Una divisiÃƒÂ³n que tiene con este tÃƒÂ­tulo su gran oportunidad para reivindicarse y demostrar que tiene tanto que decir como otras de las grandes sedes de la compaÃƒÂ±ÃƒÂ­a. Cuanto menos, demuestran que saben utilizar con acierto la tecnologÃƒÂ­a que tienen a su alcance.\n\n\n\nHan elegido utilizar como base el mismo universo de otros tÃƒÂ­tulos Tom Clancy como Ghost Recon, Rainbow Six, Splinter Cell o el futuro HAWX, pero ofreciendo un enfoque completamente novedoso al sistema de juego, ya que ahora podremos dar ÃƒÂ³rdenes directas, mucho mÃƒÂ¡s rÃƒÂ¡pido, a nuestras tropas utilizando simplemente nuestra voz. Una original propuesta que funciona a la perfecciÃƒÂ³n, pero que desgraciadamente se ve acompaÃƒÂ±ada de un apartado tÃƒÂ©cnico algo discreto y un modo historia poco menos que testimonial, convirtiÃƒÂ©ndose en una alternativa principalmente online. Eso sÃƒÂ­, la mano del autor norteamericano se nota bien a la hora de presentar las innovaciones militares y la tensiÃƒÂ³n polÃƒÂ­tica que darÃƒÂ¡n forma al argumento.\n\n\n\nFuturo peligroso\nToda la acciÃƒÂ³n del tÃƒÂ­tulo transcurre en el futuro, pero se nos narra cÃƒÂ³mo se han sucedido los acontecimientos a lo largo de los aÃƒÂ±os. En el aÃƒÂ±o 2011, Estados Unidos y la UniÃƒÂ³n Europea firman un tratado para la colaboraciÃƒÂ³n en el desarrollo tecnolÃƒÂ³gico y militar. Un completo ÃƒÂ©xito en las pruebas, que supone lo que ambas entidades proclaman, en 2014, como el final de la guerra nuclear, lo cual acarrea consigo la paz para el mundo. Pero no durarÃƒÂ­a demasiado, ya que un aÃƒÂ±o despuÃƒÂ©s los recursos energÃƒÂ©ticos alcanzan unos niveles crÃƒÂ­ticos, algo de lo que se aprovecharÃƒÂ­a Rusia, la cual utilizarÃƒÂ­a sus ingresos energÃƒÂ©ticos para desarrollar nuevas armas.\n\n\n\nEn 2016, una guerra nuclear afectarÃƒÂ­a a Arabia SaudÃƒÂ­ e IrÃƒÂ¡n, agravando todavÃƒÂ­a mÃƒÂ¡s la crisis energÃƒÂ©tica y desestabilizando muchos de los paÃƒÂ­ses europeos. Para superar esta compleja situaciÃƒÂ³n, los paÃƒÂ­ses mÃƒÂ¡s poderosos del viejo continente se fusionarÃƒÂ­an en una nueva federaciÃƒÂ³n en 2018, y la antigua alianza con Estados Unidos queda en el olvido, ya que la FederaciÃƒÂ³n Europea y los EEUU se convierten en rivales al compartir los mismos objetivos. Los americanos pretenderÃƒÂ¡n lanzar entonces una nueva estaciÃƒÂ³n espacial en 2020, con una potencia militar muy importante que provoca el rechazo de la FederaciÃƒÂ³n Europea y Rusia, y causando una importante divisiÃƒÂ³n de la OTAN.\n\n\n\nPero el dÃƒÂ­a del lanzamiento, tiene lugar un ataque terrorista a la zona de lanzamiento. La investigaciÃƒÂ³n de este ataque supondrÃƒÂ¡ el enfrentamiento a escala global entre las tres facciones diferentes. Una compleja intriga militar que se irÃƒÂ¡ desarrollando entre las misiones, con importantes explicaciones de cÃƒÂ³mo estÃƒÂ¡ evolucionando la situaciÃƒÂ³n y contÃƒÂ¡ndonos al detalle los pormenores de nuestra motivaciÃƒÂ³n justo antes de saltar al campo de batalla.","torrent":{"xt":"urn:btih:cc14dba151d59f28dede9c6724b75e4677ceea1a","amp;dn":"Tom+Clancys+EndWar+PC-DVD+Spanish+EN+GE+FR+IT","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cc14dba151d59f28dede9c6724b75e4677ceea1a","infoHashBuffer":{"type":"Buffer","data":[204,20,219,161,81,213,159,40,222,222,156,103,36,183,94,70,119,206,234,26]},"announce":[],"urlList":[]}}