{"title":"El Chacotero Sentimental","uid":5965327,"size":733036544,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:cca0cfd66fa1e962ced42ab4f21e4c867198f227&amp;dn=El+Chacotero+Sentimental&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":3,"uploader":"xitao_victor","files":1,"time":1290097608,"description":"Trama\n\nLa pelÃƒÂ­cula se basa en el programa radial El chacotero sentimental. La trama recorre un dÃƒÂ­a cualquiera de la emisiÃƒÂ³n de dicho programa, donde el Rumpy (Roberto ArtiagoitÃƒÂ­a), su locutor, recibe tres llamados telefÃƒÂ³nicos, en los cuales dos hombres y una mujer cuentan sus historias, pasando por risas y llanto, pero siempre recibiendo los sabios consejos del Rumpy, mÃƒÂ¡s conocido como &quot;el chacotero sentimental&quot; en persona, y una canciÃƒÂ³n para amenizar la situaciÃƒÂ³n, la cual siempre es presentada por la popular frase: &quot;te vamo' a ponerte un tema&quot;. Dichas historias componen la trama de la pelÃƒÂ­cula, siendo la primera y la tercera de corte comedia, y la segunda mÃƒÂ¡s bien dramÃƒÂ¡tica.\n\n\n***************   Primera historia\n\nLa primera historia se llama Patas negras (comedia). Trata de un joven sureÃƒÂ±o (Daniel MuÃƒÂ±oz) estudiante de publicidad, que por estos motivos vive solo en Santiago. En el barrio donde reside la gente es muy afectuosa, sobre todo la vecina de al frente, una joven divertida y sensual (Lorene Prieto), pero que estÃƒÂ¡ casada. Esto no es impedimento para que ambos mantengan en secreto una fogosa relaciÃƒÂ³n (de ahÃƒÂ­ el nombre de la historia). Todo se complica cuando este joven viaja al sur a una reuniÃƒÂ³n familiar. Con pocas ganas sigue las ÃƒÂ³rdenes de su padre quien lo manda al terminal del buses a buscar a su tÃƒÂ­a Lastenia, que viene de visita junto a su hijo y la esposa de ÃƒÂ©ste. La verdadera situaciÃƒÂ³n de comedia se produce cuando confirma que las coincidencias existen, y descubre que quien fuera su amante en la capital, era a la vez la esposa de su primo, situaciÃƒÂ³n que a ella parecÃƒÂ­a no importarle y al contrario parecÃƒÂ­a disfrutar. Todo el enredo es descubierto por &quot;el pulga&quot;, hermano chico del estudiante de publicidad, quien con su picardÃƒÂ­a de niÃƒÂ±o, revela el amorÃƒÂ­a oculto en el almuerzo donde estaba toda la familia reunida. Ya sea por incrÃƒÂ©dulos o por &quot;hacerse los tontos&quot;, la ÃƒÂºnica reacciÃƒÂ³n que tuvo la noticia entregada por el pulga, fue la carcajada de todos y cada uno de los integrantes de la familia, incluyendo los involucrados. Al final, el joven estudiante de publicidad, termina diciendo que la esposa de su primo termino embarazada y que ahora le tiene que decir al primo que el hijo es de el.\n\n\n***************   Segunda historia\n\nLa segunda historia se llama Secretos (drama). Esta es la historia mÃƒÂ¡s impactante de la pelÃƒÂ­cula. Cuenta la vida de una familia de clase media (madre, padre y dos hijas), muy tÃƒÂ­pica con un anterior buen pasar, en la que se nota un ambiente oscuro, un pasado con secretos, el que implica mucho resentimiento y dolor guardado por parte de la hija menor (Ximena Rivas), quien es la que llama al Rumpy para contarle su historia. Ella es estudiante de arquitectura, y el conflicto detona a partir de las constantes &quot;maldades&quot; que hacen sus dos pequeÃƒÂ±os sobrinos. Su madre (Patricia Rivadeneira) nunca les dice nada ni castiga, como si sintiera algÃƒÂºn tipo de culpa por haber sido madre soltera. En la actualidad estas dos hermanas sÃƒÂ³lo viven con su padre (Mateo Iribarren), ya que su madre (Claudia CeledÃƒÂ³n) se suicidÃƒÂ³ cuando ellas todavÃƒÂ­a no salÃƒÂ­an de su adolescencia. Todo la historia se desarrolla haciendo un paralelo entre acontecimientos actuales y del pasado. De ÃƒÂ©stos ÃƒÂºltimos se extraen las explicaciones necesarias para entender el presente de esta familia.\n\nFinalmente la hija menor descrubre la incestuosa relaciÃƒÂ³n que habÃƒÂ­a entre su hermana mayor y su padre, de la cual nacieron sus dos sobrinos. TambiÃƒÂ©n las escenas cuentan cÃƒÂ³mo la madre de estas dos niÃƒÂ±as se quita la vida al enterarse del segundo embarazo de su hija mayor, ya que a travÃƒÂ©s de ÃƒÂ©ste descrubre la relaciÃƒÂ³n amorosa que existÃƒÂ­a entre su hija mayor y su esposo, y no pudo soportar la vergÃƒÂ¼enza y el asco. El llamado telefÃƒÂ³nico de la hija menor, que siempre fue testigo pasivo de lo que ocurrÃƒÂ­a en su familia (ya que se escondÃƒÂ­a en un armario por donde vigilaba a travÃƒÂ©s de un agujero pequeÃƒÂ±o, pero esto es mÃƒÂ¡s bien un cachÃƒÂ© cinematogrÃƒÂ¡fico), termina sÃƒÂºbitamente luego de un desesperado llanto, dejando un final abierto para esta historia.\n\n\n***************   Tercera historia\n\nLa tercera y ÃƒÂºltima historia se llama Todo es cancha (tragicomedia). Trata de un matrimonio joven (Tamara Acosta y Pablo Macaya) con tres hijos, que tiene problemas econÃƒÂ³micos y debido a eso deben vivir de allegados en el hogar de sus padres, el cual es un estrecho departamento ubicado en una poblaciÃƒÂ³n marginal. Comienzan a tener problemas sexuales ya que les es imposible mantener una relaciÃƒÂ³n placentera y normal en el tipo de condiciones &quot;inmobiliarias&quot; que se encuentran. La bÃƒÂºsqueda de una soluciÃƒÂ³n para estos problemas genera una serie de situaciones tragicÃƒÂ³micas, como por ejemplo tratar de tener relaciones sexuales en la playa o en un auto, donde finalmente terminan. El nombre de esta historia hace alusiÃƒÂ³n a que finalmente cualquier lugar es bueno para &quot;esas&quot; actividades, siempre y cuando se tengan las ganas (y que ojalÃƒÂ¡ sea verano, para no morir de frÃƒÂ­o depende del lugar que se elija).","torrent":{"xt":"urn:btih:cca0cfd66fa1e962ced42ab4f21e4c867198f227","amp;dn":"El+Chacotero+Sentimental","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cca0cfd66fa1e962ced42ab4f21e4c867198f227","infoHashBuffer":{"type":"Buffer","data":[204,160,207,214,111,161,233,98,206,212,42,180,242,30,76,134,113,152,242,39]},"announce":[],"urlList":[]}}