{"title":"Miles Davis-Jack Johnson Sessions D5~5-2003 [EAC - FLAC](oan)","uid":4804624,"size":501597223,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:ceb4936d47dc8e75235a7794888632f0353ba07a&amp;dn=Miles+Davis-Jack+Johnson+Sessions+D5%7E5-2003+%5BEAC+-+FLAC%5D%28oan%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"oneanight","files":-1,"time":1238159745,"description":"Miles Davis - Complete Jack Johnson Sessions D5~5-2003 [EAC - FLAC] (oan)\n\nBy Rod Sibley\n\nThe Complete Jack Johnson Sessions, Columbia's latest\naddition to the Miles Davis reissue series, documents the period\nfrom January 27, 1970 to June 4, 1970 and contains unedited\ntakes from the sessions plus previously unreleased material.\n\nA bit of background: Jack Johnson was the world heavyweight\nboxing champion from 1908-1915. Miles felt an affinity toward\nJohnson; not only because Miles himself boxed, but because of\nthe racial issues of being a Black man in America both men\nfaced. Director William Clayton made a documentary movie\nabout Johnson's life. A Tribute To Jack Johnson is the\nsoundtrack to the film. The album was released in the summer\nof 1971.\n\nA Tribute To Jack Johnson was a continuation of Miles' musical\ndirection away from more traditional jazz forms. The densely\nlayered music of Bitches Brew, recorded in August of 1969, was\nstripped down and became funkier and more groove oriented.\nThe music also incorporated more elements of rock with the\nguitar work of John McLaughlin. For listeners whose only Miles\nDavis recording is Kind Of Blue and want to hear some &quot;electric\nMiles,&quot; The Complete Jack Johnson Sessions may be the\nstarting point to work your way backward, as well as forward,\nthrough the Miles Davis catalog\n\nDisc Five: June 1970 and original release\n\nChick Corea and Dave Holland had been playing some free\nmusic onstage in Miles' band. They left Miles at the end of\nAugust to form the free music group Circle with drummer Barry\nAltschul. The two versions of &quot;The Mask&quot; which start off Disc\nFive serve as a sample of their influence. The first version\nsounds like free music on steroids. There is some ferocious\nplaying happening on this track, everyone seemingly soloing at\nthe same time. You wish that there were more takes of this\npiece, although it did become part of the band's live set. This is\nThe Shit!!\n\nThe second version of &quot;The Mask&quot; is entirely different. Holland\nwalks a bass line to an insistent mid-tempo DeJohnette rimshot/\nhigh hat pattern throughout the piece. The other musicians\ncreate a layer of sonic effects from the combinations of wahwah,\nechoplexes, organ, etc. Miles and Grossman take solos\nover the sounds, the others follow in turn. Although the vamp is\nrepetitive (and a bit long), it is never boring.\n\nThe last two tracks are the final versions of &quot;Right Off&quot; and\n&quot;Yesternow&quot; from A Tribute To Jack Johnson. The box set's\nremastering sounds great. Hiss is at a minimum. The sound is\nmore alive and open. The recording has more detail and the\ndisc playback is louder than the Sony Legacy reissue.\n\nTeo's editing of these tracks almost shares co-billing with the\nmusic itself. For &quot;Right Off,&quot; there is a section of an\nunaccompanied Miles solo recorded in November '69 that is\nused once on this track and twice in &quot;Yesternow.&quot; &quot;Yesternow&quot;\nalso includes edits of various &quot;Willie Nelson&quot; takes from the first\ndisc, together with an excerpt of &quot;Shhh/Peaceful&quot; (from In A\nSilent Way ). Not only did Teo edit together different takes of\nmusic, he edited together entirely different band personnel. The\nbox set comes with documentation that lists session dates and\npersonnel, session takes that were edited together, and the\ntiming where those edits occur.\n\nThe last section of &quot;Yesternow&quot; is an edit of an orchestral piece\ncalled &quot;The Man Nobody Saw&quot; and features a narration by actor\nBrock Peters playing Jack Johnson: &quot;...I'm Black. They never let\nme forget it. I'm Black alright. I'll never let them forget it.&quot; And\nneither did Miles.\n\nPERSONNEL\n\nMiles Davis - Trumpet; John McLaughlin, Sonny Sharrock -\nGuitar; Michael Henderson, Dave Holland, Ron Carter, Gene\nPerla - Bass; Billy Cobham, Jack DeJohnette - Drums; Chick\nCorea, Keith Jarrett, Herbie Hancock - Keyboards; Steve\nGrossman, Wayne Shorter - Saxophone; Bennie Maupin - Bass\nClarinet; Airto- Percussion; Hermeto Pascoal - Vocals\n\n\n\n1. (07:49) - The Mask (Part One)\n2. (15:48) - The Mask (Part Two)\n3. (26:54) - Right Off\n4. (25:35) - Yesternow\n\n\nPlaying Time.........: 01:16:05\nTotal Size...........: 474.70 MB\n\n\nAll tracks accurately ripped\n\nNo errors occurred\n\nEnd of status report\n &lt;a href=&quot;\nhttp://www.discogs.com/Miles-Davis-The-Complete-Jack-Johnson-Sessions/release/490807&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.discogs.com/Miles-Davis-The-Complete-Jack-Johnson-Sessions/release/490807&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:ceb4936d47dc8e75235a7794888632f0353ba07a","amp;dn":"Miles+Davis-Jack+Johnson+Sessions+D5%7E5-2003+%5BEAC+-+FLAC%5D%28oan%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ceb4936d47dc8e75235a7794888632f0353ba07a","infoHashBuffer":{"type":"Buffer","data":[206,180,147,109,71,220,142,117,35,90,119,148,136,134,50,240,53,59,160,122]},"announce":[],"urlList":[]}}