{"title":"Major.League.Baseball","uid":4760848,"size":6988503680,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:d11a7857f2944a2caa282c995e31a1e691418560&amp;dn=Major.League.Baseball&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"ESPACONSOLAS","files":74,"time":1236693450,"description":"Major.League.Baseball Major League Baseball 2K9 / 2K Sport RELEASE DATE : 06-03-2009 PROTECTION : Steam GAME TYPE : Baseball DISKS : 1 DVD Release Notes: Get ready to step up to the plate for exciting, authentic MLB-style action. Major League Baseball 2K9 delivers the nitty-gritty details you crave for a true at-bat experience. Watch as players appear to come to life before you on screen, and become immersed in the total major league experience thanks to new commentary and presentation that help to put you in the middle of the action. Major League Baseball 2K9 combines an array of exciting features to make you feel like a real pro. The world of Major League Baseball comes alive before you with more than 300 new player-specific signature animations that bring players fully to life on the field and Inside Edge 2009, which ensures that players react realistically to in-game situations. Show off your management skills in an enhanced Franchise mode that features a new level of customization, multiplayer functionality and real player ambitions. Then watch the in-game broadcast unfold in real-time with the all-new Virtual Director, featuring smart camera placement, angles and cuts. Take charge of a franchise in the compelling Franchise mode, which boasts an all-new MLB.com presentation style, a new level of CPU customization, multiplayer functionality and real player ambitions See players come to life at the plate, on the mound and in the field with more than 300 new Signature Style animations Watch as players in the game react to situations like they would in real life, courtesy of Inside Edge 2009, which incorporates more than six years of scouting reports See in-game broadcasts come to life on your screen just like they would in a real game with commentary from Gary Thorne and Steve Phillips View in-game broadcasts in a new way with the all-new Virtual Director that delivers smart camera placement, angles and cuts, as well as with depth analysis with K-Cam, pitch and hit tracker Show off your talents to the beat of a rocking soundtrack featuring Judas Priest, Cheap Trick, Coheed &amp; Cambria, Ted Nugent, SR-71, the Romantics, Boys Like Girls and Europe Install Notes: 1. Unpack release 2. Mount image or burn it 3. Install game 4. Play the game Remember to check our cool cracktro first\nMajor.League.Baseball\n\n\ndo you want more games &amp; cine-online in good-quality???\n\nwww espaconsolas com &amp; www espaendirecto com\n\nThanks!!","torrent":{"xt":"urn:btih:d11a7857f2944a2caa282c995e31a1e691418560","amp;dn":"Major.League.Baseball","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d11a7857f2944a2caa282c995e31a1e691418560","infoHashBuffer":{"type":"Buffer","data":[209,26,120,87,242,148,74,44,170,40,44,153,94,49,161,230,145,65,133,96]},"announce":[],"urlList":[]}}