{"title":"Fringe Season 1 - MP4 176x144 E1-E8","uid":4518675,"size":432455656,"categoryP":"video","categoryS":"handheld","magnet":"?xt=urn:btih:d2278c430798375808af484ff9134c4bb9571359&amp;dn=Fringe+Season+1+-+MP4+176x144+E1-E8&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"ASSEENONTV","files":10,"time":1227075526,"description":"AVI to MP4 Conversion by AsSeenOnTV\nUploaded by AsSeenOnTV.\n\nNew Episodes and NFO/SVD files will be updated Weekly when the next episode is aired.\n\nThese files are best viewed on Video based cell phones that can only use 176x144 (with extended memory).\nEach Season is designed for cell phone quality and to fit on 1 GB micro SDs so enjoy!\nIf you require other cell/PDA video sizes or higher quality then please leave a comment on the latest version of this torrent on isohunt.com or thepiratebay\n\n\nVideo Info\n----------\nVideo Size 176x144\nCodec: MPEG4\nFrame Rate 15\nBitrate 96 Kbps\n\n\nAudio Info\n----------\nCodec AAC\nMono\nSample Rate 48000\nBitrate 32 Kbps\n\n\nLink:\n----- &lt;a href=&quot;\nhttp://www.imdb.com/title/tt1119644/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt1119644/&lt;/a&gt;\n\n\nFiles:\n------\nFringe.S01E01.mp4\nTitle: Pilot\nPlot: When a commercial flight from Germany lands at Boston&amp;#039;s Logan Airport without a single passenger or crew member on board alive, FBI agent Olivia Dunham is assigned to the investigative team. When her partner and lover John Scott suffers severe chemical burns, she seeks help from Dr. Walter Bishop a one-time university professor who experimented in the same field but has now been institutionalized for 17 years. To get his cooperation however, she has to get Bishop&amp;#039;s son Peter&amp;#039;s cooperation as well. The information they gather leads to Massive Dynamics a huge multinational founded by someone who once shared laboratory space with Dr. Bishop. Agent Dunham also learns that what happened may have been part of a much larger pattern of strange phenomena.\nFile Size: 81.7 MB\n\nFringe.S01E02.mp4\nTitle: The Same Old Story\nPlot: A woman gives birth to a baby which ages 80 years in just a few minutes and Olivia soon finds connection between the incident and a serial killer she had been chasing.\nFile Size: 50.6 MB\n\nFringe.S01E03.mp4\nTitle: The Ghost Network\nPlot: Following a strange apparent terrorist attack on a bus, Olivia, Peter and Walter find a man who foresees future disasters before they happen.\nFile Size: 41.8 MB\n\nFringe.S01E04.mp4\nTitle: The Arrival\nPlot: Agent Dunham and the Bishops investigate the sudden appearance of a strange cylinder after an explosion at a construction site. She learns from an old friend that this is not the first time the cylinder has appeared and that it could disappear just as quickly. She also realizes that an odd looking man appears in several crime scene photos. It turns out that he is already known to the Government and has been dubbed &amp;#039;The Observer&amp;#039;. Dr. Bishop has a special interest in the cylinder and tells Peter of their own special encounter with &amp;#039;The Observer&amp;#039; years ago.\nFile Size: 49.4 MB\n\nFringe.S01E05.mp4\nTitle: Power Hungry\nPlot: The team investigate the case of a man who can generate electrical phenomena... and is at the center of a series of strange deaths involving electronic devices.\nFile Size: 48.5 MB\n\nFringe.S01E06.mp4\nTitle: The Cure\nPlot: Agent Dunham and the Bishops investigate the deaths of a group of people who died from radiation poisoning in a diner. They believe the source of the radiation was Emily Kramer, a young woman who had vanished two weeks previously and was probably being held against her will. When another young woman, Claire Williams, disappears the investigators believe someone may be conducting experiments. Dr. Bishop believes the emanations from Kramer were microwaves and she may in fact have been developed as a walking weapon. They trace the research to the head of a pharmaceutical firm David Esterbrook, who has a history of promoting off the wall ideas. Nina Sharp has information and strikes a bargain with Peter Bishop.\nFile Size: 49.9 MB\n\nFringe.S01E07.mp4\nTitle: In Which We Meet Mr. Jones\nPlot: A parasite mysteriously latches onto a dying FBI agent&amp;#039;s internal organs. Agent Dunham rushes to Germany to meet a prisoner for information about the threat they face.\nFile Size: 45.4 MB\n\nFringe.S01E08.mp4\nTitle: The Equation\nPlot: Walter&amp;#039;s former bunkmate at the mental institute is linked to the abduction of a young musical prodigy by a serial kidnapper. Peter is concerned when Walter insists on going back to the mental institute to solve the case. \nFile Size: 44.7 MB\n","torrent":{"xt":"urn:btih:d2278c430798375808af484ff9134c4bb9571359","amp;dn":"Fringe+Season+1+-+MP4+176x144+E1-E8","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d2278c430798375808af484ff9134c4bb9571359","infoHashBuffer":{"type":"Buffer","data":[210,39,140,67,7,152,55,88,8,175,72,79,249,19,76,75,185,87,19,89]},"announce":[],"urlList":[]}}