{"title":"Michelle Malkin - Culture of Corruption","uid":9307922,"size":527188000,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:d29887d6df161b2f25844d0ab49020cfb87f19e8&amp;dn=Michelle+Malkin+-+Culture+of+Corruption&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Hiecpo","files":-1,"time":1386350222,"description":"Michelle Malkin - Culture of Corruption: Obama and His Team of Tax Cheats, Crooks, and Cronies\n\n(2009) 173 files, 502.7MB, 128kbps, 8:49:53\n\nUnabridged, Read by Johnny Heller\n\nThe era of hope and change is dead....and it only took six months in office to kill it.\n\nNever has an administration taken office with more inflated expectations of turning Washington around. Never have a media-anointed American Idol and his entourage fallen so fast and hard. In her latest investigative tour de force, New York Times bestselling author Michelle Malkin delivers a powerful, damning, and comprehensive indictment of the culture of corruption that surrounds Team Obama's brazen tax evaders, Wall Street cronies, petty crooks, slum lords, and business-as-usual influence peddlers. In Culture of Corruption, Malkin reveals:\n\n* Why nepotism beneficiaries First Lady Michelle Obama and Vice President Joe Biden are Team Obama's biggest liberal hypocrites--bashing the corporate world and influence-peddling industries from which they and their relatives have benefited mightily\n\n* What secrets the ethics-deficient members of Obama's cabinet--including Hillary Clinton--are trying to hide\n\n* Why the Obama White House has more power-hungry, unaccountable &quot;czars&quot; than any other administration\n\n* How Team Obama's first one hundred days of appointments became a litany of embarrassments as would-be appointee after would-be appointee was exposed as a tax cheat or had to withdraw for other reasons\n\n* How Obama's old ACORN and union cronies have squandered millions of taxpayer dollars and dues money to enrich themselves and expand their power\n\n* How Obama's Wall Street money men and corporate lobbyists are ruining the economy and helping their friends In Culture of Corruption, Michelle Malkin lays bare the Obama administration's seamy underside that the liberal media would rather keep hidden. \n\n&quot;Culture of Corruption, by my good friend and intrepid reporter Michelle Malkin, reveals all the sordid details the Obama Administration would rather you not know--the sleaze, corruption, and self-dealing of the Chicago Machine that lets no `crisis' go to waste. A powerful and necessary indictment of what `hope and change' really means.&quot;\nMark Levin, author of Liberty and Tyranny and Men in Black\n\n&quot;Dogged, fiercely independent, and with a brilliant eye for the telling detail, Michelle Malkin has now turned her formidable skills to the bright new dawn of the Obama era, and the ever widening gulf between the hopey-changey rhetoric and the murkier reality. Her riveting portrait of unsavory cronies parceling out the spoils of government is somewhat at odds with the impression you may have gained from the besotted Tiger Beat correspondents of the mainstream media. I will leave it to the reader to decide which view is more persuasive, but let's just say that, if more journalists were like Michelle Malkin, American newspapers might still have a future.&quot;\nMark Steyn, author of America Alone\n","torrent":{"xt":"urn:btih:d29887d6df161b2f25844d0ab49020cfb87f19e8","amp;dn":"Michelle+Malkin+-+Culture+of+Corruption","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d29887d6df161b2f25844d0ab49020cfb87f19e8","infoHashBuffer":{"type":"Buffer","data":[210,152,135,214,223,22,27,47,37,132,77,10,180,144,32,207,184,127,25,232]},"announce":[],"urlList":[]}}