{"title":"PeaZip 2.6.3 (GTK2) RPM Package","uid":5008657,"size":7573597,"categoryP":"applications","categoryS":"unix","magnet":"?xt=urn:btih:d53dd3509652cad8abe614f55202f394654393f5&amp;dn=PeaZip+2.6.3+%28GTK2%29+RPM+Package&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"olofolleola4","files":-1,"time":1247870221,"description":"Copied from PeaZip Homepage:\n\n\nOpen source file and archive manager\nFlexibe, portable, secure, and free as in freedom\n\n\nWhy PeaZip\n\n\nFlexibility\n\nPeaZip can extract most of archive formats both from Windows and Unix worlds: currently 90 file extensions are supported ranging from mainstream 7Z, RAR, TAR and ZIP to experimental ones like PAQ/LPAQ family, currently the most powerful compressor available.\nFor archive creation, PeaZip suppors a wide range of compression and encryption standard, from fastes to most powerful ones, and allows to export job definition as scripts to bridge the gap between GUI and console applications, and let the user pick the best of the two worlds.\n\nPeaZip is a reliable solution for most of the archive types you may met,\nand will help you in finding the right tool for a wide range of specific needs\n\n\nPortability\n\nYou can use PeaZip on all Windows version and on Linux (PeaZip is a desktop neutral application) with the same features and look and feel; moreover, for both platforms, PeaZip is also available as standalone, portable application not needing installation.\n\nYou can bring PeaZip with you and rely on it on multiple platforms\n\n\nSecurity\n\nPeaZip has secure deletion feature, can verify file checksum and hash, and supports multiple strong encryption standards, optionally using two factor authentication (password and keyfile) for increased security:\n\n7Z's AES256 encryption\n\nZIP WinZip's AE encryption based on AES256 (and ZipCrypto for legacy compatibility); can decrypt PKZip's AES encryption\n\nFreeARC's ARC: AES256, Blowfish, Twofish256 and Serpent256 - this format is also capable to generate recovery records to protect data against corruption\n\nPEA: AES256 EAX authenticated encryption\n\n\nPeaZip is focused on security and supports multiple encryption standards\n\n\nFree as in freedom\n\nPeaZip is freeware, free of charge for any use, and is also free as in freedom since it's Open Source (LGPLv3)\n\nPeaZip contains exclusively Open Source components released under OSI approved licenses\n\n\nMain features\n\nPeaZip is an open source file and archive manager: cross platform, available as portable and installable software for 32 and 64 bit Windows (9x, 2k, XP, Vista) and Linux (PeaZip is a desktop neutral application).\n\n* Full support (read and write)\n\n7Z\n7Z-sfx\nARC/WRC\nBZ2/TBZ2\ncustom\nGZ/TGZ\nPAQ/LPAQ\nPEA\nQUAD/BALZ\nsplit\nTAR\nUPX\nZIP\n\n\n* Read only (browse, extract, test)\n\nACE\nARJ\nCAB\nCHM\nCOMPOUND (MSI, DOC, XLS, PPT)\nCPIO\nISO\nJava (JAR, EAR, WAR)\nLinux (DEB, PET/PUP, RPM, SLP)\nLHA/LZH\nLZMA\nMac (DMG/HFS)\nNSIS\nOpen Office files\nPAK/PK3/PK4\nRAR\nSMZIP\nU3P\nUDF\nVHD\nWIM\nXAR\nXPI\nXZ\nZ/TZ\n\n\n* Repair\n\nARC\n\n\nPeaZip allows to apply powerful multiple search filters to archive's content; create and extract multiple archives at once; create self-extracting archives; export job definition as command line; save archive's layouts; bookmark archives and folders; scan and open with custom applications compressed and uncompressed files etc...\n\nOther features: strong encryption, robust file copy, split/join files (file span), secure data deletion, compare, checksum and hash files, system benchmark, generate random passwords and keyfiles.\n\n\nLocalizations\nCzech, Dutch, English, French, Galitian, German, Hungarian, Italian, Polish, Portuguese, Russian, Simplified Chinese, Sinhala, Spanish, Swedish, Ukrainian.\n\n\nPeaZip installable\n\nPeaZip installable, either for Windows and Linux, needs to run with administrative privileges.\nThe program can be installed once from administrative account and then any user running it will have their own private configuration and bookmark files saved on the user's profile home (Linux) or application data (Windows) folder.\nPeaZip's most used functions are reachable from SendTo and context menu (Windows), and from service menus (Linux, KDE) and Nautilus scripts (Linux, Gnome).\nOn Windows systems it may be useful to keep the installation package, since it can be used to change program's system integration: file association, context menu and SendTo menu entries. You don't need to uninstall the program if you are re-running the setup of the same version.\n\n\nPeaZip for Linux\n\nPeaZip is desktop-neutral so it can be used either under Gnome, KDE or other desktop managers. System integration mechanisms relies on FreeDesktop standards and requires a compliant environment, such Gnome and KDE, but basic archiving operations works on any environment.\n\n\nYou can freely replace backend executables in PeaZip/res directory (any PeaZip release/package) with 64 bit counterpart, if available; please note that on Linux 64 bit systems you will need ia32-libs, as long as you need to run a 32 bit executable.\n\n\n\nChangelog:\n\n\n2009 07 14\n\n2.6.3\n\no Added support for MS Office Template file types\n(a total of 90 file extensions are now supported)\n\n\no PeaLauncher:\n\n+ Fixed bug in exploring paths containing spaces\n\n+ Fixed bug in exploring paths in full mode (when PeaLauncher is used as standalone application)\n\n+ Standardized ok and cancel buttons' position and icons\n\n\no Pea:\n\n+ Fixed bug refusing chunck size bigger than maxint from command line\n\n+ Fixed possible looping of application after internal_error procedure\n\n\n2009 06 12\n\n2.6.2 [Update recommended]\n\no p7zip backend updated to 9.04 (Linux)\n\n+ Added LZMA2 compression in 7z format\n\n+ Read .XZ files\n\n+ Read .VHD files (Microsoft Virtual PC disk images)\n\n\no Tightened sanitization of input strings in PeaZip GUI, as security fix against a class of possible attacks based on code injection (ref: http://secunia.com/advisories/35352/ http://milw0rm.com/exploits/8881 original submission:To attack previos releases an attacker could build archives containing objects with nonvalid filenames, containing concatenated commands in the filename &quot;hidden&quot; to the user by making the filename very long with spaces to trick users in non reading the latter part of the name. If unaware users had downloaded such archive and doubleclicked or otherwise opened the archived file entry containing the concatenated command, would have put in execution the command (with current user rights). Fixes:\n\n+ Check file/dir names for:\n\n# Non-allowed characters (0..31)\n# Reserved characters\n# Reserved file names\n# Unusual spacing (5 consecutive or more, like in 7-Zip GUI), as may be intended to trick user hiding real filename\n\n+ Check command string immediately before execution for:\n\n# Non-allowed characters\n# Reserved characters for command concatenation (|), not used by PeaZip GUI\n# Unusual spacing\n\n\n2009 06 05\n\n2.6.1\n\no 87 file extensions supported\n\n\no It is now possible to define a custom desktop folder in Settings\n\n+ (Linux) This change fixed possible access violation message at the first run of the application, while the application attempts to open a system dialog to set desktop folder (only on non-English installations, on distributions not using &quot;Desktop&quot; name for desktop folder)\n\n\no Removed deletion functions from archive layout interface, del remapped to remove item from layout\n\n\no Various fixes\n\n+ Fixed a bug in dragging items to bookmarks (bookmarks bar was raised even if it was hidden)\n\n+ Now size of multipart archive is reported correctly in PeaLauncher\n\n+ Fixed password input using extract here from context menu","torrent":{"xt":"urn:btih:d53dd3509652cad8abe614f55202f394654393f5","amp;dn":"PeaZip+2.6.3+%28GTK2%29+RPM+Package","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d53dd3509652cad8abe614f55202f394654393f5","infoHashBuffer":{"type":"Buffer","data":[213,61,211,80,150,82,202,216,171,230,20,245,82,2,243,148,101,67,147,245]},"announce":[],"urlList":[]}}