{"title":"The Ultimate Christmas Present!! (Truth DVD Collection)","uid":3575057,"size":17480278016,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:d5df6669a2766bf35f18851485ed4ad21157752e&amp;dn=The+Ultimate+Christmas+Present%21%21+%28Truth+DVD+Collection%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"Osaka","files":22,"time":1165867219,"description":"!!!! PLEASE HELP SEED THIS !!!!\n-------------------------------\n\nThis contains 4 of the best films ever made about 9/11, Government-sponsored Terrorism, the set up of a police state in America, and how the government uses fear to control the population.\n\nIts in DVD format, simply burn with NERO (reccomended) or your favorite burning software. The DVDs are NTSC (works on all normal American DVD player).\n\nThe films are:\n\n9/11: The Road to Tyranny (2002)\nMartial Law 9/11: Rise of the Police State (2005)\nLoose Change: 2nd Edition (2006)\nTerrorstorm: A History of Government Sponsored Terrorism (2006)\n---------------------------------------------------------------\n\nInfo about the films follows below:\n-----------------------------------\n\n9/11: The Road to Tyranny exposes how:\n----------------------------------------\n\n* Dozens of FBI and Defense Intelligence Agents were threatened with arrest by the Federal Government if they got in the way of Al-Qaeda operations.\n\n* How the CIA trained, funded and protected Bin Laden.\n\n* That impeachment lawyer David Schippers watrned congress and the justice department of the impending terrorist attacks. (The film includes an exclusive interview with Schippers on the Alex Jones Show just 2 weeks after the attacks. Schippers has since been threatened with arrest if he continues to speak out, and is begging the media and the American People to get this story out)\n\n* How the bloodthirsty globalists are using the terrorist attacks to scare the population into accepting high-tech slavery and a New World Order Police State.\n\n* How the recently declassified top-secret Northwoods Document written by the Joint Chiefs of Staff laid out the plans to bomb Washington and to hijack airplanes as a pretext for war.\n\n* Bill Clintons involvement in the Oklahoma City Bombing and how it was carried out by intelligence agencies to be blamed on the right-wing.\n\n* How the FBI ordered their informants to cook the bomb and train the drivers in the first World Trade Center attack in 1993.\n\n* Why the USA PATRIOT ACT is unconstitutional and un-American.\n\n* Why the government leaves our borders wide-open but tells us to give up our liberties for security and that more terrorist attacks are imminent.\n\n* FBI training manuals that are being given to police departments that state that christians, gun owners, and *Those who make frequent references to the US Constitution* are terrorists.\n\n* The unfolding cashless society biometric control-grid.\n\n* And much, much more...\n------------------------\n\nThe extremely powerful film:\n\nMartial Law 9/11: Rise of the Police State documents...\n---------------------------------------------------------\n\n&gt;&gt; What the modern day police state looks like as thousands of peaceful protesters are forcibly detained at a Guantanamo style detention camp called Pier 57 during the 2004 Republican National Convention.\n\n&gt;&gt; How multitudes of New Yorkers and others are fully aware of the fact that 9/11 was an inside job and are now actively exposing the people behind it.\n\n&gt;&gt; Why the collapse of Building 7 is potentially the biggest smoking gun indicating government involvement in 9/11. Alex returns to the scene of the crime to physically dissect why the official story can be nothing else but a fraud.\n\n&gt;&gt; How many of the RNC protesters are actually aiding what they claim to oppose by being deluded into thinking that a re-energization of the left will successfully counteract the Neo-Cons. Communists and socialists are confronted with the truth about the false left-right paradigm and their response only betrays their ignorance.\n\n&gt;&gt; The awful truth about Michael Moore, a man with basic honest intentions but also a man who has been carefully shepherded by the culture creators to pose as the orthodoxy milquetoast of the true story behind 9/11. How Moore stood at the front of the protest for his photo-op and then spent the rest of his time eating tacos.\n\n&gt;&gt; The occult and satanic underpinnings of the ruling elite families and how their oath to secret societies and each other makes a mockery of their counterfeit pseudo-loyalty to America and what it is supposed to stand for.\n\n&gt;&gt; Arnold Schwarzeneggers alarming and sordid past and why his intentions should unnerve us all in light of his fated future presidential run. A womanizing, egotistic, power-mad, imperious Nazi whose ideals are diametrically opposed to those represented by the founding fathers.\n------------------------------------------\n\nLoose Change 2nd Edition :\n--------------------------\nThe film is dedicated to the families of the victims of 9/11, and debunks the official story fed to the public by the government into pieces... more info can be found at http://loosechange911.com/index.htm\n--------------------------------------------\n\nAbout Terrorstorm :\n-------------------\n\nThroughout history, criminal elements inside governments have carried out terror attacks against their own populations as a pretext to enslave them. TerrorStorm reveals how, in the last hundred years, Western leaders have repeatedly murdered their own citizens while posing as their saviors.\n\nIn TerrorStorm you will discover that September 11th, the attacks of 7/7 in London, and many other terrorist events were self-inflicted wounds. You will witness British Special Forces troops caught in the act of staging terror attacks in Iraq and see official US government documents laying out plans to hijack passenger planes by remote control. You will learn how the Reichstag fire, the Gulf of Tonkin, and the US-backed Iranian coup of 1953 are all interconnected false-flag terror events.\n\nThis powerful documentary explores the mindset of the average brainwashed Westerner. It delves deeply in to the systems of control which have been scientifically-crafted to imprison their minds and keep their eyes closed to the realities of the world around them.\n-----------------------------------\n\n---\n\n---\n\n---\n\nPLEASE HELP SEED THIS!! I CANT DO IT ALL ON MY OWN!!\n\nIm seeding this for at least 2 weeks, with an average upload speed of 100kb/s.\n\nWill be super-seeding this in the beginning until at least a few people have it.\n\nIf it looks like there are no seeders, or if it says there are zero, DONT WORRY! There is! Its just your client thats fooled by the super-seeding thing.\n\nIf you want to download just 1 or 2 of the movies, or download one at a time, then you can do so with the client ÂµTorrent (there are other clients that support that feature, but ÂµTorrent is the best. The official BitTorrent cleint does not support selecting and downloading individual files).\n\n---\n\n---\n\n---\n\n\n\n\n\n\n\n","torrent":{"xt":"urn:btih:d5df6669a2766bf35f18851485ed4ad21157752e","amp;dn":"The+Ultimate+Christmas+Present%21%21+%28Truth+DVD+Collection%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d5df6669a2766bf35f18851485ed4ad21157752e","infoHashBuffer":{"type":"Buffer","data":[213,223,102,105,162,118,107,243,95,24,133,20,133,237,74,210,17,87,117,46]},"announce":[],"urlList":[]}}