{"title":"cannabisleafs awesome torrent guide 2009","uid":5105680,"size":1675060849,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:d66444a36fd4971cbd591ffccdb39da6ec1f9316&amp;dn=cannabisleafs+awesome+torrent+guide+2009&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"cannabisleaf","files":-1,"time":1254344228,"description":"\nAfter what seemed like forever it is finally here. A brief &quot;how it came to be:&quot; This pack started off as just a utorrent tutorial. I was having some PC issues at the time so it was going rather slow. Then through watching shout i noticed that there is a whole bunch of important torrenting things that were going unknown. Like proper use of winrar, imgburn, mirc, and so on. So i decided to throw a stone and kill a whole bunch of birds. I reinstalled Vista and took YOU the torrenter on the adventurethat is installing and using all necessary app to successfully get your data through torrenting. There are also some of my favorite apps in here lke Sony dvd architect, that i use to make my annual custom home dvd's. I also included cpu speed which is just a very small program that tells you your cpu speed.\nhere are the folders as follow..each folder will have the app 32 bit and 64 bit where necessary and a video tutorial explaining the install and use of the app. you will notice that some are numbered and others are not. its a guideline to follow..you don't have to but i did it in that order so i talk about things in &quot;previous&quot; videos. that's really the only reason..so here they are:\n\n1avg-----antivirus program\n2utorrent---bittorrent client.. main subject\n3magiciso---iso viewing and opening program\n4magicdisc--virtual dvd drive mounting program\n5winrar---program used to open/create .rar files\n6quick sfv--program used to check and verify .sfv files..(related to winrar)\n7imgburn--program used to create .iso(image files) and burn .iso's..a must have\n8uploading to megaups.com---uploading to megaups,from creating to uploaded\n9mirc--irc client, very useful to be a part of torrenting community,includes how to connect to megaups \n\ndisable uac--how to disable user account control in Vista\nk-lite---all the codecs you need to play all video and audio files. has media player classic as well\nnfolux--useful program to view and CREATE nfo's\nspeedtest.net the way to check your internet speeds\n\n\nthen there are the non video assisted apps...\n200 ways to revive a hard drive---havent looked atit but its ways to revive a hdd i guess\nhdd regen---repairs your hdd on the actual disc level..like really repairs it\nhddlife---monitors your hard drive and even has some options for drives\nauslogics disk defrag--very useful to keep hdd running good with lots of downloads...run at least weekly\nauslogics registry cleaner---cleans up the registry\nauslogics system info--- give you important info about your pc\n[color=#008080]Motorola.Phone.Tools.v5.0.5[/color]---app to connect to your Motorola phone to put on ringtones pics and backup contacts\nquicktime 7.5.5 pro----quicktime pro\nSONY DVD Architect 4.0.125----dvd creating program\nFirefox Setup 3.5 RC 2---firefox is super duper awesome!!\nVista_Loader_4.0.rar..in case you have that pesky activate windows popup ;)\n\ni have included my desktop background as a lot of the videos show it.\nepilogue--- this is me, sitting in my backyard next to my weed plant wrapping up this pack. main point being to seed mofo's..\n\nso please seed this..its not too big and you can always look back at the vids to refresh yourselves. help keep this site alive and seed as long as you have the hdd space,and when you run out of that put everything on dvd to reseed. i dont want to hear about accidental deletes..thats not really possible as everything will want to confirm first before you destroy data.\nthanks and i hope this helps you out.","torrent":{"xt":"urn:btih:d66444a36fd4971cbd591ffccdb39da6ec1f9316","amp;dn":"cannabisleafs+awesome+torrent+guide+2009","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d66444a36fd4971cbd591ffccdb39da6ec1f9316","infoHashBuffer":{"type":"Buffer","data":[214,100,68,163,111,212,151,28,189,89,31,252,205,179,157,166,236,31,147,22]},"announce":[],"urlList":[]}}