{"title":"Area 51","uid":4654356,"size":1047469469,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:d6a5986a5550b8c0ee276083a31fbd3a33f71976&amp;dn=Area+51&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Ghetto_Torrents","files":1,"time":1232153163,"description":"                                 Ghetto Torrents\n--------------------------------------------------------------------------------------\n\n                                     Description\nArea 51 is a 2005 first-person shooter video game developed in tandem for the PlayStation 2, Xbox, and PC, and is a loose remake on the 1995 light gun video game of the same name. Players control Ethan Cole, a HazMat operative voiced by David Duchovny sent to the infamous base to investigate some manner of viral outbreak.\n\nArea 51 at first starts out with intense combat where the player has several AI teammates with him (ranging from two to seven most of the time) versus hordes of mutants. Notable among the voice actors are Marilyn Manson (as Edgar the ancient and powerful Grey), Powers Boothe (as Major Bridges), and Ian Abercrombie (as Dr. Cray).\n\n\nGameplay involves combat in a first person view, through the eyes of Ethan Cole. Players may either be required to move to a certain location in order to complete objectives, or at later stages, operate a stationary turret against oncoming enemies. The Player will have a team of Hazmat soldiers through the starting levels and will meet security forces on most of the floors that will not follow the player, but will just hold their position. The player's Hazmat soldiers are in fact invincible and cannot be killed unless the story demands it.\n\n\n\n                          Minimum System Requirements:  \n                256 MB RAM, 64 MB Video RAM, 998 or less MB disk space \n\n\n\n\n\n                                     Instructions:\n\n1) Create a new folder on Desktop called Area 51\n2) Extract to Area 51 with latest Winrar or 7Zip program\n3) Start with Area51.exe\n\n\n\n \n","torrent":{"xt":"urn:btih:d6a5986a5550b8c0ee276083a31fbd3a33f71976","amp;dn":"Area+51","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d6a5986a5550b8c0ee276083a31fbd3a33f71976","infoHashBuffer":{"type":"Buffer","data":[214,165,152,106,85,80,184,192,238,39,96,131,163,31,189,58,51,247,25,118]},"announce":[],"urlList":[]}}