{"title":"Eva Golinger Venezuela U.S. Intervention RAW UNTITLED Kopimi","uid":4992530,"size":2071285658,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:d6dd32cac469bdab79e20b27fac1ebbc742d2d24&amp;dn=Eva+Golinger+Venezuela+U.S.+Intervention+RAW+UNTITLED+Kopimi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"what-we-have","files":1,"time":1247116604,"description":"Eva Golinger - Venezuela and U.S. Intervention, Media Control\n\n\nBOTH versions of this video belong to the Kopimi Gods!!! However, PLEASE, if you are going to share this version of this video, please put titles on it or something so that people know what it is that they are seeing. I am sharing this version mainly for people who want to use it in their own videos.\n\n\n\n*** NOTICE: THE VIDEO IN THIS TORRENT IS RAW, UNTITLED VIDEO!!! ***\n\n\n\nPlease download the nicely titled, identical version of this video here:\n &lt;a href=&quot;\nhttp://thepiratebay.se/torrent/4992660/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/torrent/4992660/&lt;/a&gt;\n\n\nI made that version of this video into a movie with titles, etc. explaining to people what it is they are watching, where it was recorded, etc. I am still sharing the raw, untitled video here so that other people may use it if they don't like my movie version. Both videos contain the same exact video. The only difference between them is the other one has titles and this one is UNTITLED RAW VIDEO! Sorry to be redundant, but I just want to make sure that you know what it is that you are downloading here.\n\n\n\nPlease forgive my horrible description. No amount of writing from me can possibly describe the INCREDIBLY GOOD talk that is presented in this video!!!\n\nJust download it (the other version above) and watch. I guarantee you will not be disappointed!\n\n\n\nThis video was recorded on May 29th, 2009. The contents of this video are VERY related to the coup in Honduras!\n\nPlease see the related information here:\n &lt;a href=&quot;\nhttp://www.democracynow.org/features/honduras_coup&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org/features/honduras_coup&lt;/a&gt;\n\n\n\n\nEva Golinger gives an excellent talk about Venezuela, U.S. Intervention and Media Control.\n\nEva Golinger is a famous author and attorney. To find her books in a local library, search worldcat. Here is a convenient link to find her books:\n &lt;a href=&quot;\nhttp://www.worldcat.org/search?q=au%3AEva+Golinger&amp;qt=hot_author&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.worldcat.org/search?q=au%3AEva+Golinger&amp;qt=hot_author&lt;/a&gt;\n\nI recorded this myself at Evergreen State College in Olympia, Washington, U.S. and made it into a high quality video.\n\nIt is about two hours and 17 minutes of incredibly good material that is definitely not shown on U.S. corporate controlled media!\n\nThis video does a great job at exposing the U.S. propaganda about Venezuela! \n\nThis is definitely must see material, especially if you live within the United States!!!\n\nAfter you see this video, I am sure that you will want to share it with everyone.\n\nThis is why I have released it under &quot;Kopimi&quot; rules. So, PLEASE copy and share as much as you can!\n\n\n\nP.S. to The Pirate Bay Gods...\n\nI dearly hope that you seriously know what you are doing by selling this site.\n\nI pray that it stays the same as it is now.\n\nI hope that the new owners do not attempt to invade the privacy of TPB users by logging their every move the way a lot of other popular sites do.\n\n\nPlease, please, PLEASE don't go away, Pirate Bay!!!!!!!!!!\n\nThe Pirate Bay is truly THE main outpost of Freedom on the Internet! Where else can you find videos such as the one that I just posted here? More importantly, where else can you share really important videos such as the one I posted here without fear of them being removed by someone who does not share your beliefs?\n\n\nLong live The Pirate Bay!!!!!!!!!!  Long live The Pirate Bay!!!!!!!!!!\n\n\n\n\nIf for some reason you cannot get a seed for this torrent, there is a FAST server located here:\n\n66.90.104.17 port 6878\n\n","torrent":{"xt":"urn:btih:d6dd32cac469bdab79e20b27fac1ebbc742d2d24","amp;dn":"Eva+Golinger+Venezuela+U.S.+Intervention+RAW+UNTITLED+Kopimi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d6dd32cac469bdab79e20b27fac1ebbc742d2d24","infoHashBuffer":{"type":"Buffer","data":[214,221,50,202,196,105,189,171,121,226,11,39,250,193,235,188,116,45,45,36]},"announce":[],"urlList":[]}}