{"title":"Sexually Broken--Amazing MILF with Booming body Penny Barber Mat","uid":8740369,"size":1492912887,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:d794da9898ee4828a790a8909b6ef510167e828c&amp;dn=Sexually+Broken--Amazing+MILF+with+Booming+body+Penny+Barber+Mat&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"merzedes","files":-1,"time":1374768447,"description":"Amazing MILF with Booming body, gets her first hardcore bondage threeway! Lactating Nipples! | Penny Barber | Matt Williams\n\nJuly 24, 2013 \n \n\nMP4 only.\n \n \nWe are happy to bring hot local talent to the pages of Sexually Broken. Today we have Penny Barber, a smoking hot MILF with an incredible booming body and lactating nipples.\n\nThe first thing we find out about Penny is that she is a bratty little brat. That mouth of hers writes checks her throat can't cash. After spending just 1 minute with her, you want to grudge fuck her into next week. We get her tied up quickly and since this is &quot;The Meet and Greet&quot; we do all the bondage on screen. No other bondage company in the world brings you more on screen tying then Sexually Broken. \n\nSInce we can't stand her talking anymore, we waste no time jamming hard cock down her throat repeatably and brutally. Penny looks good on her knees struggling to get air as we face fuck our hot Mom into subspace. With a huge ring gag in her HUGE mouth it is easy to fuck the back of her throat, and with her hands trapped behind her back with hard steel metal handcuffs there is nothing she can do but take the Cock.\n\nWe destroy Penny with our skull-fucking methods, she is dazed when we bend her backwards over a table and continue her training as a cock sucking whore. We bind her knees to the table and lock a vibrator on her sensitive clit. Now Penny has to manage two things, cumming and sucking and she fails at both. \n\nWe bring in some HUGE black cock and now it's on. Penny gets fucked from both ends as we make her nipples squirt milk all over her huge tits. Back and forth the boys move never giving Penny a break, she is completely overloaded with cock, orgasms! Over and over she cums from the fucking. In the end our bratty little brat is dazed, deep in subspace, cum drunk and Sexually Broken... \n \nScreens &lt;a href=&quot;\nhttp://www.sexuallybroken.com/sexual/bondage/2013/07_24pbarber/SexuallyBroken-Penny-Barber-Matt-Williams-Amazing-MILF-with-Booming-body-gets-her-first-hardcore-bondage-threeway-Lactating-Nipples.php&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.sexuallybroken.com/sexual/bondage/2013/07_24pbarber/SexuallyBroken-Penny-Barber-Matt-Williams-Amazing-MILF-with-Booming-body-gets-her-first-hardcore-bondage-threeway-Lactating-Nipples.php&lt;/a&gt;\n\n11 000 uploads and counting, 12k here we come :) And as usual, if you still like what Shallow2 and I upload, how about leaving us a nice comment below ? :)  \n  \nCheers  :-)  \n\n","torrent":{"xt":"urn:btih:d794da9898ee4828a790a8909b6ef510167e828c","amp;dn":"Sexually+Broken--Amazing+MILF+with+Booming+body+Penny+Barber+Mat","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d794da9898ee4828a790a8909b6ef510167e828c","infoHashBuffer":{"type":"Buffer","data":[215,148,218,152,152,238,72,40,167,144,168,144,155,110,245,16,22,126,130,140]},"announce":[],"urlList":[]}}