{"title":"My Chemical Romance - SING (mp4-2nafish)","uid":6071059,"size":92395275,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:d8013589c682959fd00109692e9c02170de6d2bd&amp;dn=My+Chemical+Romance+-+SING+%28mp4-2nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":1,"time":1293619068,"description":"File Info:\n\nFormat            : MPEG-4\nLength            : 88 MiB\n\nVideo #0          : AVC at 2 367 Kbps\nAspect            : 1920 x 784 (2.449) at 23.977 fps\n\nAudio #0          : AAC at 128 Kbps\nInfos             : 2 channels, 44.1 KHz\n\n\nThis video has no logos or titles.\n\n\n&quot;SING&quot;, is My Chemical Romance's second single from their fourth studio album, Danger Days: The True Lives of the Fabulous Killjoys. The official single artwork was posted on the band's website on October 2010.\n\nThe music video premiered on MTV.com and VH1.com and was directed by Gerard Way and Paul Brown. Picking up after the events of the &quot;Na Na Na (Na Na Na Na Na Na Na Na Na)&quot; music video, &quot;SING&quot; opens with My Chemical Romance as their alter-egos (The Fabulous Killjoys) driving down a freeway tunnel on their Pontiac Firebird with brief &quot;television advertisement&quot; clips from Better Living Industries (BL/ind), running over a BL/ind security guard and a draculoid at a toll booth/checkpoint. The band arrives in the album's dystopia known as Battery City, stopping in front of BL/ind headquarters. Upon discovery of the Killjoys' arrival, BL/ind places their guards on stand-by all around the headquarters. The Killjoys quickly shoot their way into the building, arriving in the main security center (Scarecrow Unit) and rescue Girl (Grace Jeanette), who was previously kidknapped in &quot;Na Na Na (Na Na Na Na Na Na Na Na Na)&quot;. During this time, Korse (android gang leader of Battery City) is activated by the Scarecrow Unit's head of security NewsAGoGo (whose voice is featured in the track Party Poison), and accompanied by reinforcement draculoids and guards to stop the Killjoys. A gunfight between the Killjoys and Korse's minions follows in BL/ind's lobby. At one point, Party Poison (Gerard Way) kills and pulls off the mask of one of the draculoids, discovering him to be Agent Cherri Cola (Jimmy Urine), an ally of the Killjoys (who was captured by BL/ind while trying to infiltrate their headquarters, and turned into a draculoid). This causes Party Poison to hesitate in the fight and be grabbed by Korse who shoots him in the neck shortly after grasping him. With Party Poison dead, the remaining Killjoys continue their escape. Shortly after Party Poison's death, Kobra Kid (Mikey Way) gets shot by Korse's minions and is killed. At the lobby door, Fun Ghoul (Frank Iero), Jet-Star (Ray Toro) and Girl decide to retreat and escape; however after running outside, Fun Ghoul closes the building door, himself inside to give his allies a better chance of escaping before getting shot twice. Outside BL/ind headquarters, Jet-Star is shot, dying on the hood of the Firebird. Before the draculoids and BL/ind guards can get to Girl, she is rescued by pirate radio DJ Dr. Death Defying (Steve Righ?) and his crew including Show Pony (Ricky Rebel) and DJ Hot Chimp (Kristan Morrison). They all escape in Dr. Death Defying's van, leaving behind their dead comrades whose bodies are bagged by BL/ind.\n\nThe song debuted on BBC Radio 1 and subsequently on the band's MySpace and several other radio stations on November 3, 2010. The song was released on iTunes the same day. The song has been described as &quot;poppy&quot; and with a &quot;surprising different sound than previous MCR tracks&quot; by Wendy Rollins of Philadelphia's Radio 104.5. Dan Martin from NME reviewed the album and said the following of the song: &quot;Starting off synthy, slinky and just a little bit funky, 'SING' then erupts into another call to euphoric call to mass doing-stuff-together as waves of filthy bass cascade around Gerard as he sings, &quot;You've got to be what tomorrow needs&quot; as he dodges elephant-stomp drums.&quot; Trash Hits said of the song: &quot;This is a slower, smouldering effort which jangles in a Depeche Mode style while Gerard Way murmurs his way through.&quot;\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:d8013589c682959fd00109692e9c02170de6d2bd","amp;dn":"My+Chemical+Romance+-+SING+%28mp4-2nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d8013589c682959fd00109692e9c02170de6d2bd","infoHashBuffer":{"type":"Buffer","data":[216,1,53,137,198,130,149,159,208,1,9,105,46,156,2,23,13,230,210,189]},"announce":[],"urlList":[]}}