{"title":"Riparo.2007.iTALiAN.DVDRip.XviD.HAVEN[volpebianca]","uid":4650511,"size":734867456,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:d8f44920e0583463860174d0bbabb05db27cc895&amp;dn=Riparo.2007.iTALiAN.DVDRip.XviD.HAVEN%5Bvolpebianca%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"ivanone","files":1,"time":1232032316,"description":"\tRiparo.2007.iTALiAN.DVDRip.XviD-SVD\n\n\n\n:::Scheda del film:::\nTitolo: RIPARO\nTitolo originale: Riparo\nNazionalitÃƒÂ : Italia\nAnno: 2007\nGenere: Drammatico\nRegia: Marco Simon Puccioni\nData di uscita: 18 Gennaio 2008 (cinema)\nData di uscita DVD noleggio:  04/06/2008\nCast: Maria de Medeiros, Antonia Liskova, Mounir Ouadi, Vitaliano Trevisan, Gisella Burinato, Francesco Carnelutti\n\n:::Trama:::\n\nAl rientro da una vacanza all'estero, Anna e Mara, che fanno coppia fissa, si rendono conto che un giovane clandestino si ÃƒÂ¨ intrufolato nella loro macchina per aggirare i controlli e superare la frontiera. Anis, questo il nome del ragazzo, dice di aver perso i suoi genitori e di voler raggiungere uno zio a Milano, ma dopo poco tempo il ragazzo torna dalle due donne; lentamente, facendo leva sul desiderio inespresso di Anna di avere un figlio, si integra sempre piÃƒÂ¹ nella loro casa e nella loro vita. Anna aiuta Anis trovandogli un lavoro presso il fratello Salvio, nonostante l'opposizione di Mara, alle prese con un padre malato e con un lavoro in fabbrica che sembra essere meno certo che in passato. Dopo l'iniziale diffidenza, ma solo per un breve momento, Anna, Mara e Anis trovano finalmente un equilibrio in cui riescono ad essere un sostegno l'uno per l'altro e a dare vita ad un anomalo eppure tenero mÃƒÂ©nage ÃƒÂ  trois. Purtroppo ÃƒÂ© un equilibrio precario e difatti non dura molto: la morte del padre di Mara, il licenziamento di Anis (accusato ingiustamente di furto) e la dolce intraprendenza di Anis farÃƒÂ  cedere Mara, della quale si ÃƒÂ© innamorato, causando una catena di gelosie e sospetti. Il film, con toni a volte amari a volte piÃƒÂ¹ leggeri, racconta la realtÃƒÂ  complessa di una societÃƒÂ  fondata sul lavoro, sempre piÃƒÂ¹ mescolata, globalizzata e interdipendente dove perÃƒÂ² le differenze tra le classi sociali resistono ed influenzano pesantemente i rapporti personali, i desideri e gli affetti.","torrent":{"xt":"urn:btih:d8f44920e0583463860174d0bbabb05db27cc895","amp;dn":"Riparo.2007.iTALiAN.DVDRip.XviD.HAVEN%5Bvolpebianca%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d8f44920e0583463860174d0bbabb05db27cc895","infoHashBuffer":{"type":"Buffer","data":[216,244,73,32,224,88,52,99,134,1,116,208,187,171,176,93,178,124,200,149]},"announce":[],"urlList":[]}}