{"title":"[FTVgirls] - 2009-11-08 - Julia - The Best From Sweden - [x5 Set","uid":5204498,"size":3994566767,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:d91945d40d32cc97748af53c3928374b24925eca&amp;dn=%5BFTVgirls%5D+-+2009-11-08+-+Julia+-+The+Best+From+Sweden+-+%5Bx5+Set&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"anonimious","files":25,"time":1260309589,"description":"A Swedish girl now living in  the UK, managed to come down to the US so we can shoot her for FTV!   Lucky for us, this girl is very gorgeous, with one of the sexiest  figures you've ever seen.  A glamour model who has been on the cover  of Playboy and more... going as 'hardcore' as she ever will for a  shoot.  At a resort, we watch her on a hot summer day go from fully  clothed to completely naked, right there in that public place!  She  gets the attention of a few people, but continues to strip down and  give us some intimate views of that perfect form.  Getting all dirty  from posing on location, she goes home to take a shower.  Lathering  her body, we get closeups of her breasts, butt and feet, then watch  her rub between her legs.  Pulling out a toy, she masturbates with  the vibrator and her fingers... look at the pleasure on her face!   Then in some sexy black lingerie &amp; heels, she does some breast  massage, then gives us some extreme closeups of her private parts.   After lunch, in white heels and a cute see-through dress, she  continues to tease us at another beautiful resort.  You just can't  get enough of that figure... and that smile!  Some spreads and  fingering at this public place, then she goes completely naked so we  can watch her walk the corridors in heels.   Back home, she pulls  out a rabbit vibrator, masturbates with it, until she has a strong,  natural orgasm!  It is her first orgasm ever on camera, and we were  happy to make it happen :)\n\n\n\nCovers:\n &lt;a href=&quot;\nhttp://bayimg.com/eAGDgaacL&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://bayimg.com/eAGDgaacL&lt;/a&gt;","torrent":{"xt":"urn:btih:d91945d40d32cc97748af53c3928374b24925eca","amp;dn":"%5BFTVgirls%5D+-+2009-11-08+-+Julia+-+The+Best+From+Sweden+-+%5Bx5+Set","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d91945d40d32cc97748af53c3928374b24925eca","infoHashBuffer":{"type":"Buffer","data":[217,25,69,212,13,50,204,151,116,138,245,60,57,40,55,75,36,146,94,202]},"announce":[],"urlList":[]}}