{"title":"Muller-New Genesis(United Nations utopia)(1982)","uid":4455182,"size":838927,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:dd5aa11633a3e7d05b5e0d61b224fc33d019c7c8&amp;dn=Muller-New+Genesis%28United+Nations+utopia%29%281982%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"red_gonzo","files":1,"time":1224444694,"description":"This is Robert Muller&amp;#039;s utopian book New Genesis - Shaping a Global Spirituality (1982) which presents his blueprint for a framework of an ever-evolving humanity, reaching toward fulfillment and happiness, grounded in the enlightened pragmatism of Teilhard de Chardin. Muller, who has been called the philosopher of the United Nations and its prophet of hope, believes the world can - and will - become a better place to live. His many years at the United Nations have convinced him that there is a growing movement, even in the seemingly endless conflict between nations, toward a brotherhood of all peoples. He sees the dawning of a global age and contends that the nations of the world are, sometimes in spite of themselves, overcoming their narrowness and working together for true peace and respect among all peoples. He cites as proof of this emerging pattern, world conferences on: disarmament, ecology, the aged and the hungry, and the great distances we have come in perceiving the international scope of these problems. Simply the existence of the United Nations, as the first gathering place of representives from all countries, is heartening evidence that beneath the worst jin-goist bluster lie the natural impulses of fraternity and understanding. He also appeals to the worlds religions to redouble their efforts to educate their followers to the true birthright of us all - the right to live in peace. The author has been serving the United Nations for thirty-three years as Assistant Secretary-General in charge of coordinating the work of the thirty-two specialized agencies and world programs of the United Nations. New Genesis is a religiously motivated utopian world where United Nations conduct world affairs and where nations, wars, hunger and everything bad for humanity simply ceases to exist. But the history clearly shows that utopias have never brought any good to humanity, more to the contrary. But since they sound so nice, millions were and will be prepared to live and die for them. Utopian ideals turn people into restless fanatics and eventually lead to slaughter since the fairytales never come true. It is concerning that such religious devotees are to be found at the very top of United Nations but it seems that this world really has two new age popes right now: one sits in Rome, the other in New York. 200 pages. A must read for everyone.\n","torrent":{"xt":"urn:btih:dd5aa11633a3e7d05b5e0d61b224fc33d019c7c8","amp;dn":"Muller-New+Genesis%28United+Nations+utopia%29%281982%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dd5aa11633a3e7d05b5e0d61b224fc33d019c7c8","infoHashBuffer":{"type":"Buffer","data":[221,90,161,22,51,163,231,208,91,94,13,97,178,36,252,51,208,25,199,200]},"announce":[],"urlList":[]}}