{"title":"AndrÃƒÂ© Previn - We Got It Good &amp; That Ain't Bad (","uid":4735764,"size":174199860,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:ddf8ee319a6fdf2ceef9732587d23b7be6184c86&amp;dn=Andr%C3%83%C2%A9+Previn+-+We+Got+It+Good+%26+That+Ain%5C%27t+Bad+%28&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"schon55","files":17,"time":1235270917,"description":"AndrÃƒÂ© Previn - We Got It Good &amp; That Ain't Bad \nReleased in 1999 \nLabel: Deutsche Grammophon\nBitrate: 320 kbps\n\n'AndrÃƒÂ© Previn's standing in the world of classical music has had its ups and downs ( though certainly more of the former than the latter ), but as a jazz pianist he has always been at the top of his profession.  One of the few classically trained artists who can 'cross over' stylistically with complete success, his album of Ellington classics builds on his and bassist David Finck's impressive achievement in an earlier DG release devoted to Gershwin favorites.  The selection of tunes nicely explores Ellington's range as a composer, from the up-tempo sassiness of 'It Don't Mean a Thing' and the Gospel-influenced 'Come Sunday', to the cool, smooth 'In a Mellow Tone'.  Previn's improvisations and embellishments respect the original melodies while at the same time revealing their different facets and potential for musical development.  Ellington was, as Previn himself notes, a genuine composer, not just a bandleader or songwriter, and it's to Previn and Finck's credit that you come away from this program with a renewed sense of just how marvelous a musician Ellington really was.  And you can't really ask for more than that'. ~ David Hurwitz\n\n'Previn has always been an adept, if not brilliant, pianist whose jazz leanings have belied his classical training.  Here he interprets the music of Duke Ellington and Billy Strayhorn lovingly and as well as any legit jazzster could, with help from the fine bassist David Finck.  While this music can easily stand on its own, Previn's technical ability and heartfelt stretching of the original blueprints urge these well-worn tunes to carry new meaning and substance.  If there are any stock treatments here, it's because the pianist tends to lay back and let the melodies come to him, as evidenced on the steady-paced 'Isfahan,' the easy 'Serenade to Sweden,' and the even easier swung 'I Didn't Know About You.'  Previn wrings every emotional drop out of 'In a Sentimental Mood,' dismisses a time frame for the pristine 'I Got It Bad' and 'Come Sunday,' while Finck is in late for the pensive 'Chelsea Bridge.'  Melody is more implied with tempos at half and full speed on 'It Don't Mean a Thing,' Previn uses an off-minor change-up on the good swinger 'Things Ain't What They Used to Be,' and swaps 4/4 in the bridge for a waltzing 3/4 head and tail on 'Take the A Train.'  Obviously an admirer of Oscar Peterson, Previn takes liberties and risks on the easy swing take of 'In a Mellow Tone,' trades ripped-up lines with the capable Finck, counter-punching during 'Do Nothin' 'Til You Here From Me,' and fervently digs into the up-tempo 'Squatty Roo.'  Perhaps Previn's voracity is not well known, or as regarded in the modern jazz world as it should be, but on this recording it's clear how great he can be.  This second CD with Finck, the previous being a Gershwin songbook 'We Got Rhythm,' signifies a step up for the veteran pianist, and is perhaps his shining recorded hour.  Recommended.' ~ MG Nastos, All Music Guide\n\nPersonnel:\nAndrÃƒÂ© Previn - piano\nDavid Finck - double bass\n\nAndrÃƒÂ© Previn - We Got It Good &amp; That Ain't Bad Tracks:\n01  Take The 'A' Train ( Strayhorn )\n02  Isfahan ( Ellington / Strayhorn )\n03  I Got It Bad (  And That Ain't Good ) ( Ellington / Paul Francis Webster )\n04  Do Nothin' Till You Hear From Me ( Ellington / Strayhorn / Bob Russel )\n05  Chelsea Bridge ( Strayhorn )\n06  Things Ain't What They Used To Be ( Mercer Ellington / Ted Persons )\n07  In A Sentimental Mood ( Ellington / Irving Mills / Manny Kurtz )\n08  Squatty Roo ( Johnny Hodges )\n09  Come Sunday ( Ellington )\n10  Serenade To Sweden ( Ellington )\n11  I Didn't Know About You ( Ellington / Bob Russell )\n12  In A Mellow Tone ( Ellington / Milt Gabler )\n13  It Don't Mean A Thing ( If It Ain't Got That Swing ) ( Ellington / Strayhorn / Irving Mills )","torrent":{"xt":"urn:btih:ddf8ee319a6fdf2ceef9732587d23b7be6184c86","amp;dn":"Andr%C3%83%C2%A9+Previn+-+We+Got+It+Good+%26+That+Ain%5C%27t+Bad+%28","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ddf8ee319a6fdf2ceef9732587d23b7be6184c86","infoHashBuffer":{"type":"Buffer","data":[221,248,238,49,154,111,223,44,238,249,115,37,135,210,59,123,230,24,76,134]},"announce":[],"urlList":[]}}