{"title":"Armin.Van.Buuren-Mirage-CD-2010-TGX","uid":5793041,"size":119436024,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:dea4459f39a5ed5dabbe6530971dc507be22f6ad&amp;dn=Armin.Van.Buuren-Mirage-CD-2010-TGX&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"wilimaw","files":-1,"time":1282925138,"description":"Artist ............ : Armin van Buuren\nTitle ............. : Mirage\n\nGenre ............. : Trance\nLabel ............. : Armada Music\nCatalog Number .... : ARMA263\n\nSource ............ : CD\nQuality ........... : 199kbps avg / 44.1KHz / Joint Stereo\nPlaytime .......... : 01:19:42  (113.MB)\nRelease Date ...... : 2010-08-27\n\n\n[Track List]\n1. Armin van Buuren feat. Susana - Desiderium 207                      2:08\n2. Armin van Buuren - Mirage                                           6:42\n3. Armin van Buuren feat. Christian Burns - This Light Between Us      5:09\n4. Armin van Buuren vs. Sophie Ellis Bextor - Not Giving Up On Love    2:53\n5. Armin van Buuren - I Don't Own You                                  6:45\n6. Armin van Buuren - Full Focus                                       4:42\n7. Armin van Buuren feat. Winter Kills - Take  A Moment                5:02\n8. Armin van Buuren feat. Nadia Ali - Feels So Good                    3:58\n9. Armin van Buuren feat. Sophie - Virtual Friend                      7:10\n10.Armin van Buuren feat. Laura V - Drowning                           2:44\n11.Armin van Buuren feat. Ana Criado - Down To Love                    4:15\n12.Armin van Buuren - Coming Home                                      6:20\n13.Armin van Buuren feat. BT - These Silent Hearts                     5:49\n14.Armin van Buuren - Orbion                                           5:18\n15.Armin van Buuren vs. Ferry Corsten - Minack                         6:44\n16.Armin van Buuren - Youtopia                                         3:59\n\n\n[Release Notes]\nIt's the album the entire dance scene has been waiting for. After months\nof hard work and creativity, the number one DJ in the world delivers his\nfourth artist album. Armin van Buuren is proud to present to you:\n'Mirage'. Armin: &quot;Mirage has been the biggest project I've ever worked\non. There's so many hours in this. Work started two years ago when I\nactually built a completely new studio for this project. Many new\ntechniques were used and most of all I had so much fun creating this with\nthe many people that are involved. It was a journey, an epic one!&quot; '76',\n'Shivers' and 'Imagine' are still etched in memory of millions of dance\nmusic lovers. Fresh memories will be made as soon as the album hits\nstores on September 10th 2010. 'Mirage' reveals a side of Armin his fans\nhaven't heard yet and takes in its listeners with new and surprising\ncollaborations. Within the 2 years of endless jamming and producing,\nArmin invited artists like Sophie Ellis-Bextor, Ferry Corsten, BT, Nadia\nAli, Guy Chambers, Christian Burns and Adam Young of Owl City into his\nstudio.\n\nAs the first single of the album, Armin chose 'Full Focus', an\ninstrumental track set to fill arenas, clubs and scorch across the\nfestival terrains set up for the summer of 2010. Armin:&quot;The first track\nof the album has been a sure shot in my sets for quite a while now. I\ndecided to come back with an instrumental trancer right before summer and\nall the big festivals. Half of my new album will be instrumental trance,\nbut with the sound of 2010.&quot;\n\nRight after summer, it's time for the full 'Mirage' album to take over.\nInspired and influenced by many different types of music, 'Mirage' is\nmore diverse than any other Armin album before. His collaboration with\nSophie Ellis-Bextor, 'Not Giving Up On Love' is a perfect example of\nthat, combining the best of both worlds. Armin:&quot;The Nervo Sisters, Sophie\nEllis-Bextor and me met up to write the vocals for 'Not Giving Up On\nLove'. I was thrilled to work with them on this. We gave it a more analog\nfeel with some real drums, to give it a pop-rock feel. We also put a\npiano top line on the track and then the vocals of Sophie, which I think\nis a win. It's a lush summer tune with an epic vocal that gets stuck in\nyour head and cheers you up!&quot;\n\n'Mirage' is filled with musical fusions and surprising interpretations,\nfrom the orchestral masterpiece of title track 'Mirage', deep trance\ntrack 'I Don't Own You' and housy 'Feels So Good' to the eerie 'Take A\nMoment' and feel-good 'Drowning'. 16 tracks that highlight how Armin has\nmatured as an artist.","torrent":{"xt":"urn:btih:dea4459f39a5ed5dabbe6530971dc507be22f6ad","amp;dn":"Armin.Van.Buuren-Mirage-CD-2010-TGX","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dea4459f39a5ed5dabbe6530971dc507be22f6ad","infoHashBuffer":{"type":"Buffer","data":[222,164,69,159,57,165,237,93,171,190,101,48,151,29,197,7,190,34,246,173]},"announce":[],"urlList":[]}}