{"title":"The Cancer Conspiracy - The Audio Medium","uid":9321746,"size":105621209,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:df53a3b2a4b46c72abf07f0e4a63b5a52c08ef8a&amp;dn=The+Cancer+Conspiracy+-+The+Audio+Medium&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"boogybot","files":9,"time":1386563805,"description":"The Cancer Conspiracy was a progressive rock group from Burlington, Vermont featuring guitarist Daryl Rabidoux, drummer/keyboardist/saxophonist Greg Beadle, and bassist Brent Frattini. Rabidoux and Beadle were veterans of the local hardcore scene, and had broken away from their respective bands out of a need to try something new musically. Their initial plans were to find a vocalist and bassist, but after recruiting Frattini, decided to remain an instrumental trio.\n\nTheir style draws heavily upon 70s progressive rock, particularly King Crimson and Yes, as well as fusion, hardcore, and math rock. Their first self-titled 3 song EP was released in 2001, consisting of 2 studio tracks and 1 live track. Their 9 song full-length debut The Audio Medium followed in 2002. The album explored a number of sonic landscapes, and revolved around the concept of the corporate music industry's control of the masses; that people are sheep to what music corporations and radio stations tell them to listen to, unaware of the real music that exists out there.\n\n As in the medical world, a &quot;cancer conspiracy&quot; that hides the cure for cancer for the purpose of making money from the sick. The album booklet contained a letter from a doctor by the name of Dr. Travis John, who shared similar views and who warned the band of the trouble they were getting themselves into.","torrent":{"xt":"urn:btih:df53a3b2a4b46c72abf07f0e4a63b5a52c08ef8a","amp;dn":"The+Cancer+Conspiracy+-+The+Audio+Medium","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"df53a3b2a4b46c72abf07f0e4a63b5a52c08ef8a","infoHashBuffer":{"type":"Buffer","data":[223,83,163,178,164,180,108,114,171,240,127,14,74,99,181,165,44,8,239,138]},"announce":[],"urlList":[]}}