{"title":"TheObamaDeception.iso","uid":4774927,"size":2500599808,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:df85ab504618fa023db985695d070dc482a9b076&amp;dn=TheObamaDeception.iso&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"rm_sharkey","files":1,"time":1237175678,"description":"The Obama Deception is the latest movie from Alex Jones,http://prisonplanet.tv Please support Alex with a subscription if you like this.\n\nThe Obama Deception is a hard-hitting film that completely destroys the myth that Barack Obama is working for the best interests of the American people. The Obama phenomenon is a hoax carefully crafted by the captains of the New World Order. He is being pushed as savior in an attempt to con the American people into accepting global slavery. We have reached a critical juncture in the New World Order's plans. and only by exposing the con can we help to save freedom in America. The Obama Deception is not about Left or Right: it's about a One World Government. The international banks plan to loot the people of the United States and turn them into slaves on a Global Plantation. Covered in this film: who Obama works for, what lies he has told, and his real agenda, and how his initial appointments and actions prove he serves the corporate oligarchs, not the American people. If you want to know the facts and cut through all the hype, this is the film for you. ","torrent":{"xt":"urn:btih:df85ab504618fa023db985695d070dc482a9b076","amp;dn":"TheObamaDeception.iso","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"df85ab504618fa023db985695d070dc482a9b076","infoHashBuffer":{"type":"Buffer","data":[223,133,171,80,70,24,250,2,61,185,133,105,93,7,13,196,130,169,176,118]},"announce":[],"urlList":[]}}