{"title":"Bare Behind Bars - HDDivxRipBy RUBrTOE.avi","uid":3830799,"size":832686518,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:e018f7c440a390431beab5dc9694a80509aa8458&amp;dn=Bare+Behind+Bars+-+HDDivxRipBy+RUBrTOE.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"RubberTow","files":1,"time":1191599171,"description":"The big thrill of this movie is renting it from Netflix purportedly does not rent x-rated movies, although this is the second one I&amp;#039;ve rented and I&amp;#039;m hunting for the rest. Another thrill would be if Netflix post this review with all my references to head jobs, muffs and penetration left in it.This movie has what all sexplotation and women-in-prison flicks should have: scads of pretty to fairly pretty, silicone-free naked women and real sexual penetration. Yes, this movie has everything required to be a classic: almost continual nudity and real, as well as obviously fake sex. I guess the movie crew might have pulled off a good fake with the real sex, but I seriously doubt that they were that good or clever, judging by the other &quot;special&quot; effects in  the movie. Consider this: Could a film crew that could not make fake blood look remotely realistic and did not make most of the simulated sex scenes look halfway legit, pull off a world-class fake-out by making four of the simulated sex scenes look absolutely real? The countdown: One real vaginal penetration with a penis-shaped toy; Two women sucking off men with semi-erect penises; one scene in which a man has actual vaginal intercourse with a woman; one scene of a woman ostensively licking and sucking an erect penis, but she&amp;#039;s really got her mouth on a penis-looking sex toy; and several scenes of men and women with their faces buried in muffs -RUBrTOE","torrent":{"xt":"urn:btih:e018f7c440a390431beab5dc9694a80509aa8458","amp;dn":"Bare+Behind+Bars+-+HDDivxRipBy+RUBrTOE.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e018f7c440a390431beab5dc9694a80509aa8458","infoHashBuffer":{"type":"Buffer","data":[224,24,247,196,64,163,144,67,27,234,181,220,150,148,168,5,9,170,132,88]},"announce":[],"urlList":[]}}