{"title":"Chaka Khan - C.K. [1988, 320 kbps]","uid":4989712,"size":133378008,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:e0854eb14d83a1aef0bfb312d592bfab2d3e99a5&amp;dn=Chaka+Khan+-+C.K.+%5B1988%2C+320+kbps%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"musicalibera","files":20,"time":1246974363,"description":"CHAKA KHAN - C.K. (1988)\n\nCodec: mp3.\nDescription: MPEG-1 Audio Layer 3.\nBit rate: 320 kbps.\nSample rate: 44100 Hz joint stereo.\nTags type: ID3V1 &amp; ID3V2.\nSource formats: CD.\nSources: C.K. (Warner Bros. 1988, AAD)\nNumber of tracks: 10.\n\nAllmusic review:\n\n&quot;A first-class release, despite the fact that it didn't pack the normal commercial punch. But it had excellent production, many outstanding selections, and uniformly dazzling, booming, triumphant vocals from Khan. She currently speaks with disdain about the record business, and it's probably due to the relative failure of great records like this to break out and really enjoy the success they merit that's disillusioned her.&quot; \n\nWikipedia:\n&quot;C.K. is the eighth studio album by American R&amp;B/funk singer Chaka Khan, released on the Warner Bros. Records label in 1988. C.K. was Khan's first album not to be recorded with Arif Mardin, instead it had with the exception of two tracks Russ Titelman at the helm as producer, with whom she had collaborated on hits like &quot;Ain't Nobody&quot; (1983), &quot;Eye to Eye&quot; from 1984's platinum-selling I Feel for You as well as &quot;Tight Fit&quot; from her previous album Destiny. \nMusically C.K. combined a variety of genres such as soul, R&amp;B, funk, pop as well as two jazz titles and altogether the set was more laid-back, less hip-hop influenced and production-wise not as complex and synth-driven as I Feel for You and Destiny. \nThree singles were released from C.K.: Womack &amp; Womack's Latino-flavoured &quot;It's My Party&quot; which reached #5 on Billboard's R&amp;B Singles chart, &quot;Soul Talkin'&quot; and &quot;Baby Me&quot; which became another Top 10 hit on the R&amp;B chart, peaking at #8. The C.K. album itself also charted higher than the preceding Destiny, reaching #17 on the R&amp;B Albums chart. \nC.K. opens with Khan's cover of Stevie Wonder's 1970 hit &quot;Signed, Sealed, Delivered I'm Yours&quot;, again featuring the composer himself on harmonica, just like on &quot;I Feel for You&quot;. \nOne of the two tracks not to be produced by Russ Titelman was the funky and improvisational &quot;Sticky Wicked&quot;, Khan's first proper collaboration with Prince after having covered his &quot;I Feel for You&quot; in 1984 and turning it into a million-selling hit single. C.K. also includes a second Prince composition, &quot;Eternity&quot; (produced by David Frank and Khan herself), and some ten years later Khan and Prince were to team up for a full-length album together, Come 2 My House. \nC.K. features two recordings of jazz classics that since have become mainstays in Khan's live repertoire, &quot;The End of a Love Affair&quot;, a tribute to Billie Holiday who first recorded the song on her 1958 album Lady in Satin, and Alec Wilder's &quot;I'll Be Around&quot;, the latter with a guest appearance by another legend in the jazz genre, Miles Davis, who in fact also features on the Prince track &quot;Sticky Wicked&quot;. \nC.K. was transferred from vinyl to CD in 1988 and remains in print.&quot;\n\n\nTRACK LIST\n\nC.K.\n====\n01. Signed, Sealed Delivered (I'm Yours)\n02. Soul Talkin'\n03. It's My Party\n04. Eternity\n05. Sticky Wicked\n06. The End Of A Love Affair\n07. Baby Me\n08. Make It Last\n09. Where Are You Tonite\n10. I'll Be Around\n\nEnjoy - and thanks in advance for seeding.\n","torrent":{"xt":"urn:btih:e0854eb14d83a1aef0bfb312d592bfab2d3e99a5","amp;dn":"Chaka+Khan+-+C.K.+%5B1988%2C+320+kbps%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e0854eb14d83a1aef0bfb312d592bfab2d3e99a5","infoHashBuffer":{"type":"Buffer","data":[224,133,78,177,77,131,161,174,240,191,179,18,213,146,191,171,45,62,153,165]},"announce":[],"urlList":[]}}