{"title":"Democracy Now - 16 nov 2010","uid":5960206,"size":453548069,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:e0a0b25dc4971a414e8713cfd7d8226de84db53e&amp;dn=Democracy+Now+-+16+nov+2010&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":null,"files":1,"time":1289925965,"description":"An alternative daily newschannel. One hour with news as you do not see it elsewhere. &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n\nHeadlines for Nov 16, 2010\n\n- Report: Pakistani Women and Children Killed in U.S. Drone Attack\n- Clinton Defends U.S. Military Operations in Afghanistan\n- U.S. Considers Military Bases, Expanded CIA Role in Yemen\n- 2 Killed in Protest at UN Base in Haiti\n-to Compensate Gitmo Prisoners\n- Amnesty Urges E.U. to Probe Rendition, Torture\n- Palestinians Criticize U.S. Incentives for Settlement Freeze\n- Number of Households Seeking Food Aid Nearly Doubles\n- 12 Arrested Protesting &quot;Don't Ask, Don't Tell&quot; Policy\n- Congress Reconvenes for Lame Duck Session\n- Rangel Walks Out of House Ethics Hearing\n- Fmr. Alabama State Trooper Sentenced to 6 Months for 1965 Slaying\n\n\nSpecial reports\n\n- In First Interview Since Critical Injury at West Bank Protest, U.S. Peace Activist Tristan Anderson Urges Iran to Free Jailed Hikers\n\nThe U.S. peace activist Tristan Anderson has given his first interview since being critically injured when Israeli soldiers fired a high-velocity tear gas canister directly at his head in 2009. Anderson was taking part in a weekly nonviolent protest against Israel's separation wall in the West Bank. On Sunday, he helped unfurl a banner calling for the release of his friends Shane Bauer and Josh Fattal, the two U.S. hikers who remain imprisoned in Iran. Anderson and the freed American hiker Sarah Shourd also sat down for a joint interview.\n\n\n- Wendell Potter on &quot;Deadly Spin: An Insurance Company Insider Speaks Out on How Corporate PR is Killing Health Care and Deceiving Americans&quot;\n\nIn the wake of the midterm elections, Republican lawmakers are vowing to repeal or defund the Democrats' landmark healthcare reform bill that President Obama signed into law earlier this year. A health insurance insider-turned-whistleblower argues that, instead of repealing the law altogether, Republicans will ultimately settle for gutting the law of its provisions that protect consumers. That's because the insurance industry is a major beneficiary of healthcare reform and they're also a major contributor to Republican campaigns. Wendell Potter should know. He spent two decades as a spokesman for two of the nation's largest health insurers, Humana and CIGNA. He quit and made national headlines in June of last year when he testified on Capitol Hill about the profit motive driving the unscrupulous practices of the insurance industry. Wendell Potter joins us for an extended interview about his new book, Deadly Spin: An Insurance Company Insider Speaks Out on How Corporate PR is Killing Health Care and Deceiving Americans. &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;","torrent":{"xt":"urn:btih:e0a0b25dc4971a414e8713cfd7d8226de84db53e","amp;dn":"Democracy+Now+-+16+nov+2010","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e0a0b25dc4971a414e8713cfd7d8226de84db53e","infoHashBuffer":{"type":"Buffer","data":[224,160,178,93,196,151,26,65,78,135,19,207,215,216,34,109,232,77,181,62]},"announce":[],"urlList":[]}}