{"title":"Dungeon of the Endless Early Access","uid":9345040,"size":78836158,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:e65c90526c5053dae3413f08c33fa30e0504b9f1&amp;dn=Dungeon+of+the+Endless+Early+Access&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"7","files":1,"time":1387020979,"description":"Dungeon of the Endless is a Rogue-Like Dungeon-Defense game, in which the player and their team of heroes must protect the generator of their crashed ship while exploring an ever-expanding dungeon, all while facing waves of monsters and special events as they try to find their way out... so what could go wrong... open the door! \n\n BACKGROUND STORY \n A few hundred condemned criminals were being shipped to the Auriga system on board the prison hulk ï¿¿Successï¿¿. While this was presented as a chance to earn back their place in society by working hard for the common good, they understood that in fact they would be slave labour, sent to colonize an unexplored planet. All they knew about Auriga Prime was what the probes told them: it had water, temperate zones, plant life, and plenty of metals in the crust. \n\n In fact, the planet Auriga once hosted a major settlement of the galaxy-travelling ancestors known as the Endless. In addition, the planet was still orbited by a functioning (and well cloaked) defensive system, which sprang eagerly to life upon the arrival of the Success. Within a few minutes, the ship was nothing but a few large chunks of metal falling toward the planet. \n\n Every set of holding cells also functioned as an escape pod, so the ship let itself disintegrate and the surviving prisoners fell bruised but (temporarily) alive and (momentarily) safe to the planet below. Safe, that is, until they realized that they had crashed through some sort of facility of the Endless, down to a sub-basement so deep and ancient it might as well be called a dungeonï¿¿ \n\n FEATURES... or &quot;How to survive in an Endless dungeon&quot; \n\n Gather A Team. \n\n     Form a team of heroes, each with their own strengths (and psychoses)ï¿¿ or die \n     Equip them, deploy them, and earn powerful abilities*ï¿¿ or die \n     Manage the balance between ex-prison inmates and guards*ï¿¿ or die \n     Discover the hidden secrets and goals* of the survivorsï¿¿ or die \n\n\n Build Your Defenses. \n\n     Use the Dust you gather to power the roomsï¿¿ or die \n     Use scarce resources to help your team surviveï¿¿ or die \n     Build minor and major modules to hold off waves of monstersï¿¿ or die \n     Decode Endless ruins* to discover life-saving technologiesï¿¿ or die \n\n\n Open the Door. \n\n     Each door is a danger; prepare yourself and your team for anythingï¿¿ or die \n     Explore and discover an infinity of levels and layoutsï¿¿ or die \n     Carry your crystal through waves of monsters to the exit of each levelï¿¿ or die \n     Fight your way to the surface to discover the truth about Auriga*ï¿¿ or die \n\n\n *These features, and others that will be discussed with the community via the GAMES2GETHERï¿¿ platform, are not yet available. This Alpha Version is incomplete and will be replaced by a complete version when the final game is released. \n\n ----------------------- \n crack:\n 1. unpack archive \n 2. run DungeonoftheEndless.exe\n","torrent":{"xt":"urn:btih:e65c90526c5053dae3413f08c33fa30e0504b9f1","amp;dn":"Dungeon+of+the+Endless+Early+Access","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e65c90526c5053dae3413f08c33fa30e0504b9f1","infoHashBuffer":{"type":"Buffer","data":[230,92,144,82,108,80,83,218,227,65,63,8,195,63,163,14,5,4,185,241]},"announce":[],"urlList":[]}}