{"title":"Dark Horizon-SKIDROW","uid":4423699,"size":1067726554,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:e73373f34631651aa9918d46276151c283b21c06&amp;dn=Dark+Horizon-SKIDROW&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Man001","files":2,"time":1222913549,"description":"S K i D R O W\n\nT H E L E A D i N G F O R C E\n\nproudly presents\nDark Horizon / Paradox Interactive\n\nRELEASE DATE: 01-10-2008 PROTECTION: Nothing\nGAME TYPE: Space Action Adventure DISKS: 1 DVD\n\nRelease Notes:\n\nDisaster has taken its harsh grip and the universe is slowly\ndying. Systems cease to exist and there seems to be no way of\nstopping the threat. But a rumour is slowly spreading through\nthe galaxy of a weapon against this menace\n\nThe space action game Dark Horizon takes place in a\nbreathtaking atmospheric universe with an epic storyline about\nthe fight for survival. In this world you can choose play as\nthe mysterious race Guardians, among others, through 22\nmissions of space combats to save the humanity from the\nall-destroying hazard, the Mirk. Use the help of your allies:\nother Guardians will fight side by side with you, and\nbiomechanical race bios will assist you with their high-tech\ndevices and weapons\n\nYou cannot only modify your ships and weapons. Throughout your\nchallenging space missions you can gather resources that can\nbe used to create your own equipment and weapons between the\nmissions. The new modes also allow you to decide between\nmoving invisible through enemy lines, which results in weaker\nattacks or you can choose a stronger attack mode that weakens\nyour shields\n\nAllows full customization of your spaceship. You can change\nyour ship on a detailed level and alter hull, shields system\nreactor, armour, weapons, missiles etc\n\nGather resources and disassemble unused parts of your ship and\nuse them to create your own weapons for supreme destructive\npower and improve your ship to create the ultimate space\nvessel\n\nFight in team with other pilots trough fierce battles, give\norders and use tactics to take out your enemies (please note\nno multiplayer!)\n\nChoose between two different modes that will change your\nfighters performance according to your own demands: shadow\nmode to stealth through enemy lines (yet it prevents using\nfull power of your weapons) and corter mode that will level\nup the power of you guns at a cost of energy-usage that\nweakens your shields\n\nGame legthtime 6 parts in 22 missions (1-2 objectives each)\nand extensive\n\nInstall Notes:\n\n1. Unpack Release\n2. Mount/Burn Image\n3. Install Game\n4. Play the game.","torrent":{"xt":"urn:btih:e73373f34631651aa9918d46276151c283b21c06","amp;dn":"Dark+Horizon-SKIDROW","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e73373f34631651aa9918d46276151c283b21c06","infoHashBuffer":{"type":"Buffer","data":[231,51,115,243,70,49,101,26,169,145,141,70,39,97,81,194,131,178,28,6]},"announce":[],"urlList":[]}}