{"title":"First_Blood-Silence_Is_Betrayal-(Deluxe_Edition)-2010-pLAN9","uid":5956371,"size":74522493,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:e74c3438e6a5f946445e5720a1a4e99506bcb63e&amp;dn=First_Blood-Silence_Is_Betrayal-%28Deluxe_Edition%29-2010-pLAN9&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"rezar1337","files":20,"time":1289733401,"description":"p L A N  9    p R E S E N T S !\n\nARTiST.......: First Blood\nALBUM........: Silence Is Betrayal\nGENRE........: Hardcore\nLABEL........: Bullet Tooth\n\nYEAR.........: 2010\nRiP.DATE.....: 2010-11-13\nSTORE.DATE...: 2010-11-09\n\nSOURCE.......: CD\nGRABBER......: EAC V0.99 prebeta 4\nENCODER......: LAME v3.97\nSiZE.........: 74.42 megs\nBiTRATE......: 221 kbps avg\n\n\n\n\nack?\n\n\n\n\n\n\n\n\n1.  Intro                                                     1:08\n2.  Silence                                                   0:53\n3.  Preamble                                                  3:16\n4.  Enemy                                                     2:32\n5.  Resist                                                    1:23\n6.  Truth                                                     1:21\n7.  Detach                                                    4:51\n8.  Enslaved                                                  2:47\n9.  Confront                                                  2:37\n10. Fear                                                      2:10\n11. Occupation                                                2:51\n12. Fascism                                                   3:50\n13. Lies                                                      3:54\n14. Messenger                                                 1:11\n15. Survive                                                   4:04\n16. Armageddon II                                             5:51\n------\n44:39\n\n\n\n\n\n1) Download tracks\n2) Copy cracked content to winamp, ipod or mp3 player\n3) ????????\n4) Profit!\n\nMy first thought upon hearing about a new First Blood release:\nfinally. My first thought upon actually hearing the release: where\nthe hell is John Rambo!? The Rambo gimmick from the first EP and\nfull-length has been largely dropped in favor of a windmill kick\nto the face of the Establishment, but have no fear: First Blood\nare still delightfully over the top (like what I did with another\nStallone reference there?), with bone-rattling breakdowns and\nunbridled rage tearing at every seam. Instead of the obligatory\nGatling gun and Mr. Stallone screaming audio clips, we are treated\nto a wide array of conspiracy theories and social criticism\nrhetoric interspersed throughout the album, highlighting the\nphilosophies of the band. Of course its overbearing, but thats\nalways been the appeal of First Bloodeverything from the one-word\nsong titles to the political soap-boxing will polarize listeners.\nIt will be more than a lot of people can stomach, but it will turn\nsome people on. Way on.\n\nSilence Is Betrayal retains the strong comparisons to Terror while\nplaying like the more acerbic follow-up to Madballs Infiltrate\nthe System. Theres an immediacy present that belies the four year\nwait time for the release, as if by their estimation the band had\nno choice but to speak up. The title is based on a Martin Luther\nKing, Jr. speech, and it becomes clear during the intro, if the\nartwork didnt already give it away, when Mario Savios voice\ndrifts in with the famous Bodies Upon the Gears speech, that\nits no longer about rescuing POWs in Vietnam, but taking on gross\ncorruption and injustice right now.\n\nThats not only the general theme of the record; the music itself\nfeels like its hurtling toward chilling album closer Armageddon\nII, a dire warning about nuclear war. Its call-backs and gang\nvocals, a seamless track sequencing linking each mortar shellin\nother words, all flow and virtually no ebb; shrapnel in the form\nof Carl Schwartzs harsh vocals delivering knock-out punches while\nthe boys flail fists to the backing beat-down violent enough to\ncause a cerebral hemorrhage. Silence Is Betrayal is like the\nnuclear war of Armageddon II: once First Blood set it off,\neverything within a ten mile radius is doomed.\n\nSo the moral of the story is this: politicians are fucking\nassholes, and I respect a hardcore band in todays scene thats\nnot afraid to reach back to the roots of their genre and be a\nlittle outspoken on top of their devastating pit anthems. So its\nsound and fury for a reason. But as weve seen before, First Blood\ndoesnt necessarily need a reason to bludgeon the listener to\nauditory deathits just that much more potent now that they do.\n\n--Jake Oliver\n\n\n\nbLiNG!\n\n\nsP!\n\n\niN                                    tRUST\nsPACEGATS               wE","torrent":{"xt":"urn:btih:e74c3438e6a5f946445e5720a1a4e99506bcb63e","amp;dn":"First_Blood-Silence_Is_Betrayal-%28Deluxe_Edition%29-2010-pLAN9","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e74c3438e6a5f946445e5720a1a4e99506bcb63e","infoHashBuffer":{"type":"Buffer","data":[231,76,52,56,230,165,249,70,68,94,87,32,161,164,233,149,6,188,182,62]},"announce":[],"urlList":[]}}