{"title":"[PS3] Spider-Man: Shattered Dimensions","uid":9268753,"size":13454416121,"categoryP":"games","categoryS":"psx","magnet":"?xt=urn:btih:e76a6a530236b4915e421df0a8315af9f5477cd2&amp;dn=%5BPS3%5D+Spider-Man%3A+Shattered+Dimensions&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":3,"uploader":"fuckface69","files":-1,"time":1385740161,"description":"The game begins in the Amazing universe, with Amazing Spider-Man pursuing Kraven the Hunter for his tablet fragment. When Spider-Man confronts him, Kraven uses the fragment's powers to gain super speed. Spider-Man manages to defeat Kraven and claim the fragment. The game then shifts to the Noir universe where Spider-Man Noir moves through the shadows to claim a fragment from Hammerhead. When confronted, Hammerhead uses it to fuse his guns to his arms, and decides to use it to overthrow Osborn. Spider-Man manages to defeat Hammerhead and claim his fragment. In the 2099 universe, Spider-Man 2099 chases Hobgoblin through the city and then uses the tablet fragment to amplify his psy-powers. Spider-Man eventually defeats Hobgoblin and claims the fragment. Meanwhile in the Ultimate universe, Ultimate Spider-Man battles Electro at a nearby dam where Electro uses the fragment to grow larger and make minions to fight Spider-Man. Spider-Man tricks Electro into attacking a dam which releases water, shorting out Electro's powers. Spider-Man then claims his tablet fragment. Meanwhile, Mysterio discovers that there are more pieces of the tablet.\n\nAmazing Spider-Man then finds a fragment in the clutches of Sandman at an abandoned quarry owned by Roxxon Industries. Sandman uses the fragment's power to take over the quarry and create minions, which he uses to attack Spider-Man. Spider-Man defeats Sandman with the use of water, claiming his fragment. Spider-Man Noir then pursues Vulture through the streets; Vulture's fragment grants him teleportation powers. When he finally faces Vulture, Spider-Man defeats him by exposing him to light, then claims the fragment. Spider-Man 2099 next discovers that Scorpion has used a fragment's power to lay eggs, which hatch into miniature versions of himself. When Spider-Man confronts him, Scorpion mentions that he is hired to steal the fragment. During the ensuing battle, Spider-Man traps Scorpion under debris and claims the tablet fragment. Ultimate Spider-Man is then challenged to appear on Deadpool's reality show. He maneuvers through the set while fighting Deadpool's fans, destroying cameras and evading tidal waves. Upon confronting Deadpool, Spider-Man is given a fake tablet fragment. Deadpool then uses the real fragment to make two clones of himself (each duplicate with a different weapon and same mind) and attack Spider-Man. He manages to defeat Deadpool's copies and claim the tablet fragment.\n\nIn the Amazing universe, Madame Web receives a fragment from Amazing Spider-Man. During the exchange, Mysterio attacks them, threatening to kill Madame Web if Spider-Man doesn't bring him the other fragments. Spider-Man finds the next fragment in a construction yard, encountering Juggernaut unknowingly grabbing the fragment while on the run from Silver Sable and the Wild Pack. Juggernaut uses the fragment's power to become stronger but the tablet's power is at odds with his Crimson Gem, leaving him vulnerable. Spider-Man defeats Juggernaut and claims the tablet fragment. In the Noir universe, Spider-Man Noir confronts Norman Osborn in a monstrous appearance through use of his fragment at a carnival. After a battle under a circus tent, Osborn is defeated and Spider-Man claims his fragment. In the 2099 universe, Spider-Man 2099 encounters Doctor Octopus, the head of Alchemax's Shadow Division, responsible for creating Hobgoblin and hiring Scorpion. Having been driven insane by it, she uses the tablet fragment to power a reactor used to wreak havoc on the world. Spider-Man shuts down the reactor and defeats her, claiming the fragment. Meanwhile in the Ultimate universe, S.H.I.E.L.D. has acquired a tablet fragment and Carnage in the Triskelion; however, they make the bonehead move of putting them together in an attempt to create new energy source. Carnage escapes, using the fragment's power to turn the S.H.I.E.L.D. agents he drained of their life into his minions. When Spider-Man arrives, the Triskelion is already under Carnage's control. Spider-Man stops Carnage with the help of reprogrammed Spider-slayers. After Carnage is defeated, Spider-Man claims his fragment.\n\nWhen all of the tablet fragments are reassembled, Mysterio uses the tablet to increase his power, effectively becoming a god and shattering all the borders separating the other realities, planning to build a new one under his sole rule. The Spider-Men, teleported to their location by Madame Web, defeat Mysterio and separate him from the tablet. As Mysterio tries to reclaim the Tablet of Order and Chaos, the Spider-Men knock him out. Madame Web then thanks them for saving all of reality. After the others return to their own dimensions and the walls between them repaired, Amazing Spider-Man takes Mysterio to jail or &quot;Super Villain Day Care&quot;.\n\nDuring the credits, Madame Web is then visited by Spider-Ham hoping to help save reality but answered Madame Web's call a bit too late as he asks &quot;So, what'd I missed?&quot;. Madame Web is left baffled by his appearance given the walls between realities are healed now.\n\n! Characters and Voice Roles\n\n! Amazing Spider-Man-Neil Patrick Harris ! Noir Spider-Man-Christopher Daniel Barnes ! 2099 Spider-Man-Daniel Gilvezan ! Ultimate Spider-Man-Josh Keaton ! Madame Web-Susanne B. ! Hammerhead-John D. ! Kraven and Goblin-John C. ! Hobgoblin and Vulture-Steven Blum ! Electro-Thomas W. ! Carnage-Fred T. ! Deadpool-Nolan N. ! Sandman-Dimigo D. ! Scorpion-John K. ! Juggernaut-Matt W. ! Silver Sable-Jennifer H. ! Doctor Octopus-Tara S. ! Mysterio-David K. ! Narrator-Stan Lee","torrent":{"xt":"urn:btih:e76a6a530236b4915e421df0a8315af9f5477cd2","amp;dn":"%5BPS3%5D+Spider-Man%3A+Shattered+Dimensions","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e76a6a530236b4915e421df0a8315af9f5477cd2","infoHashBuffer":{"type":"Buffer","data":[231,106,106,83,2,54,180,145,94,66,29,240,168,49,90,249,245,71,124,210]},"announce":[],"urlList":[]}}