{"title":"leopard_9A559_osx86scene.dmg","uid":3826192,"size":7037879926,"categoryP":"applications","categoryS":"mac","magnet":"?xt=urn:btih:e78241f15f2057dba3aefd48345f766c2fa9b251&amp;dn=leopard_9A559_osx86scene.dmg&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"KoreanHongKildong","files":1,"time":1191261575,"description":"-----------------------------------------------------\nThis is the original 9A559 dmg file, but I renamed.\n\nleopard_9a559_osx86scene.dmg(6.55GB)\nMD5 : EADB8ED5437B2A6A26C712CF50C6E115\n------------------------------------------------------\n\n\n[FavleX`s Info]\n\n\nMac OS X Leopard build 9A559 Seed Note\n\nSystem Requirements\nTo run Mac OS X Leopard, you must have a Macintosh computer with:\n- An Intel processor or a PowerPC G4 (800 MHz or faster) or G5 processor \n- A DVD drive \n- Built-in FireWire \n- At least 512 MB of RAM (additional RAM is recommended for development purposes) \n- A built-in display or a display connected to an Apple-supplied video card supported by your computer \n- At least 7 GB of disk space available, or 12 GB of disk space if you install the developer tools\n\nIf you see a message in the Mac OS X Installer stating you do not have enough disk space to install Mac OS X, you can deselect items to save space. To deselect items, click Custom Install in the Easy Install panel.\n\nImportant Installation Instructions\nThis seed cannot be installed directly from the disk image, you can either 1) burn the disk image to a double layer DVD disc (recommended method) or 2) restore the disk image to a hard disk partition to install the build on another partition. Details below.\n\nProcedure to burn bootable DVD for installation:\n\nRequirements:\n1. A DVD drive capable of burning double layer DVDs\nHere&amp;#039;s how to check to see if you have such a drive:\n- Launch &quot;Systems Profiler&quot; in the Utilities folder in the Applications folder\n- Under Hardware, click on &quot;Disc Burning&quot;\n- If you see Under &quot;DVD-Write&quot;, &quot;+R DL&quot; is listed then your machine has the ability to burn double layer DVD discs.\n2. A blank DVD+R DL media\n\nProcedure:\n1. Launch Disk Utility (found in /Applications/Utilities/)\n2. Click the Burn button in the Toolbar \n3. Navigate to and select the disk image then click the Open button\n4. Insert a blank DVD+R DL disc into your DVD burner\n5. Click the Burn button\n\nProcedure to install Leopard using hard disk partitions:\n\nRequirements:\n1. Three hard disk partitions internal or external (you could use 2 but 3 recommended)\nNOTE: For Intel Macs, your &quot;Partition Map Scheme&quot; must be &quot;GUID Partition Table&quot;. For Power PC Macs, your &quot;Partition Map Scheme&quot; must be &quot;Apple Partition Map&quot;. Check by doing this: In Disk Utility, click on the volume, click on Partition, See &quot;Partition Map Scheme&quot; listed at the bottom.\n\n2. The &quot;Leopard_Client_9A559.dmg&quot; disk image (on partition 1)\n\nBrief summary:\n1. Booted into partition 1, using Disk Utility, restore the &quot;Mac OS X\nInstaller Disk Image&quot; onto partition 2\n\n2. Boot into partition 2 and install Mac OS X on partition 3\n\nProcedure:\n1. Setup:\n- partition 1: Your current boot up volume, also containing the downloaded &quot;Leopard_Client_9A559.dmg&quot; disk image\n- partition 2: Ready for the Leopard install disk image to be restored on\n- partition 3: Ready for the Leopard OS to be installed on\n\n2. Launch Disk Utility and do the following:\n- Click on the partition 2\n- Click on the Restore tab\n- Drag the &quot;Leopard_Client_9A559.dmg&quot; onto the Source field\n- Drag partition 2 onto the Destination field (Note: partition 2 will be erased.) (Note: Drag the partition from the disk list in Disk Utility and not Finder.)\n- Click on Restore\n\n3. Boot into partition 2, you will be booted into Mac OS X installation process\n\n4. Install Mac OS X onto partition 3\n(If you have only 2 partitions, you will have to erase and install onto partition 1)\n\nKnown Issues\n- Archive installs from Tiger to Leopard sometimes will not succeed on Power PC systems if you try to preserve user settings. Please perform an upgrade install or clean install or opt out of preserving user settings to work around this. Intel systems are unaffected.\n- If you have HP printers connected to your system or are upgrading from a Tiger system with HP printers already configured, please perform a custom install and de-select the HP printer drivers in the installer. The HP printer drivers will be delivered post-install via Software Update.\n\n[ My friend`shot : http://img114.imageshack.us/img114/7366/9a559success1bkz8.jpg ]","torrent":{"xt":"urn:btih:e78241f15f2057dba3aefd48345f766c2fa9b251","amp;dn":"leopard_9A559_osx86scene.dmg","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e78241f15f2057dba3aefd48345f766c2fa9b251","infoHashBuffer":{"type":"Buffer","data":[231,130,65,241,95,32,87,219,163,174,253,72,52,95,118,108,47,169,178,81]},"announce":[],"urlList":[]}}