{"title":"dub side of the moon","uid":5784596,"size":74603726,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:e78744829e3ca942b41c216d136d77af46409d24&amp;dn=dub+side+of+the+moon&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"azitromax","files":-1,"time":1282554973,"description":"Dub Side of the Moon is a dub reggae tribute to the Pink Floyd album, The Dark Side of the Moon, co-produced by Easy Star All-Stars founder's Michael G (Michael Goldwasser) and Ticklah (Victor Axelrod) [1]. Included with the liner notes are instructions on how to synchronize the album with the 1939 film The Wizard of Oz and produce a variation of the perceived &quot;Dark Side of the Rainbow&quot; effect.\n\nOutside the standard reggae beat and instruments used on the album there are several interesting changes made:\n\n    * The climax of &quot;Speak to Me&quot; now features the coughing from &quot;Money&quot;, reggae wailing and someone making the sound of the grinding machine from the original version of the song with their lips.\n    * The final track of the original album, &quot;Eclipse,&quot; has been changed to a standard 4/4 beat to avoid the need to introduce triple-meter, a rhythm not native to reggae.\n    * The cash register opening and closing on &quot;Money&quot; is changed to a man lighting a bong, the bong being ripped, and the man coughing.\n    * A cuckoo clock is added to the clocks at the beginning of &quot;Time&quot;, as is a digital clock, a rooster, and &quot;Reveille&quot; being played on a trumpet.\n    * Several of the songs feature extensive improvisation over the instrumentals.\n\nAlso, while not a change to the album itself, the tracklisting was given four more tracks. All of these are dubs, or remixes, of tracks on the album, with &quot;Step It Pon The Rastaman Scene&quot; being the most far removed.\n\nSeed after downloading! \nComments appreciated :) ","torrent":{"xt":"urn:btih:e78744829e3ca942b41c216d136d77af46409d24","amp;dn":"dub+side+of+the+moon","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e78744829e3ca942b41c216d136d77af46409d24","infoHashBuffer":{"type":"Buffer","data":[231,135,68,130,158,60,169,66,180,28,33,109,19,109,119,175,70,64,157,36]},"announce":[],"urlList":[]}}