{"title":"Norwegian couple - stolen video (true homemade)","uid":5108494,"size":98930772,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:e9e6e74a22564606c554da7ba12f964b6ae41c5b&amp;dn=Norwegian+couple+-+stolen+video+%28true+homemade%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":3,"uploader":"pure_screens","files":1,"time":1254577664,"description":"Norwegian couple stolen video (true homemade)\n\n\n\nscreenshots: &lt;a href=&quot;\nhttp://www.cmylink.com/Norwegiancouplestolenvideo&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.cmylink.com/Norwegiancouplestolenvideo&lt;/a&gt;\n\n\n\n\nStarring:\nLinni Meister (Norwegian glam model), together with Kristian Hilberg (Big Brother). \n\n\nAs quoted:\n\n&quot;A friend of mine on another board went on vacation somewhere and found this video in his hotel room. So he ripped it from the tape to an AVI.&quot;\n\nThe woman is this video is pretty damn hot! What got me was the fact that she literally throws this guy over and rides him at a constant pace for quite a while until he cums inside her. She obviously knows what she's doing!\n\nI think you guys/gals will dig this one. One thing I HATE about current mainstream porn is the constant changing of angles. Just when you...err...get going to something hot, they switch to the guys sweaty face or something. In this clip she rides him at a pretty good pace without stopping for a solid couple minutes. Makes for a pretty good view...\n\nActs Included:\nhandjob, vaginal, internal cumshot \n\n\n\nSome more information/rumors: They are both speaking Norwegian, more specific Eastside accent. There is (Dutch) TV playing in the background, which is quite annoying for some. The girl, whose name is apparently Linni Meister, seems to have a blog: http://linni.blogg.no/\n\nThe &quot;stolen&quot; video apparently made some noise in Norway:\nhttp://pub.tv2.no/nettavisen/side2/kjendis/article617984.ece\nQuote: &quot;This is a shock for us, it was a private movie, that got stolen from us&quot;, says the two participants, both very distressed by the video being public available.\n\nThe girl is a Norwegian glamour-model and the guy was a contestant from the Norwegain/Swedish Big Brother 2006.\n\nLinni got kicked out of Team Aylar (a bunch of glamour-models) for this video-clip btw.\n\nThe true story about this clip is that the guy on the tape is a guy that has been in Big Brother Sweden/Norway this year. What ive heard is that he and the Norwegean police have done everything so this movie wouldnt leak out!\n\nwww.bigbrother.se (see for urself his name is Kristian!)\n\nThe latest today, is that these two &quot;blond-heads&quot; have made a deal with a porn producer in Norway to include this clip in his newest movie &quot;Busted&quot;, It seems that their are going to star in a few new scenes in this movie, but if that happens, I am sure they are going to be found here with not much delay lol...\n\nThis video was not supposed to hit the internet, at least they say so. \nBoth had legal contracts saying they are not allowed to appear naked in media or film, so that would be quite stupid...  \nThe fact that she got kicked out of team-Aylar is also quite ironic, since the founder of team-Aylar, Aylar Lie, also has a sex video floating around the internet.\nOn 09.09.2009, the girl became a mother. \n\nFrom the original uploader erikbobbo. \n\n\n\nVideo Info:\n\nFile Size : 94.3 Mb.\n\n[Movie]\nValid : Yes [AVI]\nDuration : 00:12:36\nMovie complete : Yes\n\n\n[Video]\nResolution : 704x528\nCodec : DivX 5.x codec\nFPS : 25.00\nBitRate : 790 Kbps\nQuality Factor : 0.09 b/px\n\n\n[Audio]\nCodec : ATSC/A-52 Dolby AC3\nNumber of channels : 2\nSample Rate : 48000 Hz\nBitRate : 256 Kbps\n\n\n","torrent":{"xt":"urn:btih:e9e6e74a22564606c554da7ba12f964b6ae41c5b","amp;dn":"Norwegian+couple+-+stolen+video+%28true+homemade%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e9e6e74a22564606c554da7ba12f964b6ae41c5b","infoHashBuffer":{"type":"Buffer","data":[233,230,231,74,34,86,70,6,197,84,218,123,161,47,150,75,106,228,28,91]},"announce":[],"urlList":[]}}