{"title":"Daryl.Hall.Live.from.Daryl's.House.Part.21.WebRip.[PSoul]","uid":5007124,"size":268101543,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:ea5bccffd628c95e97f3ccc569b511cd6f5e655a&amp;dn=Daryl.Hall.Live.from.Daryl%5C%27s.House.Part.21.WebRip.%5BPSoul%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":4,"uploader":"PhillySoul","files":8,"time":1247782865,"description":"Live from Daryl's House Episode 21 (WebRip)\n\nDaryl Hall counts &quot;1, 2, 3, 4&quot; as Chicago band Plain White T's visit Live From Daryl's House for July webcast.\n\n21st and latest edition of acclaimed web show features Daryl and Grammy-nominated Hollywood Records group\n\nNEW YORK, July 10, 2009. For the 21st, and newest, installment of his critically acclaimed online series Live From Daryl's House, Daryl Hall's guests are Hollywood Records Chicago-based pop-rock group Plain White T's, who earned both a 2008 Grammy nomination for Song of The Year as well as Best Pop Performance by a Group (for the hit single, &quot;Hey There Delilah&quot;) and an mtvU Woodie as Best Emerging Artist in 2006.\n\nThis brand-new installment debuts July 15 exclusively at www.livefromdarylshouse.com, where it can be seen along with archived footage of past episodes.\n\nPlain White T's recently wrapped up a headlining tour in support of their new album Big Bad World and the platinum selling hit single, &quot;1, 2, 3, 4,&quot;. The track's much-seen video has been featured on VH1's Top 20 Video Countdown and earned a spot in heavy rotation at MTV, Fuse, MTV Hits and mtvU. The group recently performed the song on Late Night with Jimmy Fallon. The tour, dubbed &quot;Three Part Harmony: A Show in Three Acts,&quot; has the quintet delivering a show in three acts, one apiece devoted to rock, acoustic and a medley of fan favorites. Fall tour dates will be announced shortly.\n\nBefore kicking off the second leg of the tour, lead singer Tom Higgenson and bassist Mike Retondo visited Daryl Hall's New York home to jam with the legendary singer/songwriter on a set that included their own hits &quot;1, 2, 3, 4&quot; and &quot;Hey There Delilah,&quot; Daryl Hall's &quot;So Close&quot; and a soulful cover of Junior Walker's &quot;Shotgun.&quot;.\n\nSaid Higgenson: &quot;We had an awesome time with Daryl and the band. It was a great experience and we really enjoyed playing with such a legendary artist and musicians.&quot;","torrent":{"xt":"urn:btih:ea5bccffd628c95e97f3ccc569b511cd6f5e655a","amp;dn":"Daryl.Hall.Live.from.Daryl%5C%27s.House.Part.21.WebRip.%5BPSoul%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ea5bccffd628c95e97f3ccc569b511cd6f5e655a","infoHashBuffer":{"type":"Buffer","data":[234,91,204,255,214,40,201,94,151,243,204,197,105,181,17,205,111,94,101,90]},"announce":[],"urlList":[]}}