{"title":"DAYLIGHT ROBBERY (2008) XviD PRO DVDRiP","uid":4350226,"size":1185195303,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:ec8db3f82e378bcdd611cc832e1f2ff2cfea40be&amp;dn=DAYLIGHT+ROBBERY+%282008%29+XviD+PRO+DVDRiP&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"circlensess","files":2,"time":1219105529,"description":"DAYLIGHT ROBBERY (2008)\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0893401/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0893401/&lt;/a&gt;\n\nUsing the World Cup as their cover a group of England football supporters pull off the perfect crime, stealing millions of pounds from a London Exchange bank.\n\nThe Best British Heist Movie since The Italian Job\n\n\nWith an ensemble of British actors, and a script that will leave any self respecting movie buff wanting more, debut feature film Director/Screenwriter (Paris Leonti) delivers a thrilling new take on the Heist genre.\n\nAlex (Geoff Bell, The Business) masterminds an ambitious plan to steal millions of untraceable cash that is stacked in the underground vaults of The London Exchange Bank, waiting for its last journey, Incineration.\n\nLucky (Vas Blackwood, Lock Stock) Matty (Leo Gregory, Stoned) Terry (Johnny Harris, London to Brighton) Chubby (Paul Nicholls, The Trench) Norman (Justin Salinger, Hitler) and Jay (Robert Boulter, The Long Firm) make up his unlikely gang of robbers.\n\nSetting up their alibi, the gang check in for a flight and join in with thousands of England supporters that are part of a mass exodus to The World Cup Tournament in Germany.\n\nInstead of passing through to Departure Lounge, the gang head out to the car park, pile into a van and head for Central London where they spectacularly ram raid London Exchange Bank, blocking any exit for those caught up inside.\n\nBut with an unexpected turn of events, their plan is hampered from the start and they are left with a whole lot more than just a bank robbery to deal with.\n\nThey have twenty hostages inside and the Police have laid siege to The Bank. There are two and a half hours before their plane leaves, and seventy million pounds in hard cash to steal.\n\nA daunting task, even for the most seasoned Blagger!\n\nthis is a crackin british film i watched it last night and really enjoyed it","torrent":{"xt":"urn:btih:ec8db3f82e378bcdd611cc832e1f2ff2cfea40be","amp;dn":"DAYLIGHT+ROBBERY+%282008%29+XviD+PRO+DVDRiP","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ec8db3f82e378bcdd611cc832e1f2ff2cfea40be","infoHashBuffer":{"type":"Buffer","data":[236,141,179,248,46,55,139,205,214,17,204,131,46,31,47,242,207,234,64,190]},"announce":[],"urlList":[]}}