{"title":"Knocked.Up.UNRATED.PROPER.DVDR-Replica","uid":3861779,"size":4690461456,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:ed9dd153145301801345fac6d0532666374202f6&amp;dn=Knocked.Up.UNRATED.PROPER.DVDR-Replica&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"3riverscanoes","files":96,"time":1193531107,"description":"DVDR  Replica 4.36G\n\nKnocked Up is a 2007 American comedy film written and directed by Judd Apatow. It stars Seth Rogen, Katherine Heigl, Paul Rudd and Leslie Mann. It is rated R.\n\nBen Stone (Seth Rogen) is a 23-year-old Jewish slacker, whereas slightly older Alison Scott (Katherine Heigl) is responsible and career-minded. One night, Alison and Ben meet at a club and end up having sex. Due to a misunderstanding they do not use contraception: Alison uses the phrase \\\\\\&quot;just do it\\\\\\&quot; to encourage Ben to put the condom on faster, which Ben misinterprets as \\\\\\&quot;a condom is not needed\\\\\\&quot;. When the alcohol wears off, they quickly learn they have little in common. Eight weeks later, however, Alison discovers that she is pregnant and contacts Ben, who says he will be there to support Alison having the baby. The odd couple\\\\\\&amp;#039;s efforts to develop a relationship include a marriage proposal from Ben.\n\nAfter considerable success, tensions surface in the relationship. Alison is increasingly anxious over both Ben\\\\\\&amp;#039;s lack of responsibility and from watching her sister\\\\\\&amp;#039;s failing marriage, and Ben feels that Alison is overly controlling, as a result of which the couple separates. Ben and Alison\\\\\\&amp;#039;s sister\\\\\\&amp;#039;s estranged husband Pete then take a road-trip to Las Vegas. Under the influence of drugs they realize their loss and decide to return and take responsibility. Ben goes to great effort to change his ways including getting a job and an apartment with a baby\\\\\\&amp;#039;s room. Subsequently, Alison goes into labor and is not able to contact her doctor but contacts Ben who takes her to the hospital. The two reconcile and welcome the birth of a daughter, (a son in the alternate ending) and settle down happily together.\n\n","torrent":{"xt":"urn:btih:ed9dd153145301801345fac6d0532666374202f6","amp;dn":"Knocked.Up.UNRATED.PROPER.DVDR-Replica","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ed9dd153145301801345fac6d0532666374202f6","infoHashBuffer":{"type":"Buffer","data":[237,157,209,83,20,83,1,128,19,69,250,198,208,83,38,102,55,66,2,246]},"announce":[],"urlList":[]}}