{"title":"Tag2-Saal1-Slot21 45--ID2980-the_infinite_library-Main-2008-12-2","uid":4607759,"size":872871084,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:eda1389c1ddaa86b7c953f73a01a4ae2f0e6c31a&amp;dn=Tag2-Saal1-Slot21+45--ID2980-the_infinite_library-Main-2008-12-2&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"25ccc","files":2,"time":1230528889,"description":" &lt;a href=&quot;http://events.ccc.de/congress/2008/Fahrplan/events/2980.en.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://events.ccc.de/congress/2008/Fahrplan/events/2980.en.html&lt;/a&gt;\n\nThe Infinite Library\n\nStorage and Access of Pornographic Information\n\nDecades ago, Jorge Luis Borges wrote about infinite libraries and perfect memory with the slightly sad air of someone who'd seen those things and knew their faults. Today we work toward infinite libraries and perfect memory with little heed for the possible consequences. How could it be bad to have everything possible stored? To remember everything? I don't know that it will be bad, but I do know that it will be different from our current lives of loss and forgetting. Right now, storing pornography causes problems even for people who have nothing especially perverted to hide: A collection of pornography gets to the heart of what it means to be a private individual. As we move from mass media to individually produced media, from edited collections of porn (magazines, commercially produced films) to individual snapshots and youtube clips and stored bittorrents, the particularity of a collection of porn will be testimony to its owner's private set of tastes.\n\nOf course, it has always been a pain to store pornography -- and so we have the cultural trope of a stash of magazines &quot;under the mattress&quot; or in a box hidden in the closet. But as the sex industry shifts toward digital publication at every level, we might imagine that mere storage will become a problem of the past, or, at least, a problem related to legacy materials (books, magazines, videos, comic books, photographs, etc.). Cheap, massive storage media means no more problem, right?\n\nWell, reviewers of porn find that they quickly amass more material than they will ever have time to peruse; librarians who need to provide access to controversial and poorly cataloged material end up overwhelmed; even casual collectors of pornography still need some way to keep track of what they have.\n\nToward that end, I am doing preliminary research on how people store and access their digital pornography collections. In my early interviews, I have already encountered a fascinating mix of responses; one person has said they store their porn &quot;in the cloud,&quot; while another explained his detailed system for hiding digital porn files from his partner.\n\nAs I close, I will spend some time considering how we will store the pornography that isn't even being created yet. If science fiction author Charlie Stross is right, before long we will all be&quot;life-logging&quot; -- recording everything that happens to us, which of course would include all our sexual experiences. I think we might also one day be able to indulge in fully immersive AI-driven pornographic experiences (such as texting back-and-forth with artificially intelligent SMS-bots, sending texts and photos and audio to a perfectly responding far-away &quot;partner&quot;), and we'll also want some way to keep those experiences.\n\nWe'll have everything stored -- but what will the social consequences be? If it is trivially easy to amass a porn stash so large that it cannot be &quot;consumed&quot; in one person's lifetime, should a person with a large collection of pornography be considered a pervert? (Hint: I don't think so.) If everyone has so much porn, perhaps we have nothing to hide!\n","torrent":{"xt":"urn:btih:eda1389c1ddaa86b7c953f73a01a4ae2f0e6c31a","amp;dn":"Tag2-Saal1-Slot21+45--ID2980-the_infinite_library-Main-2008-12-2","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"eda1389c1ddaa86b7c953f73a01a4ae2f0e6c31a","infoHashBuffer":{"type":"Buffer","data":[237,161,56,156,29,218,168,107,124,149,63,115,160,26,74,226,240,230,195,26]},"announce":[],"urlList":[]}}