{"title":"Lord De Tracy - The X In SeX 006 BPM.Fm.mp3","uid":4829968,"size":57359185,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:edc9afb24bddd51eb84a0f949174aaeaac6dc53f&amp;dn=Lord+De+Tracy+-+The+X+In+SeX+006+BPM.Fm.mp3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"TrainWreckAudio","files":1,"time":1239094370,"description":"Myspace:\nTrainWreckAudio: http://trainwreckaudio.podomatic.com\n\nSir William de Tracy, Knt., (died c1189) was Lord of the Manor of Toddington, Gloucestershire, feudal Baron of Bradninch, near Exeter, and Lord of Moretonhampstead, Devon. He is notorious as one of the four knights who assassinated the Archbishop of Canterbury Thomas Beckett in December 1170.\n\nNow his direct decedent (DJ/VJ) Lord De Tracy is taking the music scene by storm, from playing his unique styles of vocal bouncy Dance, rhythmic Trance, lost in your mind PsyTrance, and finally with a touch of heart-pounding HardStyle and tantalizing Electro, all the way to mixing up your mind with massive screen visuals. Lord De Tracy is one of most sought after VJs in Utah, while rapidly gaining rep as a DJ. DJ record includes: Chris's Birthday Bash, Showbis 1, 2, 3, and 4 (only dj to appear on all 4), Evolution 3D, FireSLC: DJ Sammy, Seduction Saturdays @ Club Sound, Slush Mag Party @ The Circle Lounge, Kemistry: TranceNation, and Wensdays @ The Manhattan Club. VJ record includes mixing up the visuals at many Utah Events featuring djs: Global Deejays, Spacegirl, CKY, DJ Irene, Ill-esha, KXD, Diggabeats. Events would include: Pioneer Daze, Sequence 7.7.7, Tranceformers, Party Revolution, MAD, Evolution, FireSLC(Big Event, Darude), Pirates, and many other numerious shows and afterparties!\n\nLord De Tracy was a Resident DJ on the evergrowing popular www.BPM.Fm Radio Station for nearly a year. You could hear his show weekly on Sundays 3pm-5pm MST. After releasing 25 episodes of The X In SeX and doing other numerous side shows on BPM.fm, Lord De Tracy decided it was time to expand, and move on. He recently has picked up a weekly show on Http://www.djsinthemix.net every Monday at 9pm MST.\t\t\t","torrent":{"xt":"urn:btih:edc9afb24bddd51eb84a0f949174aaeaac6dc53f","amp;dn":"Lord+De+Tracy+-+The+X+In+SeX+006+BPM.Fm.mp3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"edc9afb24bddd51eb84a0f949174aaeaac6dc53f","infoHashBuffer":{"type":"Buffer","data":[237,201,175,178,75,221,213,30,184,74,15,148,145,116,170,234,172,109,197,63]},"announce":[],"urlList":[]}}