{"title":"The Fresh &amp; Onlys - House of Spirits (2014) [MP3 320]","uid":10251535,"size":101041270,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:ef2d2fecb6b8356895d918fb13a181dd27a30e4a&amp;dn=The+Fresh+%26amp%3B+Onlys+-+House+of+Spirits+%282014%29+%5BMP3+320%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"santicaz","files":11,"time":1401356673,"description":"Artist: The Fresh &amp; Onlys\nTitle Of Album: House of Spirits \nYear Of Release: 2014\nLabel: Kemado Records \nGenre: Indie Rock, Psychedelic Rock\nQuality: Mp3\nBitrate: 320 kbps\nTotal Time: 39:27 Min\nTotal Size: 96 Mb\n\nTracklist:\n\n1. Home Is Where? (3:52)\n2. Who Let the Devil (3:55)\n3. Bells of Paonia (4:24)\n4. Animal of One (4:04)\n5. I'm Awake (3:48)\n6. Hummingbird (3:20)\n7. April Fools (3:32)\n8. Ballerina (4:40)\n9. Candy (4:33)\n10. Madness (3:14)\n\nFollowing a plethora of EPs and singles released since their formation in San Francisco in 2008, this is the second full-length album to be issued on Brooklyn's Mexican Summer by the Fresh &amp; Onlys. House of Spirits betrays Tim Cohen's love of melodic guitar music, from '60s psychedelia to '80s jangle pop, and was recorded on an Arizona horse ranch. The hazy production values common to their back catalog are evident on the album's lead single, &quot;Bells of Paonia.&quot;\n\nThe Fresh &amp; Onlys started out as a collaboration between frontman Tim Cohen (Black Fiction) and bassist Shayde Sartin, who started putting songs together in 2004. The Fresh &amp; Onlys' lineup eventually expanded to include Kyle Gibson, Wymond Miles, and Heidi Alexander (who soon left the band); drawing from a hodge-podge of influences (among them Buzzcocks, the Mekons, and Country Joe MacDonald), the new lineup arrived at a grimy-yet-sunny pop sound along the lines of Saturday Looks Good to Me and Welcome. Over the next four years, the Fresh &amp; Onlys self-released a couple of recordings (Medicine Island, Imaginary Friends), put out a self-titled full-length album on John Dwyer's Castle Face label in 2009, and released a 7&quot; single, &quot;I'll Tell You Everything,&quot; on Dirty Knobby Industries. The band's second full-length album, Grey-Eyed Girls, was released on Woodsist in the fall of 2009. It was followed by a flood of recordings in 2010. An EP for Captured Tracks (August on My Mind), a handful of singles for various labels, and finally their third album, Play It Strange, which was released in October by In the Red. The group began 2011's output with an EP in April called Secret Walls, released on the Sacred Bones label. Also that year, Cohen released an album (Ruler of the Night) on Hardly Art with his other band Magic Trick, and Miles released a solo album (Under the Pale Moon) for Sacred Bones. The group came back in August of 2012 with their fourth album, and first for Mexican Summer, Long Slow Dance. In comparison to their previous output, it was a slickly produced affair that put Cohen's vocals at the forefront of the mix. Their 2013-released Soothsayer EP gave the band an opportunity to experiment outside of the confines of the album template, and House of Spirits, a fifth full-length, was expected in summer 2014.","torrent":{"xt":"urn:btih:ef2d2fecb6b8356895d918fb13a181dd27a30e4a","amp;dn":"The+Fresh+%26amp%3B+Onlys+-+House+of+Spirits+%282014%29+%5BMP3+320%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ef2d2fecb6b8356895d918fb13a181dd27a30e4a","infoHashBuffer":{"type":"Buffer","data":[239,45,47,236,182,184,53,104,149,217,24,251,19,161,129,221,39,163,14,74]},"announce":[],"urlList":[]}}