{"title":"Alex Jones Show - 2012 July 03 TU [sebaygo1]","uid":7410193,"size":67257756,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:efcec26da61b00da9d999bc3e394b96b48d06b0f&amp;dn=Alex+Jones+Show+-+2012+July+03+TU+%5Bsebaygo1%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"sebaygo1","files":10,"time":1341358050,"description":".\n\t\t\t\t\t\t\t\nThe Alex Jones Show\nTuesday, 03 July 2012\n\n\n[sebaygo1]\n\n\nShow Description\n................\n\nFrom the Infowars web site ::\n\nOn this Tuesday, July 3 edition of the Alex Jones Show, Alex talks with Rep. Marsha Blackburn of Tennessee about H.R. 3608, the Stop TSA's Reach In Policy (STRIP) Act, which would prohibit any TSA employee not trained as a federal law enforcement officer or eligible for federal law enforcement benefits from wearing law enforcement uniforms or wearing a police-like metal badge. She will also talk about her report detailing the startling criminality of TSA employees. \n\nAlex also talks with Rosa Koire, a forensic commercial real estate appraiser specializing in eminent domain valuation and an outspoken activist opposed to the United Nations' Agenda 21 and its attempts to attack civilization through so-called Sustainable Development. She is the author of Behind The Green Mask: U.N. Agenda 21, available at the Infowars Store. \n\nAlex also confronts the latest news, including Obamacare developments and ongoing war preparations in the Middle East.\n\n\n\n\n\n#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#\nNot able to find a torrent of mine where or when you \nexpected it?\nCheck out my torrents blog for info about what I am\nuploading, tracker problems, etc..\n\nSome sites will not allow a blogspot URL in an \nuploaded torrent's description, so I have included \nthe blog's web address in a file included with this\ntorrent named:\nsebaygo1_TorrentsAndBlogInfo_ver2.pdf\n#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#\n\n\n\n_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/\n \n It is my opinion that in this time it is virtually essential \n to seek information from a variety of sources, to listen to a\n spectrum of voices in order to better  understand the &quot;big \n picture.&quot; A reliance solely upon mainstream corporate media \n for news and info is a prescription for ignorance. I try to\n share information that counters the monotone of mainstream\n corporate media. \n\n NOTE: The material here is made available strictly as\n information. Do not assume my support for or endorsement \n of the contents.\n\n Think for yourself! To paraphrase the late William Cooper: \n Read everything, listen to everything, but believe nothing \n until you've researched it yourself.\n \n !! please try some of the other shows I upload too !! \n\n_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/\n..........\n\nfolder.jpg courtesy of commenter &quot;Nighted&quot; at the sebaygo1 blog\n..........\n","torrent":{"xt":"urn:btih:efcec26da61b00da9d999bc3e394b96b48d06b0f","amp;dn":"Alex+Jones+Show+-+2012+July+03+TU+%5Bsebaygo1%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"efcec26da61b00da9d999bc3e394b96b48d06b0f","infoHashBuffer":{"type":"Buffer","data":[239,206,194,109,166,27,0,218,157,153,155,195,227,148,185,107,72,208,107,15]},"announce":[],"urlList":[]}}