{"title":"Eminem - Relapse [2009][CD+2 SkidVid_XviD+Cov]320Kbps","uid":4905234,"size":368020834,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:eff702a009762b078a6ec96f33486f24b0b77680&amp;dn=Eminem+-+Relapse+%5B2009%5D%5BCD%2B2+SkidVid_XviD%2BCov%5D320Kbps&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"TOTTITORKY","files":26,"time":1242854711,"description":"EMINEM - RELAPSE, album released internationally between May 15th/May 29th 2009.\nEncoded 320Kbps CBR [Lame] mp3. Covers included.\n\nWARNING: THIS ALBUM INCLUDES EXPLICIT LYRICS.\n\n\n\nMarshall Bruce Mathers III [born October 17th 1972 in St. Joseph, Missouri], known by his primary stage name Eminem, or by his alter ego Slim Shady, is an American rapper, record producer and actor. Eminem quickly gained popularity in 1999 with his major-label debut album 'The Slim Shady LP', which won a Grammy Award for Best Rap Album. The following album, 'The Marshall Mathers LP', became the fastest-selling hip hop album in history. It brought Eminem increased popularity, including his own record label, Shady Records, and brought his group project D12 into mainstream recognition. The 'Marshall Mathers LP' and his third album, 'The Eminem Show', also won Grammy Awards, and in 2002, he won the Academy Award for Best Original Song for a song in the film 8 Mile, in which he also played the lead. Eminem developed into one of the most popular rappers of all time, then went on hiatus after touring in 2005. Since 2005, Eminem had intended to take a break from recording his own music in order to become a hip hop producer for other rap acts, especially for the artists signed on his own label Shady Records. Such a break came when Eminem cancelled the European leg of the Anger Management Tour in the summer of 2005 due to exhaustion and an addiction to sleeping pills. In the following year, the rapper's remarriage to his former wife Kimberly Scott lasted only eleven weeks before a second divorce, while his closest friend and fellow rapper DeShaun &quot;Proof&quot; Holton was later shot and killed during an altercation outside a nightclub in Detroit. Devastated by this, Eminem relapsed into prescription drugs and became increasingly reclusive from the outside world, as he would rarely leave his house nor appear in public.\n\n'Relapse' is the sixth studio album by American rapper Eminem. It was released by record label Interscope Records, along with subsidiaries Aftermath Entertainment and Shady Records, first on May 15th 2009, followed by May 19th in the United States. Relapse is Eminem's first studio album since 'Encore' in 2004, thus ending the rapper's musical hiatus. Relapse is produced entirely by Dr. Dre, except for one song Eminem produced himself. According to Eminem, to work with Dr. Dre allowed him to concentrate on the processes of songwriting rather than the production, which was taken care of by Dre himself.\n\nTracks:\n01  Dr. West\n02  3 a.m.\n03  My Mom\n04  Insane\n05  Bagpipes From Baghdad\n06  Hello\n07  Tonya [Skit]\n08  Same Song And Dance\n09  We Made You\n10  Medicine Ball\n11  Paul [Skit]\n12  Stay Wide Awake\n13  Old Times Sake [Feat. Dr. Dre]\n14  Must Be The Ganja\n15  Mr. Mathers\n16  Deja Vu\n17  Beautiful\n18  Crack A Bottle [Feat. Dr. Dre And 50 Cent]\n19  Steve Berman [Skit]\n20  Underground\n\nTHE VIDEOS [XviD SkidVid] \nRipped from disc, edited, no logos and encoded 1000x540 and 1000x578 XviD respectively. \n\nEminem - 3 A.M. [2009]\nEminem - We Made You [2009]\n","torrent":{"xt":"urn:btih:eff702a009762b078a6ec96f33486f24b0b77680","amp;dn":"Eminem+-+Relapse+%5B2009%5D%5BCD%2B2+SkidVid_XviD%2BCov%5D320Kbps","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"eff702a009762b078a6ec96f33486f24b0b77680","infoHashBuffer":{"type":"Buffer","data":[239,247,2,160,9,118,43,7,138,110,201,111,51,72,111,36,176,183,118,128]},"announce":[],"urlList":[]}}