{"title":"CinePaint MEGA torrent","uid":4345616,"size":52317973,"categoryP":"applications","categoryS":"other_os","magnet":"?xt=urn:btih:f26803bc45d272e5686aaa34b3777663620d4fd1&amp;dn=CinePaint+MEGA+torrent&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"psiborg999","files":7,"time":1218850684,"description":"About CinePaint\n\nCinePaint is a deep paint image retouching tool that supports higher color fidelity than ordinary painting tools.\n\nCinePaint is used to retouch feature films and in pro photography. CinePaint opens high fidelity image file formats such as DPX, 16-bit TIFF, and OpenEXR, and conventional formats like JPEG and PNG. It has a flipbook for movie playback of image sequences in RAM. It supports 8-bit, 16-bit and 32-bit color channels, HDR and CMS.\n\nCinePaint is used for motion picture frame-by-frame retouching, dirt removal, wire rig removal, render repair, background plates, and painting 3D model textures. It's been used on many feature films, including The Last Samurai where it was used to add flying arrows.\n\nFor still photography, CinePaint can import bracketed HDR exposures. It has gallery-quality 16-bit per channel color printing with GutenPrint. CinePaint's high dynamic range is crucial with B&amp;W still photography, where images only have a single channel.\nStudio Users\n\nStudios such as Sony Pictures Imageworks and many smaller studios use CinePaint. Disney, DreamWorks, and Pixar funded Crossover (Wine) to make Adobe Photoshop for Windows run nicely on Linux and that's what they use. Some studios use proprietary or internally developed tools. CinePaint is open source software. Nobody is obligated to tell us they use it. Studios use many Linux motion picture applications, not just CinePaint. This list of studios using CinePaint is just some we know about.\n\n\n\nWhat's Special about CinePaint?\n\nCinePaint is fundamentally different from other painting tools because it handles high fidelity image formats such as Kodak Cineon, SMPTE DPX, and ILM-NVIDIA OpenEXR. To do that properly requires a 32-bit per channel color engine core so that data isn't crushed into 8-bit color channels. The CinePaint core is 8-bit, 16-bit, and 32-bit as needed. It's different from GraphicsMagick which also supports different color depths but only as a compile-time switch. (GraphicsMagick has better support for film industry file formats than ImageMagick.)\n\nAs with audio editing, more bits is better. That is, provided you understand how to use them. If you can't hear the difference between transistor radio and a studio sound mixer, you may not be able see the difference between CinePaint and ordinary 8-bit paint tools either. If you're a filmmaker or professional photographer then CinePaint may be your best and only choice. Although conventional monitors are limited to 8-bit, output to motion picture film, digital cinema, gallery quality prints, or lithography is capable of significantly better.\n\n\nSo Why Not GIMP?\n\nWe get this question a lot. Because CinePaint handles 8-bit images in common image formats such as JPEG, TIFF, and PNG, that makes CinePaint an alternative to ordinary image editing tools. However, CinePaint has fundamentally different design goals from projects like GIMP. We have the interest, expertise, experience, professionalism, and pro users needed when developing successful software for the high-end.\n\nEver since CinePaint launched as a public project on SourceForge on July 4th, 2002, there's been quite a bit of hostility towards us from GIMP hackers. There seems to be a misconception that we're competitors. In our primary market, the film industry, our position is #2 and Adobe Photoshop is #1. GIMP is practically useless for filmmaking since it can't handle CIN, DPX or EXR files.\n\nGIMP has pursued an architectural overhaul called GEGL that's a very different design from Glasgow. They've been at it since 2000. Glasgow began in 2004.\nIs CinePaint a Video Editor?\n\nCinePaint is a deep paint tool that's used for retouching movies, not a movie editor like Avid or Final Cut Pro. Avid Composer, Apple Final Cut Pro, Apple Motion, Adobe After Effects and Apple Shake are all great tools when matched to the task at hand. Our plan for CinePaint includes more features in that direction, but we're far from that now. Nobody should be asking whether CinePaint, or for that matter any other open source project, is about to equal popular movie editing tools. At best the answer is, &quot;not soon&quot;. Other Linux studio software.\n\n\nThis is a GREAT piece of Image Editing Software, I've included the Files for IntelMAC, Linux, and Win32......\n\nENJOY!\n\n-UncleMonkey777\n","torrent":{"xt":"urn:btih:f26803bc45d272e5686aaa34b3777663620d4fd1","amp;dn":"CinePaint+MEGA+torrent","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f26803bc45d272e5686aaa34b3777663620d4fd1","infoHashBuffer":{"type":"Buffer","data":[242,104,3,188,69,210,114,229,104,106,170,52,179,119,118,99,98,13,79,209]},"announce":[],"urlList":[]}}