{"title":"These Monsters - Call Me Dragon [MP3] + Video [FLV]","uid":5963539,"size":127252444,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:f455b7aedc9b2217b2f9cb8d9d321b64a4521562&amp;dn=These+Monsters+-+Call+Me+Dragon+%5BMP3%5D+%2B+Video+%5BFLV%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"cpt.lc","files":-1,"time":1290031731,"description":"The long awaited debut album from These Monsters 'Call Me Dragon' is out now in the UK and 10th May throughout Europe. Recorded at Foel Studios, Wales with Chris Fielding (Electric Wizard, The Klaxons, Napalm Death) the album demonstrates the freaked out, riff driven prog-force that the respected four-piece have become.\n\nWith their love of large vintage amplifiers, big drums and high energy, passionate performances, These Monsters deliver a huge live sound and are developing a reputation as one of the loudest and most exciting underground bands in the UK. Characterised by a juggernaut of energy, aggression and vaulting creative ambition, a continually evolving musical and artistic development has led the band from experimental and expansive post-rock through to the modern metallic prog of the debut album and now in 2010 to brutally heavy punk rock.\n\n\n\nTracks:\n1 - Call Me Dragon 4:43\n2 - Dirty Messages 8:05\n3 - Who Is This Tall Sick Man 5:20\n4 - Biggie and Tupac 1:04\n5 - Harry Patton 6:08\n6 - Space Ritual 6:32\n7 - Deaf Machine 6:39\n\nVideo: Call Me Dragon (flv, 1200 kbps)\n\n\nBand:\nJonny Farrell - synth\nTommy Davidson - drums\nIan Thirkill - bass\nSam Pryor - guitar / vocal\n\n\n\n&quot;Creating frequently cacophonous and consistently transfixing songs, they rock like proper nutjobs in a manner that's wilfully experimental but never pretentious. Their growing reputation for putting on one hell of a live show is richly deserved.&quot; \n- Rock Sound Magazine \n\n&quot;An entity of unmatchable interest These Monsters deliver where not many artists of this ilk can, and the fire they breath is sure to burn a beautifully sordid image into your musical landscape.&quot; \n- Drowned in Sound \n\n&quot;'Call Me Dragon' is an interestingly dark affair, with hefty riffs, powerhouse drumming and an all round cohesiveness that many modern prog and psych influenced bands fall short of.&quot; \n- Contact Music \n\n&quot;These Monsters have a very distinct contemporary sound whilst flourishing in classic influences.&quot; \n- Collective-Zine \n\n&quot;If you're a noise fan this lot will certainly float your boat assuming they don't sink the thing with their awesome racket!&quot; \n- Artrocker Magazine \n\n&quot;This is very much avant-rock done absolutely right and that makes These Monsters the most fearsome of foursomes.&quot; \n- The Fly Magazine \n\n&quot;Off the wall weirdness from Yorkshire. Occasionally maddening, sometimes thrilling, but always interesting.&quot; \n- Kerrang! Magazine \n\n&quot;It's a mix of the abrasive and the accessible, an auspicious start to say the least.&quot; \n- Rock-A-Rolla Magazine \n\n&quot;Call Me Dragon is heavy, intense and brooding, filled with layers and technically very impressive. Highly recommended.&quot; \n- Room Thirteen \n\n&quot;THESE MONSTERS are at the luxurious end of extraordinary.&quot; \n- Whisperin and Hollerin \n\n&quot;like the blissful feeling of being released from life by the painful but blessed kiss of a sharp, sharp knife. It is wonderful to experience.&quot; \n- Subba-Cultcha \n\n&quot;a sharp shot of rampant energy in the form of These Monsters. On local hit label de jour 'Brew' they are sweaty, phenomenally loud and utterly uncontrollable.&quot; \n- Clash Music \n\n\n\nBand Homepage: http://thesemonsters.com/\nMyspace: .../thesemonsters\nFacebook: .../TheseMonsters\nYoutube: http://www.youtube.com/user/youvbeenframed\n\n\n","torrent":{"xt":"urn:btih:f455b7aedc9b2217b2f9cb8d9d321b64a4521562","amp;dn":"These+Monsters+-+Call+Me+Dragon+%5BMP3%5D+%2B+Video+%5BFLV%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f455b7aedc9b2217b2f9cb8d9d321b64a4521562","infoHashBuffer":{"type":"Buffer","data":[244,85,183,174,220,155,34,23,178,249,203,141,157,50,27,100,164,82,21,98]},"announce":[],"urlList":[]}}