{"title":"Bloodsport : ECW's Most Violent Matches (2005) disc 2","uid":4764179,"size":1119445208,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:f58928a33558ce2f52fecb24a3f6a39555bec5ff&amp;dn=Bloodsport+%3A+ECW%5C%27s+Most+Violent+Matches+%282005%29+disc+2&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"cesarth","files":4,"time":1236805142,"description":"Bloodsport : ECW's Most Violent Matches (2005) Disc 2\n\n\nSabu Vs. Terry Funk (Barbed Wire Match/ECW Title) - A match so violent, even Paul Heyman didn't want to see another! \n\nBeulah McGillicutty Vs. Bill Alfonso (Intergender Match) - Very bloody bout! Surprisingly vicious! \n\nTazz Vs. Bam Bam Bigelow (ECW Death Match) - These two had two PPV matches and in my book this one was overall the better of the two! \n\nTazz Vs. Shane Douglas (ECW World Title Match) - Okay match but the one from Guilty As Charged '99 a week earlier was better! My only guess why they didn't use this match was because it featured the late Chris Candido running in as well as Tammy Lynn Sytch (Sunny) but then again, that's never stopped WWE before so who knows! \n\nThe Dudley Boyz Vs. Spike Dudley &amp; Balls Mahoney (ECW World Tag Team Title Match) - This was made a Chicago Street Fight match with an ending reminisent of the Dudleyz' bout with Tommy Dreamer and The Sandman at the recent ECW One Night Stand! \n\nMike Awesome Vs. Spike Dudley (ECW World Title Match) - HOW THE HELL IS SPIKE NOT DEAD AFTER THIS MATCH?! He had his moments but Awesome really destroyed him! \n\nRhino Vs. Sandman - Not a bad bout from ECW on TNN. \n\nSuper Crazy Vs. Tajiri Vs. Little Guido (3 Way Dance) - These three always put on a great show together and this match is no exeception! \n\nTommy Dreamer Vs. C.W. Anderson (&quot;I Quit&quot; Match) - Very physical bout! Features alternate commentary from &quot;The Coach&quot; and Tommy Dreamer himself who admits he watched the legendary Magnum T.A. Vs. Tully Blanchard &quot;I Quit&quot; bout to get ready for this match! \n\nMike Awesome (RIP) Vs. Masato Tanaka - Their recent bout from ECW One Night Stand!\n\nVideo Features:\n384x288\nxvid\n25fps\n116kbps","torrent":{"xt":"urn:btih:f58928a33558ce2f52fecb24a3f6a39555bec5ff","amp;dn":"Bloodsport+%3A+ECW%5C%27s+Most+Violent+Matches+%282005%29+disc+2","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f58928a33558ce2f52fecb24a3f6a39555bec5ff","infoHashBuffer":{"type":"Buffer","data":[245,137,40,163,53,88,206,47,82,254,203,36,163,246,163,149,85,190,197,255]},"announce":[],"urlList":[]}}