{"title":"The Sound of Laughter - Peter Kay","uid":10241040,"size":1742167,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:fd6fc3ab38ceae1581c2ca3e113c6073de3dfb46&amp;dn=The+Sound+of+Laughter+-+Peter+Kay&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Mohammad_AT","files":3,"time":1401242609,"description":"Peter Kay's unerring gift for observing the absurdities and eccentricities of family life has earned himself a widespread, everyman appeal. These vivid observations coupled with a kind of nostalgia that never fails to grab his audience's shared understanding, have earned him comparisons with Alan Bennett and Ronnie Barker.\n\nIn his award winning TV series' he creates worlds populated by degenerate, bitter, useless, endearing and always recognisable characters which have attracted a huge and loyal following.\n\nIn many ways he's an old fashioned kind of comedian and the scope and enormity of his fanbase reflects this. He doesn't tell jokes about politics or sex, but rather rejoices in the far funnier areas of life: elderly relatives and answering machines, dads dancing badly at weddings, garlic bread and cheesecake, your mum's HRT...\n\nHis autobiography is full of this kind of humour and nostalgia, beginning with Kay's first ever driving lesson, taking him back through his Bolton childhood, the numerous jobs he held after school and leading up until the time he passed his driving test and found fame.\n\nReview\n\n&quot;His autobiography is filled to the very brim with funny bits&quot; heat &quot;He is every bit as amusing on the page as he is in person... Hilarious&quot; Sunday Express &quot;The Sound of Laughter provides as complete a picture of its subject's world view and creative evolution as any comedian's autobigraphy I can think of&quot; Independent on Sunday &quot;J. K. Rowling can't compete. Nor can Dan Brown. By selling more than a million copies in hardback, the highest figure since records began, this autobiography by the comedian Peter Kay has become a minor miracle&quot; The Times\n\nAbout the Author\n\nPeter Kay was born in Bolton in 1973. After leaving school with a GCSE in art, he held a series of jobs including working as a cinema usher, mobile disc jockey, in a factory packing toilet rolls, garage attendant and in a bingo hall. After a Btec in Performance Studies, he went on to win the 1997 So You Think You're Funny contest at the Edinburgh Festival and was nominated for the Perrier Award the following year. Peter Kay's first TV series was That Peter Kay Thing, followed by Phoenix Nights series 1 snd 2. The series Max and Paddy's Road to Nowhere was a spin off from Phoenix Nights. Peter Kay has played a cameo role in Coronation Street, has appeared in the recent series of Doctor Who and recently starred as Roger DeBris in the smash hit Mel Brooks musical The Producers in Manchester.","torrent":{"xt":"urn:btih:fd6fc3ab38ceae1581c2ca3e113c6073de3dfb46","amp;dn":"The+Sound+of+Laughter+-+Peter+Kay","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fd6fc3ab38ceae1581c2ca3e113c6073de3dfb46","infoHashBuffer":{"type":"Buffer","data":[253,111,195,171,56,206,174,21,129,194,202,62,17,60,96,115,222,61,251,70]},"announce":[],"urlList":[]}}